var status = 0;
var itemList =   
Array(   
Array(5076000,1000,1,1), //道具喇叭
Array(5077000,1000,1,1), //冰纷喇叭
Array(5390000,1000,1,1), //炽热	
Array(5390001,1000,1,1), //绚烂
Array(5390002,1000,1,1), //爱心
Array(5390003,1000,1,1), //新年1
Array(5390004,1000,1,1), //新年2
Array(5390005,1000,1,1), //小老虎
Array(5390006,1000,1,1), //虎咆哮
Array(2022118,1000,1,1), //管理员的祝福
Array(5150040,600,1,1), //皇家
Array(2000004,1000,5,1), //特殊
Array(2000005,1000,5,1), //超级
Array(2022002,1000,5,1), //雪碧
Array(2012002,1000,5,1), //古木
Array(2022178,1000,5,1), //万能
Array(2300001,1000,5,1), //高级鱼饵
Array(1082145,700,1,1), //工地黄
Array(1082146,700,1,1), //红
Array(1082147,700,1,1), //蓝
Array(1082148,700,1,1), //紫
Array(1082149,500,1,1), //褐
Array(1102041,500,1,1), //粉浪
Array(1102042,500,1,1), //紫浪
Array(1102040,700,1,1), //黄浪
Array(1102043,700,1,1), //褐浪
Array(1012070,500,1,1), //草莓
Array(1012071,600,1,1), //巧克力
Array(1012072,700,1,1), //甜瓜
Array(1012073,700,1,1), //西瓜
Array(1032026,500,1,1), //黄水晶耳环
Array(1032027,700,1,1), //黑水晶耳环
Array(1032028,700,1,1), //红水晶耳环
Array(1051098,500,1,1), //红浴巾
Array(1050100,500,1,1), //蓝浴巾
Array(1051140,500,1,1), //黄浴巾
Array(1050127,500,1,1), //黑浴巾
Array(1072262,700,1,1), //鞋子
Array(1072263,700,1,1), //鞋子
Array(1072264,700,1,1), //鞋子

Array(1432015,700,1,1), //红色滑雪板
Array(1432016,700,1,1), //橙色滑雪板
Array(1432017,600,1,1), //绿色滑雪板
Array(1432018,600,1,1), //蓝色滑雪板
Array(1442046,500,1,1), //超级滑雪板
Array(1302026,600,1,1), //黑雨伞
Array(1302025,700,1,1), //红雨伞
Array(1302027,700,1,1), //绿雨伞
Array(1302029,700,1,1), //褐雨伞
Array(1302028,700,1,1), //紫雨伞
Array(1302016,600,1,1), //黄雨伞
Array(1442011,700,1,1), //冲浪板
Array(1442028,700,1,1), //蓝色冲浪板
Array(1442027,600,1,1), //绿色冲浪板
Array(1442066,600,1,1), //红色冲浪板
Array(1442065,600,1,1), //蓝色冲浪板
Array(1402062,600,1,1), //贝音双手剑
Array(1442078,600,1,1), //贝音矛
Array(1472086,600,1,1), //贝音拳套
Array(1452071,600,1,1), //贝音弓
Array(1492037,600,1,1), //贝音短枪
Array(1302143,600,1,1), //一代单手剑
Array(1322086,600,1,1), //单手钝器
Array(1332121,600,1,1), //短刀
Array(1372074,600,1,1), //短仗
Array(1382095,600,1,1), //长仗
Array(1402086,600,1,1), //双手剑
Array(1412058,600,1,1), //双手斧
Array(1422059,600,1,1), //双手钝器
Array(1432077,600,1,1), //枪
Array(1442107,600,1,1), //矛
Array(1452102,600,1,1), //弓
Array(1462087,600,1,1), //弩
Array(1472032,600,1,1), //枫叶拳套
Array(1482021,600,1,1), //枫叶指节
Array(1492075,600,1,1), //手枪
Array(1092070,600,1,1), //战士盾牌
Array(1092075,600,1,1), //法师盾牌
Array(1092080,600,1,1), //飞侠盾牌
Array(1112435,500,1,1), //戒指
Array(1032080,500,1,1), //耳环
Array(1132036,500,1,1), //腰带
Array(1122081,500,1,1), //项链
Array(2370012,1000,1,1), //心书
Array(2370011,1000,1,1), //百战
Array(2370010,1000,1,1), //战国
Array(2370009,1000,1,1), //二十四
Array(2370008,1000,1,1), //三十六
Array(2370007,1000,1,1), //孙兵
Array(2370006,800,1,1), //李卫
Array(2370005,800,1,1), //司马
Array(2370004,500,1,1), //三
Array(2370003,500,1,1), //六韬
Array(2370002,400,1,1), //尉
Array(2370001,400,1,1), //吴子
Array(2370000,400,1,1), //孙子

Array(3010308,700,1,1), //四叶草椅子
Array(3010559,700,1,1), //龙蛋椅子
Array(3010034,700,1,1), //假期红色
Array(3010035,700,1,1), //假期蓝色
Array(3010036,700,1,1), //假期红色
Array(3010037,700,1,1), //假期红色
Array(3010039,700,1,1), //假期红色
Array(3010040,700,1,1), //假期红色
Array(3010041,700,1,1), //假期红色
Array(3010046,700,1,1), //假期红色
Array(3010047,700,1,1), //假期红色
Array(3010043,700,1,1), //假期红色
Array(3010044,700,1,1), //假期红色
Array(3010049,700,1,1), //假期红色
Array(3010024,700,1,1), //假期红色
Array(3010025,700,1,1), //假期红色
Array(3010029,700,1,1), //假期红色
Array(3010030,700,1,1), //假期红色
Array(3010031,700,1,1), //假期红色
Array(3010032,700,1,1), //假期红色
Array(3010033,700,1,1), //假期红色
Array(3010050,600,1,1), //假期红色
Array(3010051,600,1,1), //假期红色
Array(3010052,600,1,1), //假期红色
Array(3010054,600,1,1), //假期红色
Array(3010055,600,1,1), //假期红色
Array(3010057,600,1,1), //假期红色
Array(3010059,600,1,1), //假期红色
Array(3010061,600,1,1), //假期红色
Array(3010139,600,1,1), //假期红色
Array(3010075,600,1,1), //假期红色
Array(3010077,600,1,1), //假期红色
Array(3010078,600,1,1), //假期红色
Array(3010079,600,1,1), //假期红色
Array(3010080,600,1,1), //假期红色
Array(3010086,600,1,1), //假期红色
Array(3010093,600,1,1), //假期红色
Array(3010096,600,1,1), //假期红色
Array(3010100,600,1,1), //假期红色
Array(3010109,600,1,1), //假期红色
Array(3010108,600,1,1), //假期红色
Array(3010110,600,1,1), //假期红色
Array(3010112,600,1,1), //假期红色
Array(3010116,600,1,1), //假期红色
Array(3010133,600,1,1), //假期红色
Array(3010136,600,1,1), //假期红色
Array(3010137,600,1,1), //假期红色
Array(3010138,600,1,1), //假期红色
Array(3010140,600,1,1), //假期红色
Array(3010151,600,1,1), //假期红色
Array(3010152,600,1,1), //假期红色

			//武器卷轴系列
Array(2043001,500,1,1), //单手剑攻击卷60
Array(2043002,400,1,1), //单手剑攻击卷10
Array(2043004,500,1,1), //单手剑攻击卷70
Array(2043005,500,1,1), //单手剑攻击卷30
Array(2043011,500,1,1), //单手剑攻击卷65
Array(2043012,500,1,1), //单手剑攻击卷15
Array(2044001,500,1,1), //双手剑攻击卷60
Array(2044002,400,1,1), //双手剑攻击卷10
Array(2044004,500,1,1), //双手剑攻击卷70
Array(2044005,500,1,1), //双手剑攻击卷30
Array(2044006,500,1,1), //双手剑攻击卷65
Array(2044007,500,1,1), //双手剑攻击卷15
Array(2043201,500,1,1), //单手钝器攻击卷60
Array(2043202,500,1,1), //单手钝器攻击卷10
Array(2043204,500,1,1), //单手钝器攻击卷70
Array(2043205,500,1,1), //单手钝器攻击卷30
Array(2043206,500,1,1), //单手钝器攻击卷65
Array(2043207,500,1,1), //单手钝器攻击卷15
Array(2044201,500,1,1), //双手钝器攻击卷60
Array(2044202,500,1,1), //双手钝器攻击卷10
Array(2044204,500,1,1), //双手钝器攻击卷70
Array(2044205,500,1,1), //双手钝器攻击卷30
Array(2044206,500,1,1), //双手钝器攻击卷65
Array(2044207,500,1,1), //双手钝器攻击卷15
Array(2044301,500,1,1), //枪攻击卷60
Array(2044302,400,1,1), //枪攻击卷10
Array(2044304,500,1,1), //枪攻击卷70
Array(2044305,500,1,1), //枪攻击卷30
Array(2044306,500,1,1), //枪攻击卷65
Array(2044307,500,1,1), //枪攻击卷15
Array(2044401,500,1,1), //矛攻击卷60
Array(2044402,400,1,1), //矛攻击卷10
Array(2044404,500,1,1), //矛攻击卷70
Array(2044405,500,1,1), //矛攻击卷30
Array(2044406,500,1,1), //矛攻击卷65
Array(2044407,500,1,1), //矛攻击卷15
Array(2043701,500,1,1), //短杖魔力卷60
Array(2043702,400,1,1), //短杖魔力卷10
Array(2043704,500,1,1), //短杖魔力卷70
Array(2043705,500,1,1), //短杖魔力卷30
Array(2043706,500,1,1), //短杖魔力卷65
Array(2043707,500,1,1), //短杖魔力卷15
Array(2043801,500,1,1), //长杖魔力卷60
Array(2043802,400,1,1), //长杖魔力卷10
Array(2043804,500,1,1), //长杖魔力卷70
Array(2043805,500,1,1), //长杖魔力卷30
Array(2043806,500,1,1), //长杖魔力卷65
Array(2043807,500,1,1), //长杖魔力卷15
Array(2044501,500,1,1), //弓攻击卷60
Array(2044502,400,1,1), //弓攻击卷10
Array(2044504,500,1,1), //弓攻击卷70
Array(2044505,500,1,1), //弓攻击卷30
Array(2044506,500,1,1), //弓攻击卷65
Array(2044507,500,1,1), //弓攻击卷15
Array(2044601,500,1,1), //弩攻击卷60
Array(2044602,500,1,1), //弩攻击卷10
Array(2044604,500,1,1), //弩攻击卷70
Array(2044605,500,1,1), //弩攻击卷30
Array(2044606,500,1,1), //弩攻击卷65
Array(2044607,500,1,1), //弩攻击卷15
Array(2044701,500,1,1), //拳套攻击卷60
Array(2044702,400,1,1), //拳套攻击卷10
Array(2044704,500,1,1), //拳套攻击卷70
Array(2044705,500,1,1), //拳套攻击卷30
Array(2044706,500,1,1), //拳套攻击卷65
Array(2044707,500,1,1), //拳套攻击卷15
Array(2043301,500,1,1), //短剑攻击卷60
Array(2043302,400,1,1), //短剑攻击卷10
Array(2043304,500,1,1), //短剑攻击卷70
Array(2043305,500,1,1), //短剑攻击卷30
Array(2043306,500,1,1), //短剑攻击卷65
Array(2043307,500,1,1), //短剑攻击卷15
Array(2044901,500,1,1), //短枪攻击卷60
Array(2044902,400,1,1), //短枪攻击卷10
Array(2044903,500,1,1), //短枪攻击卷70
Array(2044904,500,1,1), //短枪攻击卷30
Array(2044906,500,1,1), //短枪攻击卷65
Array(2044907,500,1,1), //短枪攻击卷15
Array(2044801,500,1,1), //指节攻击卷60
Array(2044802,400,1,1), //指节攻击卷10
Array(2044803,500,1,1), //指节攻击卷70
Array(2044804,500,1,1), //指节攻击卷30

//防具卷轴系列
Array(2040012,500,1,1),// 头盔智力卷70
Array(2040013,500,1,1),// 头盔智力卷30
Array(2040014,600,1,1),// 头盔命中卷70
Array(2040015,600,1,1),// 头盔命中卷30
Array(2040016,600,1,1),// 头盔命中卷10
Array(2040017,600,1,1),// 头盔命中卷60
Array(2040025,500,1,1),// 头盔智力卷60
Array(2040026,500,1,1),// 头盔智力卷10
Array(2040028,500,1,1),// 头盔敏捷卷70
Array(2040029,500,1,1),// 头盔敏捷卷60
Array(2040030,500,1,1),// 头盔敏捷卷30
Array(2040031,500,1,1),// 头盔敏捷卷10
Array(2040406,600,1,1),// 上衣力量卷70
Array(2040407,600,1,1),// 上衣力量卷30
Array(2040410,600,1,1),// 上衣运气卷70
Array(2040411,600,1,1),// 上衣运气卷30
Array(2040412,600,1,1),// 上衣运气卷10
Array(2040413,600,1,1),// 上衣运气卷60
Array(2040418,600,1,1),// 上衣力量卷60
Array(2040419,600,1,1),// 上衣力量卷10
Array(2040424,600,1,1),// 上衣运气卷70
Array(2040425,600,1,1),// 上衣运气卷60
Array(2040426,600,1,1),// 上衣运气卷30
Array(2040427,600,1,1),// 上衣运气卷10
Array(2040610,600,1,1),// 裤裙敏捷卷70
Array(2040611,600,1,1),// 裤裙敏捷卷30
Array(2040612,600,1,1),// 裤裙敏捷卷10
Array(2040613,600,1,1),// 裤裙敏捷卷60
Array(2040624,600,1,1),// 裤裙敏捷卷70
Array(2040625,600,1,1),// 裤裙敏捷卷60
Array(2040626,600,1,1),// 裤裙敏捷卷30
Array(2040627,600,1,1),// 裤裙敏捷卷10
Array(2040501,400,1,1),// 全身铠甲敏捷卷60
Array(2040502,400,1,1),// 全身铠甲敏捷卷10
Array(2040508,400,1,1),// 全身铠甲敏捷卷70
Array(2040509,400,1,1),// 全身铠甲敏捷卷30
Array(2040513,400,1,1),// 全身铠甲智力卷60
Array(2040514,400,1,1),// 全身铠甲智力卷10
Array(2040516,400,1,1),// 全身铠甲运气卷60
Array(2040517,400,1,1),// 全身铠甲运气卷10
Array(2040518,400,1,1),// 全身盔甲智力卷70
Array(2040519,400,1,1),// 全身盔甲智力卷30
Array(2040520,400,1,1),// 全身盔甲运气卷70
Array(2040521,400,1,1),// 全身盔甲运气卷30
Array(2040522,400,1,1),// 全身盔甲敏捷卷65
Array(2040523,400,1,1),// 全身盔甲敏捷卷15
Array(2040526,400,1,1),// 全身盔甲智力卷65
Array(2040527,400,1,1),// 全身盔甲智力卷15
Array(2040528,400,1,1),// 全身盔甲运气卷65
Array(2040529,400,1,1),// 全身盔甲运气卷15
Array(2040531,400,1,1),// 全身盔甲力量卷70
Array(2040532,400,1,1),// 全身盔甲力量卷60
Array(2040533,400,1,1),// 全身盔甲力量卷30
Array(2040534,400,1,1),// 全身盔甲力量卷10
Array(2040701,600,1,1),// 鞋子敏捷卷60
Array(2040702,600,1,1),// 鞋子敏捷卷10
Array(2040704,500,1,1),// 鞋子跳跃卷60
Array(2040705,500,1,1),// 鞋子跳跃卷10
Array(2040712,600,1,1),// 鞋子敏捷卷70
Array(2040713,600,1,1),// 鞋子敏捷卷30
Array(2040718,600,1,1),// 鞋子敏捷卷65
Array(2040719,600,1,1),// 鞋子敏捷卷15
Array(2040720,500,1,1),// 鞋子跳跃卷65
Array(2040721,500,1,1),// 鞋子跳跃卷15
Array(2040801,500,1,1),// 手套敏捷卷60
Array(2040802,500,1,1),// 手套敏捷卷10
Array(2040804,400,1,1),// 手套攻击卷60
Array(2040805,400,1,1),// 手套攻击卷10
Array(2040808,500,1,1),// 手套敏捷卷70
Array(2040809,500,1,1),// 手套敏捷卷30
Array(2040810,400,1,1),// 手套攻击卷70
Array(2040811,400,1,1),// 手套攻击卷30
Array(2040814,500,1,1),// 手套魔力卷70
Array(2040815,500,1,1),// 手套魔力卷30
Array(2040816,500,1,1),// 手套魔力卷10
Array(2040817,500,1,1),// 手套魔力卷60
Array(2040819,500,1,1),// 手套敏捷卷65
Array(2040820,500,1,1),// 手套敏捷卷15
Array(2040821,400,1,1),// 手套攻击卷65
Array(2040822,400,1,1),// 手套攻击卷15
Array(2041013,600,1,1),// 披风力量卷60
Array(2041014,600,1,1),// 披风力量卷10
Array(2041016,600,1,1),// 披风智力卷60
Array(2041017,600,1,1),// 披风智力卷10
Array(2041019,600,1,1),// 披风敏捷卷60
Array(2041020,600,1,1),// 披风敏捷卷10
Array(2041022,600,1,1),// 披风运气卷60
Array(2041023,600,1,1),// 披风运气卷10
Array(2041034,600,1,1),// 披风力量卷70
Array(2041035,600,1,1),// 披风力量卷30
Array(2041036,600,1,1),// 披风智力卷70
Array(2041037,600,1,1),// 披风智力卷30
Array(2041038,600,1,1),// 披风敏捷卷70
Array(2041039,600,1,1),// 披风敏捷卷30
Array(2041040,600,1,1),// 披风运气卷70
Array(2041041,600,1,1),// 披风运气卷30
Array(2041050,600,1,1),// 披风力量卷65
Array(2041051,600,1,1),// 披风力量卷15
Array(2041052,600,1,1),// 披风智力卷65
Array(2041053,600,1,1),// 披风智力卷15
Array(2041054,600,1,1),// 披风敏捷卷65
Array(2041055,600,1,1),// 披风敏捷卷15
Array(2041056,600,1,1),// 披风运气卷65
Array(2041057,600,1,1),// 披风运气卷15
Array(2040301,600,1,1),// 耳环智力卷60
Array(2040302,600,1,1),// 耳环智力卷10
Array(2040304,600,1,1),// 耳环智力卷70
Array(2040305,600,1,1),// 耳环智力卷30
Array(2040306,600,1,1),// 耳环敏捷卷70
Array(2040307,600,1,1),// 耳环敏捷卷30
Array(2040313,600,1,1),// 耳环智力卷65
Array(2040314,600,1,1),// 耳环智力卷15
Array(2040317,600,1,1),// 耳环敏捷卷60
Array(2040318,600,1,1),// 耳环敏捷卷10
Array(2040320,600,1,1),// 耳环运气卷70
Array(2040321,600,1,1),// 耳环运气卷60
Array(2040322,600,1,1),// 耳环运气卷30
Array(2040323,600,1,1),// 耳环运气卷10
Array(2040329,600,1,1),// 耳环敏捷卷10
Array(2040330,600,1,1),// 耳环智力卷10
Array(2040331,600,1,1),// 耳环运气卷10
Array(2040105,600,1,1),// 脸部回避卷10
Array(2040106,600,1,1),// 脸部回避卷60
Array(2040108,600,1,1),// 脸部回避卷30
Array(2040109,600,1,1),// 脸部回避卷70
Array(2040200,600,1,1),// 眼部命中卷10
Array(2040201,600,1,1),// 眼部命中卷60
Array(2040203,600,1,1),// 眼部命中卷30
Array(2040204,600,1,1),// 眼部命中卷70
Array(2040205,600,1,1),// 眼部智力卷10
Array(2040206,600,1,1),// 眼部智力卷60
Array(2040208,600,1,1),// 眼部智力卷30
Array(2040209,600,1,1),// 眼部智力卷70
Array(2040906,500,1,1),// 盾牌运气卷70
Array(2040907,500,1,1),// 盾牌运气卷30
Array(2040914,500,1,1),// 盾牌攻击卷60
Array(2040915,500,1,1),// 盾牌攻击卷10
Array(2040916,500,1,1),// 盾牌攻击卷70
Array(2040917,500,1,1),// 盾牌攻击卷30
Array(2040919,500,1,1),// 盾牌魔力卷60
Array(2040920,500,1,1),// 盾牌魔力卷10
Array(2040921,500,1,1),// 盾牌魔力卷70
Array(2040922,500,1,1),// 盾牌魔力卷30
Array(2040924,500,1,1),// 盾牌运气卷60
Array(2040925,500,1,1),// 盾牌运气卷10
Array(2040930,500,1,1),// 盾牌力量卷70
Array(2040931,500,1,1),// 盾牌力量卷60
Array(2040932,500,1,1),// 盾牌力量卷30
Array(2040933,500,1,1),// 盾牌力量卷10
Array(2340000,300,1,1),// 祝福
			Array(2049100,300,1,1) //混沌
			//-------第一个是物品ID，第二个是抽奖概率，第三个是抽奖数量,第四个是是否提示抽奖广播(大于1就会广播)
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("箱子抽奖：#v2049100#混沌卷轴/#v2340000#祝福卷轴/#v2000005#超级药水x50.随机抽取其一.");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4032371, 1)) {
				var str1 = "";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("用#i4032371#即可进行抽奖。\r\n\r\n#r奖品展示:#k\r\n" + str1);
			} else {
            var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("#r#n每日奔跑活动#k\r\n你身上没有#b迷离的痕迹#k#i4032371#,无法进行最后的抽奖。\r\n#r活动简介；#k\r\n任务第一环在射手村可可处领取。\r\n获得迷离的痕迹后即可抽取奖励。#r【任务中途会被突然终结】#k\r\n朦胧的痕迹在明珠港\r\n稀迷得痕迹在魔法林         #b攻略#k；\r\n隐隐的痕迹在废弃都         #r每个地点的NPC需要抽取的#k\r\n模糊的痕迹在林中城         #r痕迹不同，但是有几率直接#k\r\n隐约的痕迹在大上海         #r抽到迷离就可以直接完成任务#k");
				cm.dispose();
			}
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * +1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "每日奔跑之快乐百宝箱", notice);
            if (item != -1) {
                cm.gainItem(4032371, -1);
				cm.setBossLog("zymxd");
				cm.setBossLog("mrbp");
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#4032371##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。但是作为鼓励，送给你5颗#v4001322#作为奖励.");
            cm.gainItem(4110000, -1);
            cm.gainItem(4001322, 5);
            cm.safeDispose();
        }
    }
}