var status = 0;
var itemList =   
Array(   
//-----椅子-----
Array(3010013, 1, 1, 1), //悠长假期
Array(3010014, 1, 1, 1), //弯
Array(3010018, 1, 1, 1), //椰子树沙滩椅
Array(3010019, 1, 1, 1), //寿司椅
Array(3010021, 1, 1, 1), //暖暖桌
Array(3010025, 1, 1, 1), //枫叶纪念凳
Array(3010028, 1, 1, 1), //海盗的俘虏
Array(3010044,1,1,1), //红伞椅子
Array(3010036,1,1,1), //秋千
Array(3010049,1,1,1), //学房子
Array(3010110,1,1,1), //熊
Array(3010131,1,1,1), //熊猫
Array(1022129,1,1,1), //眼睛
Array(3012001,1,1,1), //篝火 
Array(3012002,1,1,1), //浴桶
Array(3012003,1,1,1), //
Array(3010013,1,1,1), //遮阳椅
Array(3010018,1,1,1), //椰子树
Array(3010021,1,1,1), //暖暖桌
Array(3010024,1,1,1), //玩具熊
Array(3010025,1,1,1), //5周年枫叶纪念
Array(3010026,1,1,1), //恶灵附身
Array(3010034,1,1,1), //假期红
Array(3010035,1,1,1), //假期蓝
Array(3010043,1,1,1), //魔女扫把
Array(3010051,1,1,1), //沙漠兔兔1
Array(3010052,1,1,1), //沙漠兔兔2
Array(3010054,1,1,1), //呼噜床
Array(3010057,1,1,1), //血色玫瑰
Array(3010058,1,1,1), //世界末日
Array(3010063,1,1,1), //星星
Array(3010068,1,1,1), //露水椅子
Array(3010069,1,1,1), //大黄蜂
Array(3010071,1,1,1), //神兽椅子
Array(3010075,1,1,1), //狂
Array(3010075,1,1,1), //大熊猫
Array(3010079,1,1,1), //肥猫
Array(3010085,1,1,1), //鬼娃娃椅子
Array(3010096,1,1,1), //恐龙化石
Array(3010099,1,1,1), //北极熊椅子
Array(3010109,1,1,1), //暖炉椅子
Array(3010110,1,1,1), //白熊
Array(3010129,1,1,1), //酋长宝座
Array(3010139,1,1,1), //私密空间
Array(3010140,1,1,1), //早日康复
Array(3010147,1,1,1), //龙蛋椅子
Array(3010149,1,1,1), //风扇
Array(3010151,1,1,1), //无人岛
Array(3010151,1,1,1), //三角张峰
Array(3010169,1,1,1), //求领养
Array(3010172,1,1,1), //星空椅子
Array(3010175,1,1,1), //名画家椅子
Array(3010193,1,1,1), //炼金瓶
Array(3010195,1,1,1), //无价之宝
Array(3010195,1,1,1), //泡泡浴缸
Array(3010289,1,1,1), //老奶奶读通话
Array(3010293,1,1,1), //恶灵椅子
Array(3010403,1,1,1), //会
Array(3010410,1,1,1), //珍妮
Array(3010411,1,1,1), //双鱼
Array(3010412,1,1,1), //双塔
Array(3010428,1,1,1), //水晶
Array(3010437,1,1,1), //魔法书
Array(3010438,1,1,1), //音符
Array(3010453,1,1,1), //兔子
Array(3010454,1,1,1), //云朵
Array(3010462,1,1,1), //天文台
Array(3010494,1,1,1), //TV椅子
Array(3010505,1,1,1), //看球赛
Array(3010515,1,1,1), //奇石椅子
Array(3010609,1,1,1), //不是在做梦
Array(3010622,1,1,1), //丹真
Array(3010632,1,1,1), //印第安
Array(3010633,1,1,1), //印第安
Array(3010659,1,1,1), //巴士
Array(3010716,1,1,1), //超级蘑菇
Array(3010729,1,1,1), //孤独男子
Array(3010730,1,1,1), //小企鹅合唱团
Array(3010733,1,1,1), //椅子
Array(3010738,1,1,1), //三人组
Array(3010739,1,1,1), //香波
Array(3010753,1,1,1), //鸟笼
Array(3010767,1,1,1), //椅子
Array(3010760,1,1,1), //古代浴池
Array(3010879,1,1,1), //繁星
Array(3010937,1,1,1), //异界
Array(3010938,1,1,1), //异界
Array(3010939,1,1,1), //异界
Array(3010946,1,1,1), //森林伙伴
Array(3012007,1,1,1), //石狮
Array(3012008,1,1,1), //稻荷神社
Array(3012011,1,1,1), //火锅
Array(3012022,1,1,1), //寿司
Array(3015053,1,1,1), //三重杨
Array(3015120,1,1,1), //枕头大战
Array(3015264,1,1,1), //美味厨房
Array(3015158,1,1,1), //印第安
Array(3015158,1,1,1), //印第安
Array(3015158,1,1,1), //印第安
Array(3010029, 1, 1, 1), //蓝环凳
Array(3010030, 1, 1, 1), //黑环凳
Array(3010031, 1, 1, 1), //红环凳
Array(3010032, 1, 1, 1), //黄环凳
Array(3010033, 1, 1, 1), //绿环凳
Array(3010037, 1, 1, 1), //猪猪凳
Array(3010044, 1, 1, 1), //同一红伞下
Array(3012001, 1, 1, 1), //篝火
Array(3012002, 1, 1, 1), //浴桶
Array(3010073, 1, 1, 1), //PB克缤
Array(3012003, 1, 1, 1), //椅子
Array(3010012, 1, 1, 1), //剑士 宝座
Array(3010025, 1, 1, 1), //枫叶纪念凳
Array(3010037, 1, 1, 1), //猪猪凳
Array(3010038, 1, 1, 1), //椅子
Array(3010040, 1, 1, 1), //蝙蝠椅
Array(3010041, 1, 1, 1), //王座
Array(3010043, 1, 1, 1), //魔女的飞扫把
Array(3010044, 1, 1, 1), //同一红伞下
Array(3010045, 1, 1, 1), //寒冰椅子
Array(3010046, 1, 1, 1), //红龙椅
Array(3010047, 1, 1, 1), //蓝龙椅
Array(3010048, 1, 1, 1), //圣诞树椅子
Array(3010049, 1, 1, 1), //雪房子
Array(3010050, 1, 1, 1), //公主凳
Array(3010057, 1, 1, 1), //血色玫瑰
Array(3010058, 1, 1, 1), //世界末日
Array(3010068, 1, 1, 1), //露水椅子
Array(3010071, 1, 1, 1), //神兽椅
Array(3010077, 1, 1, 1), //猫头鹰椅子
Array(3010085, 1, 1, 1), //鬼娃娃椅子
Array(3010096, 1, 1, 1), //恐龙化石宝座
Array(3010095, 1, 1, 1), //石头人座椅
Array(3010094, 1, 1, 1), //漂漂猪椅子
Array(3010098, 1, 1, 1), //宅人4001226
Array(4001226, 1, 1, 1), //宅人4001226
Array(4001227, 1, 1, 1), //宅人4001226
Array(4001228, 1, 1, 1), //宅人4001226
Array(4001229, 1, 1, 1), //宅人4001226
Array(4001230, 1, 1, 1), //宅人4001226
Array(3010106, 1, 1, 1), //雪狼战椅
Array(3010112, 1, 1, 1),
Array(2040000, 500, 1, 0), //头盔防御卷轴 成功率100%
Array(2040001, 500, 1, 0), //头盔防御卷轴60%
Array(2040002, 500, 1, 0), //头盔防御卷轴10%
Array(2040003, 500, 1, 0), //头盔体力卷轴100%
Array(2040004, 500, 1, 0), //头盔体力卷轴60%
Array(2040005, 500, 1, 0), //头盔体力卷轴10%
Array(2040008, 500, 1, 0), //头盔防御诅咒卷轴70%
Array(2040009, 500, 1, 0), //头盔防御诅咒卷轴30%
Array(2040010, 500, 1, 0), //头盔体力诅咒卷轴70%
Array(2040011, 500, 1, 0), //头盔体力诅咒卷轴30%
Array(2040012, 500, 1, 1), //头盔智力卷轴70%
Array(2040013, 500, 1, 1), //头盔智力卷轴30%
Array(2040014, 500, 1, 0), //头盔命中率诅咒卷轴70%
Array(2040015, 500, 1, 0), //头盔命中率诅咒卷轴30%
Array(2040016, 500, 1, 0), //头盔命中率卷轴10%
Array(2040017, 500, 1, 0), //头盔命中率卷轴60%
Array(2040018, 500, 1, 0), //头盔命中率卷轴100%
Array(2040019, 500, 1, 0), //头盔防御卷轴65%
Array(2040021, 500, 1, 0), //头盔体力卷轴65%
Array(2040024, 500, 1, 0), //头盔智力卷轴100%
Array(2040025, 500, 1, 0), //头盔智力卷轴60%
Array(2040026, 500, 1, 1), //头盔智力卷轴10%
Array(2040027, 500, 1, 0), //头盔敏捷卷轴100%
Array(2040028, 500, 1, 0), //头盔敏捷卷轴70%
Array(2040029, 500, 1, 0), //头盔敏捷卷轴60%
Array(2040030, 500, 1, 0), //头盔敏捷卷轴30%
Array(2040031, 500, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 500, 1, 0), //脸部装饰生命卷轴10%
Array(2040101, 500, 1, 0), //脸部装饰生命卷轴60%
Array(2040103, 500, 1, 0), //脸部装饰生命诅咒卷轴30%
Array(2040104, 500, 1, 0), //脸部装饰生命诅咒卷轴70%
Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 500, 1, 0), //脸部装饰回避率卷轴60%
Array(2040108, 500, 1, 0), //脸部装饰回避率诅咒卷轴30%
Array(2040109, 500, 1, 0), //脸部装饰回避率诅咒卷轴70%
Array(2040200, 2, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 2, 1, 1), //眼部装饰命中率卷轴60%
Array(2040203, 2, 1, 1), //眼部装饰命中率诅咒卷轴30%
Array(2040204, 2, 1, 1), //眼部装饰命中率诅咒卷轴70%
Array(2040205, 2, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 2, 1, 1), //眼部装饰智力卷轴60%
Array(2040208, 2, 1, 1), //眼部装饰智力诅咒卷轴30%
Array(2040209, 2, 1, 1), //眼部装饰智力诅咒卷轴70%
Array(2040300, 1, 1, 0), //耳环智力卷轴100%
Array(2040301, 1, 1, 0), //耳环智力卷轴60%
Array(2040302, 1, 1, 1), //耳环智力卷轴10%
Array(2040304, 1, 1, 0), //耳环智力诅咒卷轴70%
Array(2040305, 1, 1, 0), //耳环智力诅咒卷轴30%
Array(2040306, 2, 1, 0), //耳环敏捷卷轴70%
Array(2040307, 2, 1, 0), //耳环敏捷卷轴30%
Array(2040308, 500, 1, 0), //耳环防御力诅咒卷轴70%
Array(2040309, 500, 1, 0), //耳环防御力诅咒卷轴30%
Array(2040310, 500, 1, 0), //耳环防御力卷轴10%
Array(2040311, 500, 1, 0), //耳环防御力卷轴60%
Array(2040312, 500, 1, 0), //耳环防御力卷轴100%
Array(2040313, 1, 1, 1), //耳环智力卷轴65%
Array(2040314, 2, 1, 1), //耳环智力卷轴15%
Array(2040316, 1, 1, 0), //耳环敏捷卷轴100%
Array(2040317, 1, 1, 0), //耳环敏捷卷轴60%
Array(2040318, 2, 1, 1), //耳环敏捷卷轴10%
Array(2040319, 2, 1, 0), //耳环装饰运气卷轴100%
Array(2040320, 2, 1, 0), //耳环运气卷轴70%
Array(2040321, 2, 1, 0), //耳环装饰运气卷轴60%
Array(2040322, 2, 1, 0), //耳环装饰运气卷轴30%
Array(2040323, 1, 1, 1), //耳环运气卷轴10%
Array(2040324, 500, 1, 0), //耳环装饰体力卷轴100%
Array(2040325, 600, 1, 0), //耳环装饰体力卷轴70%
Array(2040326, 1, 1, 0), //耳环装饰体力卷轴60%
Array(2040327, 1, 1, 0), //耳环装饰体力卷轴30%
Array(2040328, 1, 1, 0), //耳环装饰体力卷轴10%
Array(2040400, 500, 1, 0), //上衣防御卷轴100%
Array(2040401, 500, 1, 0), //上衣防御卷轴60%
Array(2040402, 500, 1, 0), //上衣防御卷轴10%
Array(2040404, 500, 1, 0), //上衣防御诅咒卷轴70%
Array(2040405, 500, 1, 0), //上衣防御诅咒卷轴30%
Array(2040406, 500, 1, 0), //上衣力量卷轴70%
Array(2040407, 500, 1, 0), //上衣力量卷轴30%
Array(2040408, 500, 1, 0), //上衣体力卷轴70%
Array(2040409, 500, 1, 0), //上衣体力卷轴30%
Array(2040410, 600, 1, 0), //上衣运气诅咒卷轴70%
Array(2040411, 600, 1, 0), //上衣运气诅咒卷轴30%
Array(2040412, 600, 1, 0), //上衣运气卷轴10%
Array(2040413, 600, 1, 0), //上衣运气卷轴60%
Array(2040414, 500, 1, 0), //上衣运气卷轴100%
Array(2040415, 500, 1, 0), //上衣防御力卷轴65%
Array(2040416, 2, 1, 0), //上衣防御力卷轴15%
Array(2040417, 500, 1, 0), //上衣力量卷轴100%
Array(2040418, 500, 1, 0), //上衣力量卷轴60%
Array(2040419, 500, 1, 0), //上衣力量卷轴10%
Array(2040420, 500, 1, 0), //上衣体力卷轴100%
Array(2040421, 500, 1, 0), //上衣体力卷轴60%
Array(2040422, 500, 1, 0), //上衣体力卷轴10%
Array(2040423, 500, 1, 0), //上衣运气卷轴100%
Array(2040424, 500, 1, 0), //上衣运气卷轴70%
Array(2040425, 500, 1, 0), //上衣运气卷轴60%
Array(2040426, 500, 1, 0), //上衣运气卷轴30%
Array(2040427, 500, 1, 0), //上衣运气卷轴10%
Array(2040500, 500, 1, 0), //全身铠甲敏捷卷轴100%
Array(2040501, 2, 1, 0), //全身铠甲敏捷卷轴60%
Array(2040502, 1, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040503, 600, 1, 0), //全身铠甲防御卷轴100%
Array(2040504, 1, 1, 0), //全身铠甲防御卷轴60%
Array(2040505, 2, 1, 0), //全身铠甲防御卷轴10%
Array(2040508, 600, 1, 0), //全身铠甲敏捷诅咒卷轴70%
Array(2040509, 600, 1, 0), //全身铠甲敏捷诅咒卷轴30%
Array(2040510, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040511, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040512, 600, 1, 0), //全身铠甲智力卷轴100%
Array(2040513, 600, 1, 0), //全身铠甲智力卷轴60%
Array(2040514, 2, 1, 0), //全身铠甲智力卷轴10%
Array(2040515, 400, 1, 1), //全身铠甲运气卷轴100%
Array(2040516, 400, 1, 0), //全身铠甲运气卷轴60%
Array(2040517, 600, 1, 0), //全身铠甲运气卷轴10%
Array(2040518, 400, 1, 0), //全身盔甲智力卷轴70%
Array(2040519, 400, 1, 0), //全身盔甲智力卷轴30%
Array(2040520, 400, 1, 0), //全身盔甲幸运卷轴70%
Array(2040521, 400, 1, 0), //全身盔甲幸运卷轴30%
Array(2040522, 400, 1, 0), //全身盔甲敏捷卷轴65%
Array(2040523, 2, 1, 0), //全身盔甲敏捷卷轴15%
Array(2040524, 400, 1, 0), //全身盔甲防御卷轴65%
Array(2040525, 2, 1, 0), //全身盔甲防御卷轴15%
Array(2040526, 600, 1, 0), //全身盔甲智力卷轴65%
Array(2040528, 600, 1, 0), //全身盔甲幸运卷轴65%
Array(2040530, 500, 1, 0), //全身盔甲力量卷轴100%
Array(2040531, 400, 1, 0), //全身盔甲力量卷轴70%
Array(2040532, 400, 1, 0), //全身盔甲力量卷轴60%
Array(2040533, 400, 1, 0), //全身盔甲力量卷轴30%
Array(2040534, 600, 1, 1), //全身盔甲力量卷轴10%
Array(2040600, 500, 1, 0), //裤/裙防御卷轴100%
Array(2040601, 500, 1, 0), //裤/裙防御卷轴60%
Array(2040602, 500, 1, 0), //裤/裙防御卷轴10%
Array(2040604, 500, 1, 0), //裤/裙防御诅咒卷轴70%
Array(2040605, 500, 1, 0), //裤/裙防御诅咒卷轴30%
Array(2040606, 500, 1, 0), //裤裙跳跃诅咒卷轴70%
Array(2040607, 500, 1, 0), //裤裙跳跃诅咒卷轴30%
Array(2040608, 500, 1, 0), //裤裙体力诅咒卷轴70%
Array(2040609, 500, 1, 0), //裤裙体力诅咒卷轴30%
Array(2040610, 500, 1, 0), //裤裙敏捷诅咒卷轴70%
Array(2040611, 500, 1, 0), //裤裙敏捷诅咒卷轴30%
Array(2040612, 500, 1, 0), //裤裙敏捷卷轴10%
Array(2040613, 500, 1, 0), //裤裙敏捷卷轴60%
Array(2040614, 500, 1, 0), //裤裙敏捷卷轴100%
Array(2040615, 500, 1, 0), //裤裙防御卷轴65%
Array(2040616, 2, 1, 0), //裤裙防御卷轴15%
Array(2040617, 500, 1, 0), //裤裙跳跃卷轴100%
Array(2040618, 500, 1, 0), //裤裙跳跃卷轴60%
Array(2040619, 500, 1, 0), //裤裙跳跃卷轴10%
Array(2040620, 500, 1, 0), //裤裙体力卷轴100%
Array(2040621, 500, 1, 0), //裤裙体力卷轴60%
Array(2040622, 500, 1, 0), //裤裙体力卷轴10%
Array(2040623, 600, 1, 0), //裤裙敏捷卷轴100%
Array(2040624, 600, 1, 0), //裤裙敏捷卷轴70%
Array(2040625, 600, 1, 0), //裤裙敏捷卷轴60%
Array(2040626, 600, 1, 0), //裤裙敏捷卷轴30%
Array(2040627, 2, 1, 0), //裤裙敏捷卷轴10%
Array(2040700, 2, 1, 0), //鞋子敏捷度卷轴100%
Array(2040701, 600, 1, 0), //鞋子敏捷度卷轴60%
Array(2040702, 400, 1, 0), //鞋子敏捷度卷轴10%
Array(2040703, 2, 1, 0), //鞋子跳跃卷轴100%
Array(2040704, 600, 1, 0), //鞋子跳跃卷轴60%
Array(2040705, 400, 1, 0), //鞋子跳跃卷轴10%
Array(2040706, 500, 1, 0), //鞋子速度卷轴100%
Array(2040707, 500, 1, 0), //鞋子速度卷轴60%
Array(2040708, 500, 1, 0), //鞋子速度卷轴10%
Array(2040712, 500, 1, 0), //鞋子敏捷诅咒卷轴70%
Array(2040713, 500, 1, 0), //鞋子敏捷诅咒卷轴30%
Array(2040714, 500, 1, 0), //鞋子跳跃诅咒卷轴70%
Array(2040715, 500, 1, 0), //鞋子跳跃诅咒卷轴30%
Array(2040716, 500, 1, 0), //鞋子速度诅咒卷轴70%
Array(2040717, 500, 1, 0), //鞋子速度诅咒卷轴30%
Array(2040718, 600, 1, 0), //鞋子敏捷卷轴65%
Array(2040719, 4, 1, 0), //鞋子敏捷卷轴15%
Array(2040720, 600, 1, 0), //鞋子跳跃卷轴65%
Array(2040721, 2, 1, 0), //鞋子跳跃卷轴15%
Array(2040722, 500, 1, 0), //鞋子速度卷轴65%
Array(2040727, 500, 1, 0), //鞋子防滑卷轴10%
Array(2040800, 600, 1, 1), //手套敏捷卷轴100%
Array(2040801, 4, 1, 1), //手套敏捷卷轴60%
Array(2040802, 600, 1, 1), //手套敏捷卷轴10%
Array(2040803, 1, 1, 1), //手套攻击卷轴100%
Array(2040804, 4, 1, 1), //手套攻击卷轴60%
Array(2040805, 2, 1, 1), //手套攻击卷轴10%
Array(2040808, 500, 1, 0), //手套敏捷诅咒卷轴70%
Array(2040809, 500, 1, 0), //手套敏捷诅咒卷轴30%
Array(2040810, 1, 1, 1), //手套攻击诅咒卷轴70%
Array(2040811, 1, 1, 1), //手套攻击诅咒卷轴30%
Array(2040812, 500, 1, 0), //手套体力卷轴70%
Array(2040813, 500, 1, 0), //手套体力卷轴30%
Array(2040814, 500, 1, 0), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 0), //手套魔力诅咒卷轴30%
Array(2040816, 500, 1, 0), //手套魔力卷轴10%
Array(2040817, 500, 1, 0), //手套魔力卷轴60%
Array(2040818, 500, 1, 0), //手套魔力卷轴100%
Array(2040819, 500, 1, 0), //手套敏捷卷轴65%
Array(2040820, 2, 1, 0), //手套敏捷卷轴15%
Array(2040821, 2, 1, 1), //手套攻击卷轴65%
Array(2040822, 2, 1, 1), //手套攻击卷轴15%
Array(2040823, 2, 1, 0), //手套体力卷轴100%
Array(2040824, 500, 1, 0), //手套体力卷轴60%
Array(2040825, 500, 1, 0), //手套体力卷轴10%
Array(2040900, 500, 1, 0), //盾牌防御卷轴
Array(2040901, 500, 1, 0), //盾牌防御卷轴60%
Array(2040902, 500, 1, 0), //盾牌防御卷轴10%
Array(2040904, 500, 1, 0), //盾牌防御诅咒卷轴70%
Array(2040905, 500, 1, 0), //盾牌防御诅咒卷轴30%
Array(2040906, 500, 1, 0), //盾牌运气卷轴70%
Array(2040907, 500, 1, 0), //盾牌运气卷轴30%
Array(2040908, 500, 1, 0), //盾牌体力卷轴70%
Array(2040909, 500, 1, 0), //盾牌体力卷轴30%
Array(2040910, 500, 1, 0), //盾牌防御卷轴65%
Array(2040911, 2, 1, 0), //盾牌防御卷轴15%
Array(2040914, 6, 1, 0), //盾牌攻击卷轴60%
Array(2040915, 6, 1, 0), //盾牌攻击卷轴10%
Array(2040916, 400, 1, 0), //盾牌攻击诅咒卷轴70%
Array(2040917, 2, 1, 0), //盾牌攻击诅咒卷轴30%
Array(2040919, 2, 1, 0), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 0), //盾牌魔力卷轴10%
Array(2040921, 600, 1, 0), //盾牌魔力诅咒卷轴70%
Array(2040922, 400, 1, 0), //盾牌魔力诅咒卷轴30%
Array(2040923, 2, 1, 0), //盾牌运气卷轴100%
Array(2040924, 600, 1, 0), //盾牌运气卷轴60%
Array(2040925, 4, 1, 0), //盾牌运气卷轴10%
Array(2040926, 800, 1, 0), //盾牌体力卷轴100%
Array(2040927, 800, 1, 0), //盾牌体力卷轴60%
Array(2040928, 800, 1, 0), //盾牌体力卷轴10%
Array(2040929, 4, 1, 0), //盾牌力量卷轴100%
Array(2040930, 600, 1, 0), //盾牌力量卷轴70%
Array(2040931, 2, 1, 0), //盾牌力量卷轴60%
Array(2040932, 1, 1, 0), //盾牌力量卷轴30%
Array(2040933, 600, 1, 0), //盾牌力量卷轴10%
Array(2041000, 600, 1, 0), //披风魔防卷轴100%
Array(2041001, 600, 1, 0), //披风魔防卷轴60%
Array(2041002, 600, 1, 0), //披风魔防卷轴10%
Array(2041003, 600, 1, 0), //披风防御卷轴100%
Array(2041004, 600, 1, 0), //披风防御卷轴60%
Array(2041005, 600, 1, 0), //披风防御卷轴10%
Array(2041006, 600, 1, 0), //披风体力卷轴100%
Array(2041007, 600, 1, 0), //披风体力卷轴60%
Array(2041008, 600, 1, 0), //披风体力卷轴10%
Array(2041009, 600, 1, 0), //披风魔力卷轴100%
Array(2041010, 600, 1, 0), //披风魔力卷轴60%
Array(2041011, 600, 1, 0), //披风魔力卷轴10%
Array(2041012, 600, 1, 0), //披风力量卷轴100%
Array(2041013, 600, 1, 0), //披风力量卷轴60%
Array(2041014, 600, 1, 0), //披风力量卷轴10%
Array(2041015, 3, 1, 0), //披风智力卷轴100%
Array(2041016, 600, 1, 0), //披风智力卷轴60%
Array(2041017, 600, 1, 0), //披风智力卷轴10%
Array(2041018, 600, 1, 0), //披风敏捷卷轴100%
Array(2041019, 600, 1, 0), //披风敏捷卷轴60%
Array(2041020, 600, 1, 0), //披风敏捷卷轴10%
Array(2041021, 600, 1, 0), //披风运气卷轴100%
Array(2041022, 600, 1, 0), //披风运气卷轴60%
Array(2041023, 600, 1, 0), //披风运气卷轴10%
Array(2041026, 600, 1, 0), //披风魔防诅咒卷轴70%
Array(2041027, 600, 1, 0), //披风魔防诅咒卷轴30%
Array(2041028, 600, 1, 0), //披风防御诅咒卷轴70%
Array(2041029, 600, 1, 0), //披风防御诅咒卷轴30%
Array(2041030, 600, 1, 0), //披风体力诅咒卷轴70%
Array(2041031, 600, 1, 0), //披风体力诅咒卷轴30%
Array(2041032, 600, 1, 0), //披风魔力诅咒卷轴70%
Array(2041033, 600, 1, 0), //披风魔力诅咒卷轴30%
Array(2041034, 600, 1, 0), //披风力量诅咒卷轴70%
Array(2041035, 600, 1, 0), //披风力量诅咒卷轴30%
Array(2041036, 600, 1, 0), //披风智力诅咒卷轴70%
Array(2041037, 600, 1, 0), //披风智力诅咒卷轴30%
Array(2041038, 600, 1, 0), //披风敏捷诅咒卷轴70%
Array(2041039, 600, 1, 0), //披风敏捷诅咒卷轴30%
Array(2041040, 600, 1, 0), //披风运气诅咒卷轴70%
Array(2041041, 600, 1, 0), //披风运气诅咒卷轴30%
Array(2041042, 600, 1, 0), //披风魔法防御卷轴65%
Array(2041043, 2, 1, 0), //披风魔法防御卷轴15%
Array(2041044, 600, 1, 0), //披风物理防御卷轴65%
Array(2041045, 2, 1, 0), //披风物理防御卷轴15%
Array(2041046, 600, 1, 0), //披风体力卷轴65%
Array(2041047, 2, 1, 0), //披风体力卷轴15%
Array(2041048, 600, 1, 0), //披风魔力卷轴65%
Array(2041049, 2, 1, 0), //披风魔力卷轴15%
Array(2041050, 600, 1, 0), //披风力卷轴65%
Array(2041051, 2, 1, 0), //披风力卷轴15%
Array(2041052, 600, 1, 0), //披风智力卷轴65%
Array(2041053, 2, 1, 0), //披风智力卷轴15%
Array(2041054, 600, 1, 0), //披风敏捷卷轴65%
Array(2041055, 2, 1, 0), //披风敏捷卷轴15%
Array(2041056, 600, 1, 0), //披风幸运卷轴65%
Array(2041057, 2, 1, 1), //披风幸运卷轴15%
Array(2041058, 600, 1, 1), //披风防寒卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041203, 600, 1, 1), //项链运气卷轴100%
Array(2041204, 600, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 600, 1, 1), //项链运气诅咒卷轴70%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041208, 600, 1, 1), //项链力量卷轴100%
Array(2041209, 600, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 600, 1, 1), //项链力量诅咒卷轴70%
Array(2041301, 600, 1, 0), //腰带力量卷轴60%
Array(2041304, 600, 1, 0), //腰带智力卷轴60%
Array(2041307, 600, 1, 0), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 0), //腰带运气卷轴60%
Array(2043000, 600, 1, 0), //单手剑攻击卷轴100%
Array(2043001, 600, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 600, 1, 0), //单手剑攻击卷轴10%
Array(2043004, 600, 1, 0), //单手剑攻击诅咒卷轴70%
Array(2043005, 600, 1, 0), //单手剑攻击诅咒卷轴30%
Array(2043006, 600, 1, 0), //单手剑魔力诅咒卷轴70%
Array(2043007, 600, 1, 0), //单手剑魔力诅咒卷轴30%
Array(2043008, 600, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 600, 1, 0), //单手剑魔力卷轴60%
Array(2043010, 600, 1, 0), //单手剑魔力卷轴100%
Array(2043011, 600, 1, 0), //单手剑攻击卷轴65%
Array(2043012, 2, 1, 0), //单手剑攻击卷轴15%
Array(2043015, 600, 1, 0), //单手剑命中率卷轴100%
Array(2043016, 600, 1, 0), //单手剑命中率卷轴70%
Array(2043017, 600, 1, 0), //单手剑命中率卷轴60%
Array(2043018, 600, 1, 0), //单手剑命中率卷轴30%
Array(2043019, 600, 1, 0), //单手剑命中率卷轴10%
Array(2043024, 600, 1, 0), //单手剑命中卷轴65%
Array(2043025, 2, 1, 0), //单手剑命中卷轴15%
Array(2043100, 600, 1, 0), //单手斧攻击卷轴100%
Array(2043101, 600, 1, 0), //单手斧攻击卷轴60%
Array(2043102, 600, 1, 0), //单手斧攻击卷轴10%
Array(2043104, 400, 1, 0), //单手斧攻击诅咒卷轴70%
Array(2043105, 400, 1, 0), //单手斧攻击诅咒卷轴30%
Array(2043106, 400, 1, 0), //单手斧攻击卷轴65%
Array(2043107, 2, 1, 0), //单手斧攻击卷轴15%
Array(2043110, 400, 1, 0), //单手斧命中率卷轴100%
Array(2043111, 400, 1, 0), //单手斧命中率卷轴70%
Array(2043112, 400, 1, 0), //单手斧命中率卷轴60%
Array(2043113, 400, 1, 0), //单手斧命中率卷轴30%
Array(2043114, 400, 1, 0), //单手斧命中率卷轴10%
Array(2043118, 400, 1, 0), //单手斧命中卷轴65%
Array(2043119, 2, 1, 0), //单手斧命中卷轴15%
Array(2043200, 400, 1, 0), //单手钝器攻击卷轴100%
Array(2043201, 400, 1, 0), //单手钝器攻击卷轴60%
Array(2043202, 400, 1, 0), //单手钝器攻击卷轴10%
Array(2043204, 400, 1, 0), //单手钝器攻击诅咒卷轴70%
Array(2043205, 400, 1, 0), //单手钝器攻击诅咒卷轴30%
Array(2043206, 400, 1, 0), //单手钝器攻击卷轴65%
Array(2043207, 2, 1, 0), //单手钝器攻击卷轴15%
Array(2043210, 400, 1, 0), //单手钝器命中率卷轴100%
Array(2043211, 400, 1, 0), //单手钝器命中率卷轴70%
Array(2043212, 400, 1, 0), //单手钝器命中率卷轴60%
Array(2043213, 400, 1, 0), //单手钝器命中率卷轴30%
Array(2043214, 400, 1, 0), //单手钝器命中率卷轴10%
Array(2043218, 400, 1, 0), //单手钝器命中卷轴65%
Array(2043219, 2, 1, 0), //单手钝器命中卷轴15%
Array(2043300, 450, 1, 0), //短剑攻击卷轴100%
Array(2043301, 400, 1, 0), //短剑攻击卷轴60%
Array(2043302, 400, 1, 0), //短剑攻击卷轴10%
Array(2043304, 400, 1, 0), //短剑攻击诅咒卷轴70%
Array(2043305, 400, 1, 0), //短剑攻击诅咒卷轴30%
Array(2043306, 400, 1, 0), //短剑攻击卷轴65%
Array(2043307, 2, 1, 0), //短剑攻击卷轴15%
Array(2043700, 400, 1, 0), //短杖魔力卷轴100%
Array(2043701, 400, 1, 0), //短杖魔力卷轴60%
Array(2043702, 400, 1, 0), //短杖魔力卷轴10%
Array(2043704, 400, 1, 0), //短杖魔力诅咒卷轴70%
Array(2043705, 400, 1, 0), //短杖魔力诅咒卷轴30%
Array(2043706, 400, 1, 0), //短杖魔力卷轴65%
Array(2043707, 2, 1, 0), //短杖魔力卷轴15%
Array(2043800, 400, 1, 0), //长杖魔力卷轴100%
Array(2043801, 400, 1, 0), //长杖魔力卷轴60%
Array(2043802, 600, 1, 0), //长杖魔力卷轴10%
Array(2043804, 600, 1, 0), //长杖魔力诅咒卷轴70%
Array(2043805, 600, 1, 0), //长杖魔力诅咒卷轴30%
Array(2043806, 600, 1, 0), //长杖魔力卷轴65%
Array(2043807, 2, 1, 0), //长杖魔力卷轴15%
Array(2044000, 500, 1, 1), //双手剑攻击卷轴100%
Array(2044001, 600, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2044004, 400, 1, 1), //双手剑攻击诅咒卷轴70%
Array(2044005, 600, 1, 1), //双手剑攻击诅咒卷轴30%
Array(2044006, 600, 1, 1), //双手剑攻击卷轴65%
Array(2044007, 600, 1, 1), //双手剑攻击卷轴15%
Array(2044010, 600, 1, 0), //双手剑命中率卷轴100%
Array(2044011, 600, 1, 0), //双手剑命中率卷轴70%
Array(2044012, 600, 1, 0), //双手剑命中率卷轴60%
Array(2044013, 600, 1, 0), //双手剑命中率卷轴30%
Array(2044014, 600, 1, 0), //双手剑命中率卷轴10%
Array(2044026, 600, 1, 0), //双手剑命中卷轴65%
Array(2044027, 600, 1, 0), //双手剑命中卷轴15%
Array(2044100, 600, 1, 0), //双手斧攻击卷轴100%
Array(2044101, 600, 1, 0), //双手斧攻击卷轴60%
Array(2044102, 600, 1, 0), //双手斧攻击卷轴10%
Array(2044104, 600, 1, 0), //双手斧攻击诅咒卷轴70%
Array(2044105, 600, 1, 0), //双手斧攻击诅咒卷轴%30
Array(2044106, 600, 1, 0), //双手斧攻击卷轴65%
Array(2044107, 2, 1, 0), //双手斧攻击卷轴15%
Array(2044110, 600, 1, 0), //双手斧命中率卷轴100%
Array(2044111, 600, 1, 0), //双手斧命中率卷轴70%
Array(2044112, 600, 1, 0), //双手斧命中率卷轴60%
Array(2044113, 600, 1, 0), //双手斧命中率卷轴30%
Array(2044114, 600, 1, 0), //双手斧命中率卷轴10%
Array(2044118, 600, 1, 0), //双手斧命中卷轴65%
Array(2044119, 2, 1, 0), //双手斧命中卷轴15%
Array(2044200, 600, 1, 0), //双手钝器攻击卷轴100%
Array(2044201, 600, 1, 0), //双手钝器攻击卷轴60%
Array(2044202, 600, 1, 0), //双手钝器攻击卷轴10%
Array(2044204, 600, 1, 0), //双手钝器攻击诅咒卷轴70%
Array(2044205, 600, 1, 0), //双手钝器攻击诅咒卷轴30%
Array(2044206, 600, 1, 0), //双手钝器攻击卷轴65%
Array(2044207, 2, 1, 0), //双手钝器攻击卷轴15%
Array(2044210, 600, 1, 0), //双手钝器命中率卷轴100%
Array(2044211, 600, 1, 0), //双手钝器命中率卷轴70%
Array(2044212, 600, 1, 0), //双手钝器命中率卷轴60%
Array(2044213, 600, 1, 0), //双手钝器命中率卷轴30%
Array(2044214, 600, 1, 0), //双手钝器命中率卷轴10%
Array(2044218, 600, 1, 0), //单手钝器命中卷轴65%
Array(2044219, 2, 1, 0), //单手钝器命中卷轴15%
Array(2044300, 600, 1, 1), //枪攻击卷轴100%
Array(2044301, 600, 1, 1), //枪攻击卷轴60%
Array(2044302, 600, 1, 1), //枪攻击卷轴10%
Array(2044304, 600, 1, 1), //枪攻击诅咒卷轴70%
Array(2044305, 600, 1, 1), //枪攻击诅咒卷轴30%
Array(2044306, 600, 1, 1), //枪攻击卷轴65%
Array(2044307, 2, 1, 1), //枪攻击卷轴15%
Array(2044310, 600, 1, 0), //枪命中率卷轴100%
Array(2044311, 600, 1, 0), //枪命中率卷轴70%
Array(2044312, 600, 1, 0), //枪命中率卷轴60%
Array(2044313, 600, 1, 0), //枪命中率卷轴30%
Array(2044314, 600, 1, 0), //枪命中率卷轴10%
Array(2044318, 600, 1, 0), //枪命中卷轴65%
Array(2044319, 2, 1, 0), //枪命中卷轴15%
Array(2044400, 600, 1, 1), //矛攻击卷轴100%
Array(2044401, 600, 1, 1), //矛攻击卷轴60%
Array(2044402, 600, 1, 1), //矛攻击卷轴10%
Array(2044404, 600, 1, 1), //矛攻击诅咒卷轴70%
Array(2044405, 600, 1, 1), //矛攻击诅咒卷轴30%
Array(2044406, 600, 1, 1), //矛攻击卷轴65%
Array(2044407, 2, 1, 1), //矛攻击卷轴15%
Array(2044410, 600, 1, 0), //矛命中率卷轴100%
Array(2044411, 600, 1, 0), //矛命中率卷轴70%
Array(2044412, 600, 1, 0), //矛命中率卷轴60%
Array(2044413, 600, 1, 0), //矛命中率卷轴30%
Array(2044414, 600, 1, 0), //矛命中率卷轴10%
Array(2044418, 600, 1, 0), //矛命中卷轴65%
Array(2044419, 2, 1, 0), //矛命中卷轴15%
Array(2044500, 600, 1, 0), //弓攻击卷轴100%
Array(2044501, 600, 1, 0), //弓攻击卷轴60%
Array(2044502, 600, 1, 0), //弓攻击卷轴10%
Array(2044504, 600, 1, 0), //弓攻击诅咒卷轴70%
Array(2044505, 600, 1, 1), //弓攻击诅咒卷轴30%
Array(2044506, 600, 1, 1), //弓攻击卷轴65%
Array(2044507, 2, 1, 1), //弓攻击卷轴15%
Array(2044600, 600, 1, 0), //弩攻击卷轴100%
Array(2044601, 600, 1, 0), //弩攻击卷轴60%
Array(2044602, 600, 1, 0), //弩攻击卷轴10%
Array(2044604, 600, 1, 0), //弩攻击诅咒卷轴70%
Array(2044605, 600, 1, 0), //弩攻击诅咒卷轴30%
Array(2044606, 500, 1, 0), //弩攻击卷轴65%
Array(2044607, 2, 1, 1), //弩攻击卷轴15%
Array(2044700, 400, 1, 0), //拳套攻击卷轴100%
Array(2044701, 2, 1, 0), //拳套攻击卷轴60%
Array(2044702, 600, 1, 0), //拳套攻击卷轴10%
Array(2044704, 600, 1, 0), //拳套攻击诅咒卷轴70%
Array(2044705, 600, 1, 0), //拳套攻击诅咒卷轴30%
Array(2044706, 600, 1, 0), //拳套攻击卷轴65%
Array(2044707, 2, 1, 1), //拳套攻击卷轴15%
Array(2044800, 600, 1, 0), //拳甲攻击卷轴100%
Array(2044801, 600, 1, 0), //拳甲攻击卷轴60%
Array(2044802, 600, 1, 0), //拳甲攻击卷轴10%
Array(2044803, 600, 1, 0), //拳甲攻击卷轴70%
Array(2044804, 600, 1, 0), //拳甲攻击卷轴30%
Array(2044805, 600, 1, 0), //拳甲命中率卷轴100%
Array(2044806, 600, 1, 0), //拳甲命中率卷轴70%
Array(2044807, 600, 1, 0), //拳甲命中率卷轴60%
Array(2044808, 600, 1, 0), //拳甲命中率卷轴30%
Array(2044809, 600, 1, 0), //拳甲命中率卷轴10%
Array(2044811, 600, 1, 0), //拳甲攻击卷轴65%
Array(2044812, 2, 1, 0), //指节攻击卷轴15%
Array(2044813, 600, 1, 0), //指节命中卷轴65%
Array(2044814, 2, 1, 0), //指节命中卷轴15%
Array(2044900, 600, 1, 0), //短枪攻击卷轴100%
Array(2044901, 600, 1, 0), //短枪攻击卷轴60%
Array(2044902, 600, 1, 0), //短枪攻击卷轴10%
Array(2044903, 600, 1, 0), //短枪攻击卷轴70%
Array(2044904, 600, 1, 0), //短枪攻击卷轴30%
Array(2044906, 600, 1, 0), //短枪攻击卷轴65%
Array(2044907, 2, 1, 0), //短枪攻击卷轴15%
Array(2049100, 1, 1, 1) //混沌卷轴60%

);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，99%获得\r\n\#b是否消耗 #g1#r个#b#v4110000#\r\n来一发？#b[#r100%获得，绝无欺骗#b]#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.haveItem(4110000, 1)) {
            cm.sendYesNo("只要你有#v4110000#，就可以从我手中拿走一件宝贝\r\n\#b是否消耗 #g1#r个#b#v4110000#\r\n快乐百宝卷可以通过每天挂机获得哦？#b[#r100%获得#b]"+selStr);
        } else {
            cm.sendOk("只要你有#v4110000#，就可以从我手中拿走一件宝贝\r\n\#b是否消耗 #g1#r个#b#v4110000#\r\n快乐百宝卷可以通过每天挂机获得哦？#b[#r100%获得#b]"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 8);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "快乐百宝券抽奖", notice);
            if (item != -1) {
                cm.gainItem(4110000, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#v4110000##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。\r\n\r\n#b#v4310027# 请通过充值或者雪花兑换获得！！！武林在这里等着你");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4110000, -1);
            cm.safeDispose();
        }
    }
}