var 聊天 = "#fUI/StatusBar/BtChat/normal/0#";
function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			text += "\t\t\t  #e欢迎来到#r《寻梦》冒险岛 #k!#n\r\n"
            text += "#b特别注意：本服为079冒险岛，经验2倍，爆率为国服一倍，全局爆黄金枫叶，黄金枫叶作为本服硬通货币。支持双开，一台电脑同时登陆2个帐号，一个帐号的两个角色则不能同时登陆。有技改，不变态，这个很重要\r\n"//3
			text += "#r0.#v2022468#：黄金枫叶可以换抵用，比例1比1。抵用可以买商城的所有点装和双倍卡，节假日还有GM准备的游戏大礼包可以兑换，黄金枫叶要多刷怪才有，或者充值！#l\r\n"//3
			text += "#r1.#v2002033#：技改，具体技改请看群文件。没有特别突出的职业，各职业全面平衡发展！#l\r\n"//3
            text += "#r2.#v2022035#：毕业装 各职业毕业装备可通过副本积累材料兑换（土豪玩家也可通过充值活动兑换）具体副本信息 攻略 请参照群文件 #l\r\n"//3
            text += "#r3.#v2020031#：开放钓鱼，结婚等系统 #l\r\n"//3
            text += "#r4.#v2022002#：传送系统。去到你想去的任何城市。还有练级地图，方便玩家刷怪练级！#l\r\n"//3
            text += "#r5.#v2002034#：组队BOSS副本。当等级突破140开放终极BOSS挑战！#l\r\n"//3
            text += "#r6.#v2010006#：每日任务。有每日经验任务及每日金币任务。每日必做！！#l\r\n"//3
            text += "#r7.#v2002031#：100点卷=150黄金枫叶 ！#l\r\n"//3
			text += "#r8.#v2022279#：充值比例 100RMB=2W点卷   #l\r\n"//3
			text += "#r9.#v2002023#：新BOSS掉落物，200级神级套材料就靠它!#l\r\n"//3
			text += "#r10.#v2020007#：烈日炎炎，鱼竿一挥，活蹦乱跳的鲜鱼来兑换#l\r\n"//3
			text += "#r11.#v2022057#：一条龙奖励，自由洗血NPC每次使用+100HP#l\r\n\r\n"//3
			text += "#r12.#v2614015#更多精彩#v2614015#群内讨论#v2614015#等你来肝#v2614015##l\r\n\r\n"//3
            cm.sendOk(text);
			//cm.喇叭(3,"欢迎新人[" + cm.getPlayer().getName() + "]！！大家祝贺吧！！！~又是一名新人加入~！");
            //cm.喇叭(3,"欢迎[" + cm.getPlayer().getName() + "]加入红螃蟹冒险岛~！！！大家一起祝贺吧！！！");
		    cm.dispose();
		}
    }
}


