
status = -1;
var itemList = Array(
			Array(2290096,100,1,1),//勇士20
			Array(2290125,100,1,1),//勇士30
Array(4001322, 500, 1, 1),//蓝宝石
Array(4001323, 500, 1, 1),//红宝石
Array(4250602, 500, 1, 1), //兵法
Array(2340000, 500, 1, 1), //祝福卷轴
Array(2049100, 500, 1, 1),//混沌卷轴60%
Array(5520000, 500, 1, 1),//剪刀
Array(5570000, 400, 1, 1),//金锤子%
Array(2070006, 400, 1, 1), //齿轮
Array(2070007, 400, 1, 1), //月牙
Array(2070013, 400, 1, 1), //橘子
Array(2070012, 400, 1, 1), //纸飞机
Array(2060004, 400, 1, 1), //弓
Array(2061004, 400, 1, 1), //弩
Array(2330005, 400, 1, 1), //子弹
			Array(2043002,500, 1, 1), //单手剑攻击卷轴
			Array(2044002,500, 1, 1), //双手剑攻击卷轴
			Array(2044302,500, 1, 1), //枪攻击攻击卷轴
			Array(2044402,500, 1, 1), //矛攻击攻击卷轴
			Array(2044502,500, 1, 1), //弓攻击攻击卷轴
			Array(2044602,500, 1, 1), //弩攻击
			Array(2043702,500, 1, 1), //短杖攻击
			Array(2043802,500, 1, 1), //长杖攻击
			Array(2043302,500, 1, 1), //短剑攻击
			Array(2044702,500, 1, 1), //拳套攻击
			Array(2044902,500, 1, 1), //短枪攻击
			Array(2044802,500, 1, 1), //指节攻击
			Array(2040805,500, 1, 1), //手套攻击
			Array(2044003,500, 1, 1), //双手剑攻击卷轴(必成)
			Array(2044303,500, 1, 1), //枪攻击攻击卷轴(必成)
			Array(2044403,500, 1, 1), //矛攻击攻击卷轴(必成)
			Array(2044503,500, 1, 1), //弓攻击攻击卷轴(必成)
			Array(2044603,500, 1, 1), //弩攻击必成卷
			Array(2043703,500, 1, 1), //短杖攻击必成卷
			Array(2043803,500, 1, 1), //长杖攻击诅轴(必成)
			Array(2043303,500, 1, 1), //短剑攻击必成卷
			Array(2044703,500, 1, 1), //拳套攻击诅轴(必成)
			Array(2044908,500, 1, 1), //短枪攻击卷轴(必成)
			Array(2044815,500, 1, 1), //指节攻击必成卷
			Array(2040807,500, 1, 1), //手套攻击卷轴(必成)
			//Array(2043701,1000, 1, 1), //短杖魔力
			//Array(2043801,1000, 1, 1), //长杖魔力
			Array(2040506,500, 1, 1), //全身铠甲敏捷卷轴(必成)
			//Array(2040303 ,500, 1, 1), //耳环智力必成卷(必成)
			Array(2040710,500, 1, 1), //鞋子跳跃卷轴(必成)
Array(1003797, 500, 1, 1), //高贵战士头盔 -
Array(1003798, 100, 1, 1), //绿色蝶形领结
Array(1003799, 500, 1, 1), //绿色蝶形领结
Array(1003800, 500, 1, 1), //绿色蝶形领结
Array(1003801, 500, 1, 1), //绿色蝶形领结

Array(1102471 , 400, 1, 1), //赫里希安精锐战士披风
Array(1102276 , 100, 1, 1), //绿色蝶形领结
Array(1102473 , 400, 1, 1), //绿色蝶形领结
Array(1102474 , 400, 1, 1), //绿色蝶形领结
Array(1102475 , 400, 1, 1), //绿色蝶形领结

/*Array(1102476  , 400, 1, 1), //诺巴西亚戴斯披风
Array(1102477  , 400, 1, 1), //绿色蝶形领结
Array(1102478  , 400, 1, 1), //绿色蝶形领结
Array(1102479  , 400, 1, 1), //绿色蝶形领结
Array(1102480  , 400, 1, 1), //绿色蝶形领结*/



Array(1072732  , 400, 1, 1), //赫里希安精锐战鞋
Array(1072733  , 100, 1, 1), //绿色蝶形领结
Array(1072734  , 400, 1, 1), //绿色蝶形领结
Array(1072735  , 400, 1, 1), //绿色蝶形领结
Array(1072736  , 400, 1, 1), //绿色蝶形领结

/*Array(1072737   , 400, 1, 1), //诺巴西亚戴斯靴
Array(1072738   , 400, 1, 1), //绿色蝶形领结
Array(1072739   , 400, 1, 1), //绿色蝶形领结
Array(1072740   , 400, 1, 1), //绿色蝶形领结
Array(1072741   , 400, 1, 1), //绿色蝶形领结*/

Array(1132164   , 400, 1, 1), //赫里希安精锐战腰带
Array(1132165   , 100, 1, 1), //绿色蝶形领结
Array(1132166   , 400, 1, 1), //绿色蝶形领结
Array(1132167   , 400, 1, 1), //绿色蝶形领结
Array(1132168   , 400, 1, 1), //绿色蝶形领结

/*Array(1132169    , 400, 1, 1), //诺巴西亚戴斯腰带 
Array(1132170    , 400, 1, 1), //绿色蝶形领结
Array(1132171    , 400, 1, 1), //绿色蝶形领结
Array(1132172    , 400, 1, 1), //绿色蝶形领结
Array(1132173    , 400, 1, 1), //绿色蝶形领结*/


			Array(1052314 ,500, 1, 1),  //1
			//Array(1052315 ,500, 1, 1),  //1
			Array(1052316 ,500, 1, 1),  //1
			Array(1052317 ,500, 1, 1),  //1
			Array(1052318 ,500, 1, 1),  //1

			
			
Array(1032174, 500, 1, 1), //绿色蝶形领结
		Array(1032230    ,500, 1, 1),//进化耳环
		Array(1113005      ,500, 1, 1),//黑蛇
		Array(1113006      ,500, 1, 1),//白蛇
		Array(1112794      ,500, 1, 1),//终极戒指
		Array(1112745     ,500, 1, 1),//幻影守护戒指
		Array(1112804     ,500, 1, 1),//结婚戒指
		
		
Array(1022168, 500, 1, 1), //绿色蝶形领结
		Array(1022224  ,500, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,500, 1, 1),//独眼巨人之眼Lv.1
		Array(1022226  ,100, 1, 1),//独眼巨人之眼Lv.1
		Array(1032208      ,100, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1012371     ,500, 1, 1),//掌上脸饰
Array(1012348, 500, 1, 1), //绿色蝶形领结
Array(1132013, 500, 1, 1), //绿色蝶形领结
//Array(1122000, 500, 1, 1), //黑龙链
			Array(4005004,500, 1, 1),  //1
			Array(4005000,500, 1, 1),  //2
			Array(4005002,500, 1, 1),  //3
			Array(4005001,500, 1, 1),  //4
			Array(4005003,500, 1, 1),  //5
			Array(4250802,400, 1, 1),  //1
			Array(4250902,400, 1, 1),  //2
			Array(4251002,400, 1, 1),  //3
			Array(4251102,400, 1, 1),  //4
			Array(1122029,500, 1, 1), //苏醒的冒险之心         
			Array(1122030,500, 1, 1), //苏醒的冒险之心         
			Array(1122031,500, 1, 1), //苏醒的冒险之心         
			Array(1122032,500, 1, 1), //苏醒的冒险之心         
			Array(1122033,500, 1, 1), //苏醒的冒险之心 
			//Array(2290013,500,1,1),//30连环
			Array(2290023,500,1,1),//恶龙30
			Array(2290011,500,1,1),//轻舞30
			Array(2290031,500,1,1),//30爆破
			Array(2290033,500,1,1),//30闪电
			Array(2290048,500,1,1),//圣光普照20
			Array(2290049,500,1,1),//圣光普照30
			Array(2290053,500,1,1),//火眼30
			Array(2290061,500,1,1),//暴风箭雨30
			Array(2290091,500,1,1),//一出双击30
			Array(2290085,500,1,1),//3连环广击破30
			Array(2290093,500,1,1),//暗杀30
			Array(2290101,500,1,1),//变身20
			Array(2290120,500,1,1),//急速射30 
			Array(1402047,500, 1, 1),//重生玄冥剑
			Array(1432047,500, 1, 1), //永恒显圣枪
			Array(1432049,500, 1, 1), //重生显圣枪
			Array(1442063,500, 1, 1), //永恒神光戟
			Array(1442067,500, 1, 1), //重生神光戟
			Array(1452057,500, 1, 1), //永恒惊电弓
			Array(1452059,500, 1, 1), //重生惊电弓
			Array(1462050,500, 1, 1), //永恒冥雷弩
			Array(1462051,500, 1, 1), //重生冥雷弩
			Array(1472068,500, 1, 1), //永恒大悲赋
			Array(1472071,500, 1, 1), //重生大悲赋
			Array(1482023,500, 1, 1), //永恒孔雀翎
			Array(1482024,500, 1, 1), //重生孔雀翎
			Array(1492023,500, 1, 1), //永恒凤凰铳
			Array(1492025,500, 1, 1), //重生凤凰铳
			Array(1302081,500, 1, 1), //永恒破甲剑
			Array(1302086,500, 1, 1), //重生破甲剑
			Array(1312037,500, 1, 1), //永恒断蚺斧
			Array(1312038,500, 1, 1), //重生断蚺斧
			Array(1322060,500, 1, 1), //永恒惊破天
			Array(1322061,500, 1, 1), //重生惊破天
			Array(1332073,500, 1, 1), //永恒狂鲨锯
			Array(1332074,500, 1, 1), //永恒断首刃
			Array(1332075,500, 1, 1), //重生狂鲨锯
			Array(1332076,500, 1, 1), //重生断首刃
			Array(1372044,500, 1, 1), //永恒蝶翼杖
			Array(1382059,500,1, 1),//重生蝶翼杖
			Array(1302059,500, 1, 1), //黄金枫叶短枪
			Array(1402036,500, 1, 1), //黄金枫叶短枪
			Array(1432038,500, 1, 1), //黄金枫叶短枪
			Array(1442045,500, 1, 1), //黄金枫叶短枪
			Array(1382036,500, 1, 1), //黄金枫叶短枪
			Array(1452044,500, 1, 1), //黄金枫叶短枪
			Array(1472051,500, 1, 1), //黄金枫叶短枪
			Array(1332050,500, 1, 1), //黄金枫叶短枪
			Array(1462039,500, 1, 1), //黄金枫叶短枪
			Array(1482013,500, 1, 1), //黄金枫叶短枪
			Array(1492013,500, 1, 1), //黄金枫叶短枪
			
			Array(1402037,200, 1, 1), //龙背刀
Array(1072769, 500, 1, 1)

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if(cm.haveItem(4170016,5)) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗5个#v4170016#抽取以下物品!\r\n#k当前拥有:#c4170016# 个。 以下是全部物品:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗5个#v4170016#抽取以下物品!\r\n#k当前拥有:#c4170016# 个。 以下是全部物品:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "鸣人彩蛋", notice);
            if (item != -1) {
				//cm.setmoneyb(-5);
cm.gainItem(4170016, -5);//获得物品
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("怎么没接住球啊，算了还你宝石吧。");
           // cm.setmoneyb(-5);
//cm.gainItem(4170016, 5);//获得物品
			//cm.gainNX(1000);	//加减点券
            cm.safeDispose();
        }
    }
}















