
status = -1;
var itemList = Array(
  /*
	Array(1092070,420,1,1),//不速之客
			Array(1092071,430,1,1),//不速之客
			Array(1092072,405,1,1),//不速之客
			Array(1092073,400,1,1),//不速之客
			Array(1092075,430,1,1),//不速之客
			Array(1092076,405,1,1),//不速之客
			Array(1092077,400,1,1),//不速之客
			Array(1092078,400,1,1),//不速之客
			Array(1092080,430,1,1),//不速之客
			Array(1092081,405,1,1),//不速之客
			Array(1092082,490,1,1),//不速之客
			Array(1092083,400,1,1),//不速之客

			Array(1032080,70,1,1),//不速之客
			Array(1032081,85,1,1),//不速之客
			Array(1032082,90,1,1),//不速之客
			Array(1032083,100,1,1),//不速之客

			Array(1132036,110,1,1),//不速之客
			Array(1132037,105,1,1),//不速之客
			Array(1132038,95,1,1),//不速之客
			Array(1132039,90,1,1),//不速之客

			Array(1122081,90,1,1),//不速之客
			Array(1122082,105,1,1),//不速之客
			Array(1122083,110,1,1),//不速之客
			Array(1122084,80,1,1),//不速之客

			Array(1302143,430,1,1),//不速之客
			Array(1302144,405,1,1),//不速之客
			Array(1302145,430,1,1),//不速之客
			Array(1302146,400,1,1),//不速之客
			Array(1312058,430,1,1),//不速之客
			Array(1312059,405,1,1),//不速之客
			Array(1312060,420,1,1),//不速之客
			Array(1312061,400,1,1),//不速之客
			Array(1322086,430,1,1),//不速之客
			Array(1322087,405,1,1),//不速之客
			Array(1322088,420,1,1),//不速之客
			Array(1322089,400,1,1),//不速之客
			Array(1332116,430,1,1),//不速之客
			Array(1332117,405,1,1),//不速之客
			Array(1332118,420,1,1),//不速之客
			Array(1332119,400,1,1),//不速之客
			Array(1332121,430,1,1),//不速之客
			Array(1332122,405,1,1),//不速之客
			Array(1332123,420,1,1),//不速之客
			Array(1332124,400,1,1),//不速之客
			Array(1342029,430,1,1),//不速之客
			Array(1342030,405,1,1),//不速之客
			Array(1342031,420,1,1),//不速之客
			Array(1342032,400,1,1),//不速之客
			Array(1372074,430,1,1),//不速之客
			Array(1372075,405,1,1),//不速之客
			Array(1372076,420,1,1),//不速之客
			Array(1372077,400,1,1),//不速之客
			Array(1382095,430,1,1),//不速之客
			Array(1382096,405,1,1),//不速之客
			Array(1382097,420,1,1),//不速之客
			Array(1382098,400,1,1),//不速之客
			Array(1402086,430,1,1),//不速之客
			Array(1402087,405,1,1),//不速之客
			Array(1402088,420,1,1),//不速之客
			Array(1402089,400,1,1),//不速之客
			Array(1412058,430,1,1),//不速之客
			Array(1412059,405,1,1),//不速之客
			Array(1412060,420,1,1),//不速之客
			Array(1412061,400,1,1),//不速之客
			Array(1422059,430,1,1),//不速之客
			Array(1422060,405,1,1),//不速之客
			Array(1422061,420,1,1),//不速之客
			Array(1422062,400,1,1),//不速之客
			Array(1432077,430,1,1),//不速之客
			Array(1432078,405,1,1),//不速之客
			Array(1432079,420,1,1),//不速之客
			Array(1432080,400,1,1),//不速之客
			Array(1442107,430,1,1),//不速之客
			Array(1442108,405,1,1),//不速之客
			Array(1442109,420,1,1),//不速之客
			Array(1442110,400,1,1),//不速之客
			Array(1452102,430,1,1),//不速之客
			Array(1452103,405,1,1),//不速之客
			Array(1452104,420,1,1),//不速之客
			Array(1452105,400,1,1),//不速之客
			Array(1462087,430,1,1),//不速之客
			Array(1462088,405,1,1),//不速之客
			Array(1462089,420,1,1),//不速之客
			Array(1462090,400,1,1),//不速之客
			Array(1472113,430,1,1),//不速之客
			Array(1472114,405,1,1),//不速之客
			Array(1472115,420,1,1),//不速之客
			Array(1472116,400,1,1),//不速之客
			Array(1482075,430,1,1),//不速之客
			Array(1482076,405,1,1),//不速之客
			Array(1482077,420,1,1),//不速之客
			Array(1482078,400,1,1),//不速之客
			Array(1492075,430,1,1),//不速之客
			Array(1492076,405,1,1),//不速之客
			Array(1492077,420,1,1),//不速之客
			Array(1492078,400,1,1),//不速之客
*/
Array(2022468,300,2,1), //
Array(2022468,300,3,1), //
Array(2022468,300,4,1), //
Array(2022468,250,5,1), //
Array(2022468,250,6,1), //
Array(2022468,250,7,1), //
Array(2022468,200,8,1), //
Array(2022468,200,9,1), //
Array(2022468,150,10,1), //
Array(2022468,100,20,1), //
Array(4000464,300,1,1), //中国心
Array(4251202,300,1,1), //高等
Array(2614015,300,1,1), //破工
Array(2460005,300,1,1), //放大
Array(2002031,300,1,1), //草莓
Array(2002031,300,1,1), //草莓
Array(2022279,300,2,1), //鲜奶
Array(2022279,300,4,1), //鲜奶
Array(2010006,300,2,1), //蜂蜜
Array(2049122,100,1,1), //正向
Array(2049124,100,1,1), //正向
Array(2290096,70,1,1), //20勇士
Array(2290125,50,1,1), //30勇士
Array(1082145,300,1,1),//工地手套（各种颜色全部+进去）
		//	Array(1082146,300,1,1),//工地手套（各种颜色全部+进去）
			//Array(1082147,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082148,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082149,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082150,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1332114,300,1,1),//黄金枫叶短刀
			Array(1002939,200,1,1),//安全帽
			Array(1102163,150,1,1),//贵族披风
			Array(1102206,150,1,1),//黑色野兽披风
			Array(1102207,300,1,1),//金魂披风
			Array(1102040,300,1,1),//浪人披风（黄）
			Array(1102041,300,1,1),//浪人披风（粉）
			Array(1102042,300,1,1),//浪人披风（紫）
			Array(1122015,300,1,1),//枫叶围巾
			Array(1072664 ,120, 1, 1),//外星人之靴
		Array(1072672 ,150, 1, 1),//风暴鞋子
		Array(1072799  ,150, 1, 1),//妖精争执靴
		//脸  
		Array(1012371     ,150, 1, 1),//掌上脸饰
		Array(1012319     ,150, 1, 1),//8周年点点红
		Array(1012158     ,150, 1, 1),//草莓幕斯
		Array(1012132    ,120, 1, 1),//鸟嘴面饰5G5M
		Array(1012284    ,120, 1, 1),//白色专属符号
		Array(1012285    ,120, 1, 1),//黑色专属符号
		Array(1012259   ,120, 1, 1),//高级封锁灰色徽章 - (无描述)3不能升级不可交易
		Array(1012252   ,120, 1, 1),//闪亮红色特殊徽章 - (无描述)5G不能升级		可交易
		Array(1012411   ,120, 1, 1),//白色专属匠人徽章 - (无描述)5G可升级+1  5G可交易
		Array(1012474   ,120, 1, 1),//10周年大赏枫叶脸饰 - (无描述)10G不可交易   可升级3次 
		Array(1012170   ,200, 1, 1),//恐怖鬼娃20G
		Array(1012171   ,100, 1, 1),//恐怖鬼娃20G
		Array(1012172   ,50, 1, 1),//恐怖鬼娃20G
		Array(1012173   ,10, 1, 1),//恐怖鬼娃20G		
		//眼镜
		Array(1022231  ,100, 1, 1),//绚蓝水印脸饰  
		Array(1022182  ,100, 1, 1),//混沌品克缤瞳印   
		Array(1022197  ,180, 1, 1),//进化太阳镜   
		Array(1022117  ,100, 1, 1),//玛瑙龙眼镜3G   不可砸
		Array(1022185  ,100, 1, 1),//瑞贝卡的古典眼镜 - (无描述)3G可交易7次
		Array(1022224  ,100, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,100, 1, 1),//独眼巨人之眼Lv.2
		Array(1022226  ,80, 1, 1),//独眼巨人之眼Lv.3
		
		Array(1132211  ,200, 1, 1),//
		Array(1132212  ,150, 1, 1),//
		Array(1132213  ,100, 1, 1),//
		Array(1132214  ,50, 1, 1),//
		Array(1132215  ,10, 1, 1),//
		
		//套服
		
		Array(1052758      ,150, 1, 1),//11周年衣服
		Array(1052569      ,180, 1, 1),//革命战斗服
		Array(1052460      ,180, 1, 1),//外星人
		Array(1052467      ,180, 1, 1),//高级
		
		Array(1112597      ,80, 1, 1),//希纳斯的钻石戒指
		Array(1113074      ,50, 1, 1),//高级
		//Array(1113075      ,110, 1, 1),//最高级贝勒戒指
		//Array(1112597     ,130, 1, 1),//希纳斯的钻石戒指
		Array(1113040      ,150, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113017      ,150, 1, 1),//妖精争执戒指
		Array(1112951      ,30, 1, 1),//麦格纳斯的愤怒
		Array(1112952      ,30, 1, 1),//希拉的愤怒
		
		Array(1112794      ,250, 1, 1),//终极戒指
		Array(1112745     ,50, 1, 1),//幻影守护戒指
		Array(1112804     ,250, 1, 1),//结婚戒指
		Array(1112738     ,250, 1, 1),//外星人之戒指
                Array(1122197   ,280, 1, 1),//外星人吊坠
                Array(1082432   ,180, 1, 1),//外星人手套

		//耳环
		Array(1032171    ,300, 1, 1),//葡 萄耳环 - (无描述)
		Array(1032241     ,300, 1, 1),//魅惑耳环
		Array(1032108    ,300, 1, 1),//无双耳环 - (无描述)2G		6次
		Array(1032216    ,280, 1, 1),//真红耳环 - (无描述)3G		6次
		Array(1032200    ,280, 1, 1),//巨匠耳环 - (无描述)
		Array(1032232    ,300, 1, 1),//海光耳环 - (无描述)
		//腰带
		
		Array(1132161    ,250, 1, 1),//风暴腰带 - (无描述)	可交易
		Array(1132105    ,250, 1, 1),//维克特班·雷昂腰带 - (无描述)
		Array(1132106    ,250, 1, 1),//赫克斯班·雷昂腰带 - (无描述)
		Array(1132228    ,220, 1, 1),//10周年黑色腰带 - (无描述)
		//可抽可合
		
		Array(1032174     ,250, 1, 1),//瑞贝卡的酸甜耳环 - (无描述)
		Array(1022168     ,250, 1, 1),// 黑羽眼镜 - (无描述)  -攻击1	可升级3  不可交易
		Array(1012348     ,250, 1, 1),//2013圣诞鹿的鼻子 - (无描述)
		Array(1132013     ,250, 1, 1),//1132013 - 不灭的法老腰带 - (无描述)
		
		
		//帽子
			Array(1003843   ,10, 1, 1),//点券帽子牛
		    Array(1002939,250, 1, 1), //安全帽 1003561 
		    Array(1003621,175, 1, 1), //PB  
		    Array(1003722,150, 1, 1), //进阶贝伦头盔  
		    Array(1003765,250, 1, 1), //真．紫烏鴉 - (无描述)  
		    Array(1003766,250, 1, 1), //真．戴碧斯魂 - (无描述) 
		    Array(1003782,210, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,210, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003768,250, 1, 1), //真．龍魔導士翅膀頭巾  
		    Array(1003785,220, 1, 1), //神．龍魔導士翅膀頭巾 - (无描
		    Array(1003767,250, 1, 1), //真．精靈王之頭冠 - (无描述)  
		    Array(1003784,210, 1, 1), //神．精靈王之頭冠 - (无描述)
		    Array(1003787,250, 1, 1), //妖精大眼青蛙帽子 - (无描述)
		    Array(1003863,250, 1, 1), //10周年黑色 - (无描述)
		    Array(1003973 ,250, 1, 1), //蛛丝  - (无描述)

			
			
			
			Array(1122029,200, 1, 1), //苏醒的冒险之心         
			Array(1122030,200, 1, 1), //苏醒的冒险之心         
			Array(1122031,200, 1, 1), //苏醒的冒险之心         
			Array(1122032,200, 1, 1), //苏醒的冒险之心         
			Array(1122033,200, 1, 1), //苏醒的冒险之心         
			Array(1122034,120, 1, 1), //觉醒的冒险之心         
			Array(1122035,120, 1, 1), //觉醒的冒险之心
			Array(1122036,120, 1, 1), //觉醒的冒险之心
			Array(1122037,120, 1, 1), //觉醒的冒险之心
			Array(1122038,120, 1, 1), //觉醒的冒险之心 

		Array(1032206      ,200, 1, 1),//神话耳环复原第1阶段 - (无描述)
		Array(1032207      ,150, 1, 1),//神话耳环复原第2阶段 - (无描述)
		Array(1032208      ,100, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1032209     ,50, 1, 1),//神话耳环复原第4阶段 - (无描述)
		Array(1032219      ,10, 1, 1),//遗忘之神话耳环 - (无描述)
			
			Array(1102481,40,1,1),//	暴君西亚戴斯披风      战士
Array(1082543,140,1,1),//	暴君西亚戴斯手套
Array(1072743,140,1,1),//	暴君西亚戴斯靴
Array(1132174,140,1,1),//	暴君西亚戴斯腰带

Array(1102482,140,1,1),//	暴君赫尔梅斯披风      法师
Array(1082544,140,1,1),//	暴君赫尔梅斯手套
Array(1072744,140,1,1),//	暴君赫尔梅斯靴	 
Array(1132175,140,1,1),//	暴君赫尔梅斯腰带

Array(1102483,140,1,1),//	暴君凯伦披风          弓箭手
Array(1082545,140,1,1),//	暴君凯伦手套
Array(1072745,140,1,1),//	暴君凯伦靴
Array(1132176,140,1,1),//	暴君凯伦腰带

Array(1102484,140,1,1),//	暴君利卡昂披风        飞侠
Array(1082546,140,1,1),//	暴君利卡昂手套
Array(1072746,140,1,1),//	暴君利卡昂靴
Array(1132177,140,1,1),//	暴君利卡昂腰带	 
	 
Array(1102485,140,1,1),//	暴君阿尔泰披风	      海盗
Array(1082547,140,1,1),//	暴君阿尔泰手套
Array(1072747,140,1,1),//	暴君阿尔泰靴	 
Array(1132178,140,1,1),// 
Array(1003797 ,10,1,1), //天使
Array(1042254 ,10,1,1), //天使
Array(1062165 ,10,1,1), //天使

Array(1003798 ,10,1,1), //天使
Array(1042255 ,10,1,1), //天使
Array(1062166 ,10,1,1), //天使

Array(1003799 ,10,1,1), //天使
Array(1042256 ,10,1,1), //天使
Array(1062167 ,10,1,1), //天使

Array(1003800 ,10,1,1), //天使
Array(1042257 ,10,1,1), //天使
Array(1062168 ,10,1,1), //天使

Array(1003801 ,10,1,1), //天使
Array(1042258 ,10,1,1), //天使
Array(1062169 ,10,1,1), //天使

                       
                        Array(1003781,80,1,1), //自由布莱克缤帽
                        Array(1052589,80,1,1), //自由布莱克缤连身衣 
                        Array(4310027,10,1,1), //兑换币  



		    Array(1102871,30, 1, 1), //神．扎披风 - (无描述)
		    Array(1004637,30, 1, 1), //神．扎头盔 - (无描述)
		    Array(1132296,30, 1, 1), //神．扎腰带 - (无描述)
		    Array(1003782,40, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,40, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003785,40, 1, 1), //神．龍魔導士翅膀頭巾 - (无描述)
		    Array(1003784,40, 1, 1), //神．精靈王之頭冠 - (无描述)
			Array(1102476,170,1,1), //
			Array(1102477,170,1,1), //
			Array(1102478,170,1,1), //
			Array(1102479,170,1,1), //
			Array(1102480,170,1,1), //
			Array(1072737,170,1,1), //
			Array(1072738,170,1,1), //
			Array(1072739,170,1,1), //
			Array(1072740,170,1,1), //
			Array(1072741,170,1,1), //
			Array(1132169,170,1,1), //
			Array(1132170,170,1,1), //
			Array(1132171,170,1,1), //
			Array(1132172,170,1,1), //
			Array(1132173,170,1,1), //

			Array(2044403,170,1,1), //	
			Array(2040506,150,1,1),//全身敏捷必称
			Array(2040710,150,1,1),//跳跃必成
                        Array(2040807,150,1,1), //手套攻击必成卷
			Array(2043003,300,1,1),//单手剑
			Array(2044003,300,1,1),//双手剑
			Array(2044203,300,1,1),//双手剑
                        Array(2044303,300,1,1), //枪攻击必成卷
                        Array(2044403,300,1,1), //矛攻击必成卷
                        Array(2044908,300,1,1), //短枪攻击必成卷
			Array(2044503,300,1,1),//弓
			Array(2044603,300,1,1), //弩攻击必成卷
			Array(2044703,300,1,1),//拳
			Array(2043303,300,1,1), //短剑攻击必成卷
			Array(2044815,300,1,1), //指节攻击必成卷
			Array(2043803,300,1,1), //长杖攻击必成卷
				//---戒指
		    Array(1132243,150,1,1), //
			Array(1113072,150,1,1), //
			Array(1032220,150,1,1), //
			Array(1122264,150,1,1), //
			Array(1132244,100,1,1), //
			Array(1113073,100,1,1), //
			Array(1032221,100,1,1), //
			Array(1122265,100,1,1), //
			Array(1132245,70,1,1), //
			Array(1113074,70,1,1), //
			Array(1032222,70,1,1), //
			Array(1122266,70,1,1), //
			Array(1113020,50,1,1), //
			Array(1112763,50,1,1),//最高级贝勒德戒指
			Array(1112767,50,1,1),//最高级贝勒德戒指
			Array(1112775,50,1,1),//最高级贝勒德戒指
			Array(1112771,50,1,1),//最高级贝勒德戒指
			Array(1032223,50,1,1),//最高级贝勒德戒指
			Array(1132246,50,1,1),//最高级贝勒德腰带
			Array(1113075,50,1,1),//最高级贝勒德戒指
			//Array(1112952,30,1,1),//希拉
			//Array(1112951,30,1,1),//希拉
		   
			//-------武器------
/*
            Array(1452304 ,10, 1, 1),  //射日神弓
			Array(1452301 ,10, 1, 1),  //神翼骨弓
            Array(1432303 ,10, 1, 1),  //蓝竹枪
			Array(1402331 ,10, 1, 1),  //黄刀
			Array(1402330 ,10, 1, 1),  //黑刀
			Array(1402327 ,10, 1, 1),  //金光追魂刺
			Array(1402325 ,10, 1, 1),  //魔棍
			Array(1402309 ,10, 1, 1),  //血饮狂刀
			Array(1402303 ,10, 1, 1),  //倚天剑
			Array(1402302 ,10, 1, 1),  //玄冰剑
			Array(1402301 ,10, 1, 1),  //寒冰剑
			Array(1402310 ,10, 1, 1),  //万刺鬼狼牙
			Array(1402311 ,10, 1, 1),  //昊天剑
			Array(1402312 ,10, 1, 1),  //霜之哀伤
			Array(1402313 ,10, 1, 1),  //翼枯刀
			Array(1402314 ,10, 1, 1),  //屠龙刀
			Array(1402315 ,10, 1, 1),  //无心刺
			Array(1402316 ,10, 1, 1),  //鹰勾
			Array(1402317 ,10, 1, 1),  //无极剑
			Array(1402318 ,10, 1, 1),  //天罡破晓
			Array(1402319 ,10, 1, 1),  //青墨刀
			Array(1402320 ,10, 1, 1),  //紫金剑
	*/		
			
			
			Array(1102382,110, 1, 1), //极真
			Array(1102383,110, 1, 1), //极真
			Array(1332225,110,1,1),//法弗纳大马士革剑
			//Array(1342082,110,1,1),//法弗纳急速之刃
			Array(1382208,110,1,1),//法弗纳魔冠之杖
			Array(1402196,110,1,1),//法弗纳忏悔之剑
			Array(1432167,110,1,1),//法弗纳贯雷枪		
			Array(1442223,110,1,1),//法弗纳半月宽刃斧
			Array(1452205,110,1,1),//法弗纳追风者
			Array(1462193,110,1,1),//法弗纳风翼弩
			Array(1472214,110,1,1),//法弗纳危险之手
			Array(1482168,110,1,1),//法弗纳巨狼之爪
			Array(1492179,110,1,1),//法弗纳左轮枪
			Array(1412135,110,1,1),//法弗纳战斗切肉斧
		

			
			
			Array(1402214,80, 1, 1), //红色剑
			Array(1422156,80, 1, 1), //红色锤
			//Array(1342087,80, 1, 1), //红色飞侠
			Array(1432182,80, 1, 1), //红色枪
			Array(1382226,80, 1, 1), //红色长杖  
			Array(1452220,80, 1, 1), //红色弓                           
			Array(1462208,80, 1, 1), //红色之弩
			Array(1332242,80, 1, 1), //红色切割者
			Array(1472230,80, 1, 1), //红色拳套 
			Array(1482183,80, 1, 1),//红色拳甲	
			Array(1492194,80, 1, 1),//红色短枪
			Array(1102382,150,1,1), //极真·比耶莫特披风
            Array(1102383,50,1,1), //极真·夏其尔披风
               // Array(1302138,10,1,1), //柳德之剑
               // Array(1302137,10,1,1), //柳德之剑
               // Array(1302136,2,1,1), //柳德之剑
              //  Array(1302140,10,1,1), //柳德之剑
                Array(1302173,2,1,1), //柳德之剑
              //  Array(1092048,8,1,1), //冰盾
               // Array(1402300,10,1,1), //柳德之剑
              //  Array(1302139,10,1,1), //柳德之剑
                Array(1302156,2,1,1), //柳德之剑
                Array(1302158,2,1,1), //柳德之剑9
               // Array(1402301,2,1,1), //小天锁
               // Array(1402302,2,1,1), //小天锁
              //  Array(1402311,10,1,1), //柳德之剑
              //  Array(1402329,10,1,1), //柳德之剑
               // Array(1402330,10,1,1), //柳德之剑
                Array(1402331,2,1,1), //柳德之剑
                Array(1432154,2,1,1), //柳德之剑
                Array(1432153,2,1,1), //柳德之剑
                //Array(1432037,10,1,1), //枫叶
               // Array(1432060,10,1,1), //柳德之剑
				Array(1382173,2,1,1),//死神之刃
				Array(1452304 ,2, 1, 1),  //射日神弓
				Array(1462219 ,2, 1, 1),//弩
				Array(1472241 ,2, 1, 1),//拳套
				Array(1332254 ,2, 1, 1),//短刀
				Array(1482196 ,2, 1, 1),//指节
				Array(1492205 ,2, 1, 1),//短枪
                Array(1442100,50,1,1), //东东鱼
              //  Array(1442112,50,1,1), //矛
               // Array(1452302,2,1,1), //矛
	               // Array(1432045,150,1,1),//
	                Array(1372008,150,1,1),//
	                Array(1302022,150,1,1),//
	                Array(1322102,150,1,1),//
	                Array(1322027,150,1,1),//
	                Array(1322003,150,1,1),//
	                Array(1102163,150,1,1),//
	                Array(1102248,150,1,1),//
	                Array(1402037,80,1,1),//龙背
                        Array(1382173,50,1,1),//死神之刃	
                        Array(1112444,100,1,1), //6周年黄金枫叶戒指
                        Array(1112915,100,1,1), //蓝调戒指 
                        Array(1112720,100,1,1), //天使冒险岛终结者戒指+心	
						
							Array(3010788,30, 1, 1),//巨无霸年夜饭
	Array(3015051,15, 1, 1),//巨无霸国际巨星
//	Array(3010417,60, 1, 1),//巨无霸企鹅王
	Array(3015378,20, 1, 1),//大家的圣诞节
	Array(3015225,40, 1, 1),//和大象一起自拍椅子
	Array(3015304,10, 1, 1),//哗啦啦大水车
	Array(3010795,60, 1, 1),//森林中休息处

	//这些不要动！！！
Array(1902336,50,1,1),//太阳
Array(1912336,50,1,1),//
Array(1902337,50,1,1),//水星
Array(1912337,50,1,1),//
Array(1902338,50,1,1),//金星
Array(1912338,50,1,1),//
Array(1902339,50,1,1),//地球
Array(1912339,50,1,1),//
Array(1902340,50,1,1),//火星
Array(1912340,50,1,1),//
Array(1902341,50,1,1),//木星
Array(1912341,50,1,1),//
Array(1902342,50,1,1),//土星
Array(1912342,50,1,1),//
Array(1902343,50,1,1),//天王星
Array(1912343,50,1,1),//
Array(1902344,50,1,1),//海王星
Array(1912344,50,1,1),//
Array(1902345,50,1,1),//冥王星
Array(1912345,50,1,1),//
Array(1902346,50,1,1),//冥王星
Array(1912346,50,1,1)//
			
		//	Array(1402251,110,1,1),//AS
			//Array(1412177,110,1,1),//
			//Array(1422184,110,1,1),//
			//Array(1432214,110,1,1),//
			//Array(1442268,110,1,1),//		
			//Array(1452252,110,1,1),//
			//Array(1462239,110,1,1),//
			//Array(1472261,110,1,1),//
			//Array(1482216,110,1,1),//
			//Array(1492231,110,1,1),//
			//Array(1472261,110,1,1),//
			//Array(1382259,110,1,1)//
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if(cm.haveItem(2002033,1)) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗1个#v2002033#抽取以下物品!\r\n#k当前拥有:#c2002033# 个。 以下是全部物品:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗1个#v2002033#抽取以下物品!\r\n#k当前拥有:#c2002033# 个。 以下是全部物品:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "装备抽奖", notice);
            if (item != -1) {
				//cm.setmoneyb(-5);
cm.gainItem(2002033, -1);//获得物品
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("怎么没接住球啊，算了还你物品吧。");

           // cm.setmoneyb(-5);
//cm.gainItem(4000463, 5);//获得物品
			//cm.gainNX(1000);	//加减点券
            cm.safeDispose();
        }
    }
}















