status = -1;
var maxTcmes = 900;
var itemList = Array(
Array(2340000,900,1), //祝福卷轴
Array(2340000,700,1), //祝福卷轴
Array(2340000,500,1), //祝福卷轴
Array(2340000,300,1), //祝福卷轴
Array(2340000,100,1), //祝福卷轴
Array(2049100,900,1), //混沌卷轴
Array(2049100,700,1), //混沌卷轴
Array(2049100,500,1), //混沌卷轴
Array(2049100,300,1), //混沌卷轴
Array(2049100,100,1), //混沌卷轴
Array(2040506,300,1), //全身盔甲敏捷必成卷
Array(2040710,300,1), //鞋子跳跃必成卷
Array(2040806,300,1), //手套敏捷必成卷
Array(2040807,150,1), //手套攻击卷100
Array(2040303,150,1), //耳环智力必成卷
Array(2040903,150,1), //盾牌防御必成卷
Array(2043003,150,1), //单手剑攻击必成卷
Array(2044003,150,1), //双手剑攻击必成卷
Array(2043203,150,1), //单手钝器攻击必成卷
Array(2044203,150,1), //双手钝器攻击必成卷
Array(2044303,150,1), //枪攻击卷必成卷
Array(2044403,150,1), //矛攻击卷必成卷
Array(2043703,150,1), //短杖攻击必成卷
Array(2043803,150,1), //长杖攻击必成卷
Array(2044503,150,1), //弓攻击必成卷
Array(2044603,150,1), //弩攻击必成卷
Array(2044703,150,1), //拳套攻击必成卷
Array(2043303,150,1), //短剑攻击必成卷
Array(2043001,500,1), //单手剑攻击卷60
Array(2043002,500,1), //单手剑攻击卷10
Array(2043004,500,1), //单手剑攻击卷70
Array(2043005,500,1), //单手剑攻击卷30
Array(2043011,500,1), //单手剑攻击卷65
Array(2043012,500,1), //单手剑攻击卷15
Array(2044001,500,1), //双手剑攻击卷60
Array(2044002,500,1), //双手剑攻击卷10
Array(2044004,500,1), //双手剑攻击卷70
Array(2044005,500,1), //双手剑攻击卷30
Array(2044006,500,1), //双手剑攻击卷65
Array(2044007,500,1), //双手剑攻击卷15
Array(2043201,500,1), //单手钝器攻击卷60
Array(2043202,500,1), //单手钝器攻击卷10
Array(2043204,500,1), //单手钝器攻击卷70
Array(2043205,500,1), //单手钝器攻击卷30
Array(2043206,500,1), //单手钝器攻击卷65
Array(2043207,500,1), //单手钝器攻击卷15
Array(2044201,500,1), //双手钝器攻击卷60
Array(2044202,500,1), //双手钝器攻击卷10
Array(2044204,500,1), //双手钝器攻击卷70
Array(2044205,500,1), //双手钝器攻击卷30
Array(2044206,500,1), //双手钝器攻击卷65
Array(2044207,500,1), //双手钝器攻击卷15
Array(2044301,500,1), //枪攻击卷60
Array(2044302,500,1), //枪攻击卷10
Array(2044304,500,1), //枪攻击卷70
Array(2044305,500,1), //枪攻击卷30
Array(2044306,500,1), //枪攻击卷65
Array(2044307,500,1), //枪攻击卷15
Array(2044401,500,1), //矛攻击卷60
Array(2044402,500,1), //矛攻击卷10
Array(2044404,500,1), //矛攻击卷70
Array(2044405,500,1), //矛攻击卷30
Array(2044406,500,1), //矛攻击卷65
Array(2044407,500,1), //矛攻击卷15
Array(2043701,500,1), //短杖魔力卷60
Array(2043702,500,1), //短杖魔力卷10
Array(2043704,500,1), //短杖魔力卷70
Array(2043705,500,1), //短杖魔力卷30
Array(2043706,500,1), //短杖魔力卷65
Array(2043707,500,1), //短杖魔力卷15
Array(2043801,500,1), //长杖魔力卷60
Array(2043802,500,1), //长杖魔力卷10
Array(2043804,500,1), //长杖魔力卷70
Array(2043805,500,1), //长杖魔力卷30
Array(2043806,500,1), //长杖魔力卷65
Array(2043807,500,1), //长杖魔力卷15
Array(2044501,500,1), //弓攻击卷60
Array(2044502,500,1), //弓攻击卷10
Array(2044504,500,1), //弓攻击卷70
Array(2044505,500,1), //弓攻击卷30
Array(2044506,500,1), //弓攻击卷65
Array(2044507,500,1), //弓攻击卷15
Array(2044601,500,1), //弩攻击卷60
Array(2044602,500,1), //弩攻击卷10
Array(2044604,500,1), //弩攻击卷70
Array(2044605,500,1), //弩攻击卷30
Array(2044606,500,1), //弩攻击卷65
Array(2044607,500,1), //弩攻击卷15
Array(2044701,500,1), //拳套攻击卷60
Array(2044702,500,1), //拳套攻击卷10
Array(2044704,500,1), //拳套攻击卷70
Array(2044705,500,1), //拳套攻击卷30
Array(2044706,500,1), //拳套攻击卷65
Array(2044707,500,1), //拳套攻击卷15
Array(2043301,500,1), //短剑攻击卷60
Array(2043302,500,1), //短剑攻击卷10
Array(2043304,500,1), //短剑攻击卷70
Array(2043305,500,1), //短剑攻击卷30
Array(2043306,500,1), //短剑攻击卷65
Array(2043307,500,1), //短剑攻击卷15
Array(2040012,600,1),// 头盔智力卷70
Array(2040013,600,1),// 头盔智力卷30
Array(2040014,600,1),// 头盔命中卷70
Array(2040015,600,1),// 头盔命中卷30
Array(2040016,600,1),// 头盔命中卷10
Array(2040017,600,1),// 头盔命中卷60
Array(2040025,600,1),// 头盔智力卷60
Array(2040026,600,1),// 头盔智力卷10
Array(2040028,600,1),// 头盔敏捷卷70
Array(2040029,600,1),// 头盔敏捷卷60
Array(2040030,600,1),// 头盔敏捷卷30
Array(2040031,600,1),// 头盔敏捷卷10
Array(2040406,600,1),// 上衣力量卷70
Array(2040407,600,1),// 上衣力量卷30
Array(2040410,600,1),// 上衣运气卷70
Array(2040411,600,1),// 上衣运气卷30
Array(2040412,600,1),// 上衣运气卷10
Array(2040413,600,1),// 上衣运气卷60
Array(2040418,600,1),// 上衣力量卷60
Array(2040419,600,1),// 上衣力量卷10
Array(2040424,600,1),// 上衣运气卷70
Array(2040425,600,1),// 上衣运气卷60
Array(2040426,600,1),// 上衣运气卷30
Array(2040427,600,1),// 上衣运气卷10
Array(2040610,600,1),// 裤裙敏捷卷70
Array(2040611,600,1),// 裤裙敏捷卷30
Array(2040612,600,1),// 裤裙敏捷卷10
Array(2040613,600,1),// 裤裙敏捷卷60
Array(2040624,600,1),// 裤裙敏捷卷70
Array(2040625,600,1),// 裤裙敏捷卷60
Array(2040626,600,1),// 裤裙敏捷卷30
Array(2040627,600,1),// 裤裙敏捷卷10
Array(2040501,600,1),// 全身铠甲敏捷卷60
Array(2040502,600,1),// 全身铠甲敏捷卷10
Array(2040508,600,1),// 全身铠甲敏捷卷70
Array(2040509,600,1),// 全身铠甲敏捷卷30
Array(2040513,600,1),// 全身铠甲智力卷60
Array(2040514,600,1),// 全身铠甲智力卷10
Array(2040516,600,1),// 全身铠甲运气卷60
Array(2040517,600,1),// 全身铠甲运气卷10
Array(2040518,600,1),// 全身盔甲智力卷70
Array(2040519,600,1),// 全身盔甲智力卷30
Array(2040520,600,1),// 全身盔甲运气卷70
Array(2040521,600,1),// 全身盔甲运气卷30
Array(2040522,600,1),// 全身盔甲敏捷卷65
Array(2040523,600,1),// 全身盔甲敏捷卷15
Array(2040526,600,1),// 全身盔甲智力卷65
Array(2040527,600,1),// 全身盔甲智力卷15
Array(2040528,600,1),// 全身盔甲运气卷65
Array(2040529,600,1),// 全身盔甲运气卷15
Array(2040531,600,1),// 全身盔甲力量卷70
Array(2040532,600,1),// 全身盔甲力量卷60
Array(2040533,600,1),// 全身盔甲力量卷30
Array(2040534,600,1),// 全身盔甲力量卷10
Array(2040701,600,1),// 鞋子敏捷卷60
Array(2040702,600,1),// 鞋子敏捷卷10
Array(2040704,600,1),// 鞋子跳跃卷60
Array(2040705,600,1),// 鞋子跳跃卷10
Array(2040712,600,1),// 鞋子敏捷卷70
Array(2040713,600,1),// 鞋子敏捷卷30
Array(2040718,600,1),// 鞋子敏捷卷65
Array(2040719,600,1),// 鞋子敏捷卷15
Array(2040720,600,1),// 鞋子跳跃卷65
Array(2040721,600,1),// 鞋子跳跃卷15
Array(2040801,600,1),// 手套敏捷卷60
Array(2040802,600,1),// 手套敏捷卷10
Array(2040804,600,1),// 手套攻击卷60
Array(2040805,600,1),// 手套攻击卷10
Array(2040808,600,1),// 手套敏捷卷70
Array(2040809,600,1),// 手套敏捷卷30
Array(2040810,600,1),// 手套攻击卷70
Array(2040811,600,1),// 手套攻击卷30
Array(2040814,600,1),// 手套魔力卷70
Array(2040815,600,1),// 手套魔力卷30
Array(2040816,600,1),// 手套魔力卷10
Array(2040817,600,1),// 手套魔力卷60
Array(2040819,600,1),// 手套敏捷卷65
Array(2040820,600,1),// 手套敏捷卷15
Array(2040821,600,1),// 手套攻击卷65
Array(2040822,600,1),// 手套攻击卷15
Array(2041013,600,1),// 披风力量卷60
Array(2041014,600,1),// 披风力量卷10
Array(2041016,600,1),// 披风智力卷60
Array(2041017,600,1),// 披风智力卷10
Array(2041019,600,1),// 披风敏捷卷60
Array(2041020,600,1),// 披风敏捷卷10
Array(2041022,600,1),// 披风运气卷60
Array(2041023,600,1),// 披风运气卷10
Array(2041034,600,1),// 披风力量卷70
Array(2041035,600,1),// 披风力量卷30
Array(2041036,600,1),// 披风智力卷70
Array(2041037,600,1),// 披风智力卷30
Array(2041038,600,1),// 披风敏捷卷70
Array(2041039,600,1),// 披风敏捷卷30
Array(2041040,600,1),// 披风运气卷70
Array(2041041,600,1),// 披风运气卷30
Array(2041050,600,1),// 披风力量卷65
Array(2041051,600,1),// 披风力量卷15
Array(2041052,600,1),// 披风智力卷65
Array(2041053,600,1),// 披风智力卷15
Array(2041054,600,1),// 披风敏捷卷65
Array(2041055,600,1),// 披风敏捷卷15
Array(2041056,600,1),// 披风运气卷65
Array(2041057,600,1),// 披风运气卷15
Array(2040301,600,1),// 耳环智力卷60
Array(2040302,600,1),// 耳环智力卷10
Array(2040304,600,1),// 耳环智力卷70
Array(2040305,600,1),// 耳环智力卷30
Array(2040306,600,1),// 耳环敏捷卷70
Array(2040307,600,1),// 耳环敏捷卷30
Array(2040313,600,1),// 耳环智力卷65
Array(2040314,600,1),// 耳环智力卷15
Array(2040317,600,1),// 耳环敏捷卷60
Array(2040318,600,1),// 耳环敏捷卷10
Array(2040320,600,1),// 耳环运气卷70
Array(2040321,600,1),// 耳环运气卷60
Array(2040322,600,1),// 耳环运气卷30
Array(2040323,600,1),// 耳环运气卷10
Array(2040329,600,1),// 耳环敏捷卷10
Array(2040330,600,1),// 耳环智力卷10
Array(2040331,600,1),// 耳环运气卷10
Array(2041101,600,1),// 戒指力量卷60
Array(2041102,600,1),// 戒指力量卷10
Array(2041104,600,1),// 戒指智力卷60
Array(2041105,600,1),// 戒指智力卷10
Array(2041107,600,1),// 戒指敏捷卷60
Array(2041108,600,1),// 戒指敏捷卷10
Array(2041110,600,1),// 戒指运气卷60
Array(2041111,600,1),// 戒指运气卷10
Array(2041112,600,1),// 戒指力量卷70
Array(2041113,600,1),// 戒指力量卷30
Array(2041114,600,1),// 戒指智力卷70
Array(2041115,600,1),// 戒指智力卷30
Array(2041116,600,1),// 戒指敏捷卷70
Array(2041117,600,1),// 戒指敏捷卷30
Array(2041118,600,1),// 戒指运气卷70
Array(2041119,600,1),// 戒指运气卷30
Array(2040105,600,1),// 脸部回避卷10
Array(2040106,600,1),// 脸部回避卷60
Array(2040108,600,1),// 脸部回避卷30
Array(2040109,600,1),// 脸部回避卷70
Array(2040200,600,1),// 眼部命中卷10
Array(2040201,600,1),// 眼部命中卷60
Array(2040203,600,1),// 眼部命中卷30
Array(2040204,600,1),// 眼部命中卷70
Array(2040205,600,1),// 眼部智力卷10
Array(2040206,600,1),// 眼部智力卷60
Array(2040208,600,1),// 眼部智力卷30
Array(2040209,600,1),// 眼部智力卷70
Array(2041201,600,1),// 项链运气卷10
Array(2041202,600,1),// 项链运气卷60
Array(2041204,600,1),// 项链运气卷30
Array(2041205,600,1),// 项链运气卷70
Array(2041206,600,1),// 项链力量卷10
Array(2041207,600,1),// 项链力量卷60
Array(2041209,600,1),// 项链力量卷30
Array(2041210,600,1),// 项链力量卷70
Array(2041301,600,1),// 腰带力量卷60
Array(2041302,600,1),// 腰带力量卷10
Array(2041304,600,1),// 腰带智力卷60
Array(2041305,600,1),// 腰带智力卷10
Array(2041307,600,1),// 腰带敏捷卷60
Array(2041308,600,1),// 腰带敏捷卷10
Array(2041310,600,1),// 腰带运气卷60
Array(2041311,600,1),// 腰带运气卷10
Array(2041312,600,1),// 腰带力量卷70
Array(2041313,600,1),// 腰带力量卷30
Array(2041314,600,1),// 腰带智力卷70
Array(2041315,600,1),// 腰带智力卷30
Array(2041316,600,1),// 腰带敏捷卷70
Array(2041317,600,1),// 腰带敏捷卷30
Array(2041318,600,1),// 腰带运气卷70
Array(2041319,600,1),// 腰带运气卷30
Array(2040906,600,1),// 盾牌运气卷70
Array(2040907,600,1),// 盾牌运气卷30
Array(2040914,600,1),// 盾牌攻击卷60
Array(2040915,600,1),// 盾牌攻击卷10
Array(2040916,600,1),// 盾牌攻击卷70
Array(2040917,600,1),// 盾牌攻击卷30
Array(2040919,600,1),// 盾牌魔力卷60
Array(2040920,600,1),// 盾牌魔力卷10
Array(2040921,600,1),// 盾牌魔力卷70
Array(2040922,600,1),// 盾牌魔力卷30
Array(2040924,600,1),// 盾牌运气卷60
Array(2040925,600,1),// 盾牌运气卷10
Array(2040930,600,1),// 盾牌力量卷70
Array(2040931,600,1),// 盾牌力量卷60
Array(2040932,600,1),// 盾牌力量卷30
Array(2040933,600,3)// 盾牌力量卷10


);
var transId = 2022514;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * maxTcmes);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            if(!cm.haveItem(transId)){
                cm.sendOk("您没有#b#t"+ transId +"##k，我无法为您抽奖");
                cm.dispose();
		return;
            }
            if (cm.getInventory(1).isFull()){
                cm.sendOk("#b请保证装备栏位至少有2个空格。");
                cm.dispose();
				return;
            } else if (cm.getInventory(2).isFull()){
                cm.sendOk("#b请保证消耗栏位至少有2个空格。");
                cm.dispose();
				return;
            } else if (cm.getInventory(3).isFull()){
                cm.sendOk("#b请保证设置栏位至少有2个空格。");
                cm.dispose();
				return;
            } else if (cm.getInventory(4).isFull()){
                cm.sendOk("#b请保证其他栏位至少有2个空格。");
                cm.dispose();
				return;
            } else if (cm.getInventory(5).isFull()){
                cm.sendOk("#b请保证特殊栏位至少有2个空格。");
                cm.dispose();
				return;
            }
            var ran = Math.floor(Math.random() * 100);
			if(ran < 50){
				cm.gainItem(transId,-1);
				cm.sendOk("这枚蛋竟然是空的？#k");
				cm.dispose();
			}else{
				cm.gainItem(itemId,quantity);
				cm.gainItem(transId,-1);
				cm.sendOk("恭喜从蛋中抽取到了#z"+itemId+"##v"+itemId+"# x #r" + quantity + " #k个");
				cm.dispose();
			}
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.dispose();
        }
    }
}
