 
status = -1;
var itemList = Array(
Array(1050100, 400, 1, 1), //兵法男
Array(1051098, 400, 1, 1), //兵法女
Array(4250602, 400, 1, 1), //兵法
Array(4170005, 400, 1, 1), //黄蛋
Array(2070005, 400, 1, 1), //金钱
Array(2070004, 400, 1, 1), //黑刺
Array(2060001, 400, 1, 1), //弓
Array(2061001, 400, 1, 1), //弩
Array(1302030, 400, 1, 1), //枫叶剑
Array(1332025, 400, 1, 1), //枫叶刃
Array(1382012, 400, 1, 1), //枫叶杖
Array(1442024, 400, 1, 1), //枫叶矛
Array(1432012, 400, 1, 1), //枫叶枪
Array(1452022, 400, 1, 1), //枫叶弓
Array(1462019, 400, 1, 1), //枫叶弩
Array(1472032, 400, 1, 1), //枫叶拳
Array(1482020, 400, 1, 1), //枫叶甲
Array(1492020, 400, 1, 1), //枫叶枪
Array(2040801, 400, 1, 1), //手套敏捷卷轴60%
Array(2040802, 600, 1, 1), //手套敏捷卷轴10%
Array(2040804, 400, 1, 1), //手套攻击卷轴60%
Array(2040805, 200, 1, 1), //手套攻击卷轴10%
Array(2040808, 500, 1, 1), //手套敏捷诅咒卷轴70%
Array(2040809, 500, 1, 1), //手套敏捷诅咒卷轴30%
Array(2040810, 100, 1, 1), //手套攻击诅咒卷轴70%
Array(2040811, 100, 1, 1), //手套攻击诅咒卷轴30%
Array(2040814, 500, 1, 1), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 1), //手套魔力诅咒卷轴30%
Array(2040816, 500, 1, 1), //手套魔力卷轴10%
Array(2040817, 500, 1, 1), //手套魔力卷轴60%
Array(2040819, 500, 1, 1), //手套敏捷卷轴65%
Array(2040820, 500, 1, 1), //手套敏捷卷轴15%
Array(2040821, 600, 1, 1), //手套攻击卷轴65%
Array(2040822, 600, 1, 1), //手套攻击卷轴15%
Array(2040906, 500, 1, 1), //盾牌运气卷轴70%
Array(2040907, 500, 1, 1), //盾牌运气卷轴30%
Array(2040914, 600, 1, 1), //盾牌攻击卷轴60%
Array(2040915, 600, 1, 1), //盾牌攻击卷轴10%
Array(2040916, 400, 1, 1), //盾牌攻击诅咒卷轴70%
Array(2040917, 200, 1, 1), //盾牌攻击诅咒卷轴30%
Array(2040919, 200, 1, 1), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 1), //盾牌魔力卷轴10%
Array(2040921, 600, 1, 1), //盾牌魔力诅咒卷轴70%
Array(2040922, 400, 1, 1), //盾牌魔力诅咒卷轴30%
Array(2040924, 600, 1, 1), //盾牌运气卷轴60%
Array(2040925, 400, 1, 1), //盾牌运气卷轴10%
Array(2040930, 600, 1, 1), //盾牌力量卷轴70%
Array(2040931, 200, 1, 1), //盾牌力量卷轴60%
Array(2040932, 100, 1, 1), //盾牌力量卷轴30%
Array(2040933, 600, 1, 1), //盾牌力量卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041204, 600, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 600, 1, 1), //项链运气诅咒卷轴70%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041209, 600, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 600, 1, 1), //项链力量诅咒卷轴70%
Array(2041301, 600, 1, 1), //腰带力量卷轴60%
Array(2041304, 600, 1, 1), //腰带智力卷轴60%
Array(2041307, 600, 1, 1), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 1), //腰带运气卷轴60%
Array(1032004, 500, 1, 0), //金耳环
Array(1032005, 500, 1, 0), //红十字耳环
Array(1032006, 500, 1, 0), //雷电耳环
Array(1032007, 500, 1, 0), //祖母綠耳环
Array(1032008, 500, 1, 0), //猫眼耳环
Array(1032009, 500, 1, 0), //黄方耳环
Array(1032012, 500, 1, 0), //骷髅耳环
Array(1032017, 500, 1, 0), //玫瑰耳环
Array(1032018, 500, 1, 0), //紫荆花耳环
Array(1032019, 500, 1, 0), //水仙耳环
Array(1032022, 500, 1, 0), //赤色圆型耳环
Array(1032023, 500, 1, 0), //草莓耳环
Array(1032025, 500, 1, 0), //叶子耳环
Array(1032026, 500, 1, 0), //黄水晶耳环
Array(1032027, 500, 1, 0), //黑水晶耳环
Array(1032028, 500, 1, 0), //红水晶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环

Array(1002677, 50, 1, 1), //玩具匠人帽
Array(1002699, 50, 1, 1), //南瓜帽子
Array(1002773, 50, 1, 1), //金龙头盔
Array(1102040, 50, 1, 1), //浪人披风(黄)
Array(1102041, 50, 1, 1), //浪人披风(粉)
Array(1102042, 50, 1, 1), //浪人披风(紫)
Array(1102043, 50, 1, 1), //浪人披风(褐)
Array(1102140, 400, 1, 1), //卡帕莱特披风
Array(1102147, 420, 1, 1), //玩具匠人披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102166, 400, 1,1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 400, 1, 1), //枫叶披风
Array(1012158     ,400, 1, 1)


);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if(cm.haveItem(4170011,5)) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗5个#v4170011#抽取以下物品!\r\n#k当前拥有:#c4170011# 个。 以下是全部物品:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗5个#v4170011#抽取以下物品!\r\n#k当前拥有:#c4170011# 个。 以下是全部物品:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "鸣人白蛋", notice);
            if (item != -1) {
				//cm.setmoneyb(-5);
cm.gainItem(4170011, -5);//获得物品
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("怎么没接住球啊，算了还你宝石吧。");
           // cm.setmoneyb(-5);
//cm.gainItem(4170011, 5);//获得物品
			//cm.gainNX(1000);	//加减点券
            cm.safeDispose();
        }
    }
}















