status = -1;
//刚刚找你 你不在 所以我就给你写这套脚本出来了 我给你解说下 
var itemList = Array( //首先我们要接触到的 就是 Array函数系列的运用
	/*Array(1032027,800, 1, 1), //黑水晶耳环
	如上面一排格式大概就是这样   Array(物品ID,概率,数量,播报),//物品名字
	大概格式就是这样然后我给你解说下 概率和播报这两个
	概率这个值是怎么算高或者怎么算低呢？？ 就是全部所有的物品的暴率都加起来然后用这个数除以总暴率就是 这件物品的暴率了
	播报很简单 0就是抽中奖品后不发公告内容 1就是中奖之后要发一条喇叭说 谁谁谁中奖了*/
	
Array(4000464,50,1,1), //中国心
Array(4251202,100,1,1), //高等
Array(2614015,40,1,1), //破工
Array(2460005,40,1,1), //放大
Array(4000487,200,1,1), //暗影
Array(4000487,100,1,1), //暗影
Array(4000463,200,1,1), //国庆
Array(1082145,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082146,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082147,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082148,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082149,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1082150,300,1,1),//工地手套（各种颜色全部+进去）
			Array(1332114,300,1,1),//黄金枫叶短刀
			Array(1002939,200,1,1),//安全帽
			Array(1102163,150,1,1),//贵族披风
			Array(1102206,150,1,1),//黑色野兽披风
			Array(1102207,300,1,1),//金魂披风
			Array(1102040,300,1,1),//浪人披风（黄）
			Array(1102041,300,1,1),//浪人披风（粉）
			Array(1102042,300,1,1),//浪人披风（紫）
			Array(1122015,300,1,1),//枫叶围巾
			Array(1072664 ,120, 1, 1),//外星人之靴
		Array(1072672 ,100, 1, 1),//风暴鞋子
		Array(1072799  ,100, 1, 1),//妖精争执靴
		//脸  
		Array(1012371     ,100, 1, 1),//掌上脸饰
		Array(1012319     ,100, 1, 1),//8周年点点红
		Array(1012158     ,100, 1, 1),//草莓幕斯
		Array(1012132    ,100, 1, 1),//鸟嘴面饰5G5M
		Array(1012284    ,100, 1, 1),//白色专属符号
		Array(1012285    ,100, 1, 1),//黑色专属符号
		Array(1012259   ,100, 1, 1),//高级封锁灰色徽章 - (无描述)3不能升级不可交易
		Array(1012252   ,100, 1, 1),//闪亮红色特殊徽章 - (无描述)5G不能升级		可交易
		Array(1012411   ,100, 1, 1),//白色专属匠人徽章 - (无描述)5G可升级+1  5G可交易
		Array(1012474   ,100, 1, 1),//10周年大赏枫叶脸饰 - (无描述)10G不可交易   可升级3次 
		Array(1012170   ,200, 1, 1),//恐怖鬼娃20G
		Array(1012171   ,100, 1, 1),//恐怖鬼娃20G
		Array(1012172   ,50, 1, 1),//恐怖鬼娃20G
		Array(1012173   ,10, 1, 1),//恐怖鬼娃20G		
		//眼镜
		Array(1022231  ,80, 1, 1),//绚蓝水印脸饰  
		Array(1022182  ,80, 1, 1),//混沌品克缤瞳印   
		Array(1022197  ,180, 1, 1),//进化太阳镜   
		Array(1022117  ,80, 1, 1),//玛瑙龙眼镜3G   不可砸
		Array(1022185  ,80, 1, 1),//瑞贝卡的古典眼镜 - (无描述)3G可交易7次
		Array(1022224  ,100, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,90, 1, 1),//独眼巨人之眼Lv.2
		Array(1022226  ,80, 1, 1),//独眼巨人之眼Lv.3
		
		Array(1132211  ,200, 1, 1),//
		Array(1132212  ,150, 1, 1),//
		Array(1132213  ,100, 1, 1),//
		Array(1132214  ,50, 1, 1),//
		Array(1132215  ,10, 1, 1),//
		
		//套服
		
		Array(1052758      ,150, 1, 1),//11周年衣服
		Array(1052569      ,180, 1, 1),//革命战斗服
		Array(1052460      ,180, 1, 1),//外星人
		Array(1052467      ,180, 1, 1),//高级
		
		Array(1112597      ,110, 1, 1),//希纳斯的钻石戒指
		Array(1113074      ,120, 1, 1),//高级
		Array(1113075      ,110, 1, 1),//最高级贝勒戒指
		Array(1112597     ,130, 1, 1),//希纳斯的钻石戒指
		Array(1113040      ,150, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113017      ,150, 1, 1),//妖精争执戒指
		Array(1112951      ,110, 1, 1),//麦格纳斯的愤怒
		Array(1112952      ,110, 1, 1),//希拉的愤怒
		
		Array(1112794      ,250, 1, 1),//终极戒指
		Array(1112745     ,50, 1, 1),//幻影守护戒指
		Array(1112804     ,250, 1, 1),//结婚戒指
		Array(1112738     ,250, 1, 1),//外星人之戒指
                Array(1122197   ,280, 1, 1),//外星人吊坠
                Array(1082432   ,180, 1, 1),//外星人手套

		//耳环
		Array(1032171    ,300, 1, 1),//葡 萄耳环 - (无描述)
		Array(1032241     ,300, 1, 1),//魅惑耳环
		Array(1032108    ,300, 1, 1),//无双耳环 - (无描述)2G		6次
		Array(1032216    ,280, 1, 1),//真红耳环 - (无描述)3G		6次
		Array(1032200    ,280, 1, 1),//巨匠耳环 - (无描述)
		Array(1032232    ,300, 1, 1),//海光耳环 - (无描述)
		//腰带
		
		Array(1132161    ,250, 1, 1),//风暴腰带 - (无描述)	可交易
		Array(1132105    ,250, 1, 1),//维克特班·雷昂腰带 - (无描述)
		Array(1132106    ,250, 1, 1),//赫克斯班·雷昂腰带 - (无描述)
		Array(1132228    ,220, 1, 1),//10周年黑色腰带 - (无描述)
		//可抽可合
		
		Array(1032174     ,250, 1, 1),//瑞贝卡的酸甜耳环 - (无描述)
		Array(1022168     ,250, 1, 1),// 黑羽眼镜 - (无描述)  -攻击1	可升级3  不可交易
		Array(1012348     ,250, 1, 1),//2013圣诞鹿的鼻子 - (无描述)
		Array(1132013     ,250, 1, 1),//1132013 - 不灭的法老腰带 - (无描述)
		
		
		//帽子
			Array(1003843   ,10, 1, 1),//点券帽子牛
		    Array(1002939,250, 1, 1), //安全帽 1003561 
		    Array(1003621,175, 1, 1), //PB  
		    Array(1003722,150, 1, 1), //进阶贝伦头盔  
		    Array(1003765,250, 1, 1), //真．紫烏鴉 - (无描述)  
		    Array(1003766,250, 1, 1), //真．戴碧斯魂 - (无描述) 
		    Array(1003782,210, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,210, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003768,250, 1, 1), //真．龍魔導士翅膀頭巾  
		    Array(1003785,220, 1, 1), //神．龍魔導士翅膀頭巾 - (无描
		    Array(1003767,250, 1, 1), //真．精靈王之頭冠 - (无描述)  
		    Array(1003784,210, 1, 1), //神．精靈王之頭冠 - (无描述)
		    Array(1003787,250, 1, 1), //妖精大眼青蛙帽子 - (无描述)
		    Array(1003863,250, 1, 1), //10周年黑色 - (无描述)
		    Array(1003973 ,250, 1, 1), //蛛丝  - (无描述)
		    Array(1004040 ,250, 1, 1), //小熊猫耳朵  - (无描述)
		    Array(1004041 ,250, 1, 1), //松鼠耳朵  - (无描述)
		    Array(1004042 ,250, 1, 1), //兔耳朵  - (无描述)
		    Array(1004043 ,250, 1, 1), //狗狗耳朵  - (无描述)
		    Array(1004044 ,250, 1, 1), //熊熊耳朵  - (无描述)
			
			
			
			Array(1122029,200, 1, 1), //苏醒的冒险之心         
			Array(1122030,200, 1, 1), //苏醒的冒险之心         
			Array(1122031,200, 1, 1), //苏醒的冒险之心         
			Array(1122032,200, 1, 1), //苏醒的冒险之心         
			Array(1122033,200, 1, 1), //苏醒的冒险之心         
			Array(1122034,120, 1, 1), //觉醒的冒险之心         
			Array(1122035,120, 1, 1), //觉醒的冒险之心
			Array(1122036,120, 1, 1), //觉醒的冒险之心
			Array(1122037,120, 1, 1), //觉醒的冒险之心
			Array(1122038,120, 1, 1), //觉醒的冒险之心 

		Array(1032206      ,200, 1, 1),//神话耳环复原第1阶段 - (无描述)
		Array(1032207      ,150, 1, 1),//神话耳环复原第2阶段 - (无描述)
		Array(1032208      ,100, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1032209     ,50, 1, 1),//神话耳环复原第4阶段 - (无描述)
		Array(1032219      ,10, 1, 1),//遗忘之神话耳环 - (无描述)
			
			Array(1102481,70,1,1),//	暴君西亚戴斯披风      战士
Array(1082543,70,1,1),//	暴君西亚戴斯手套
Array(1072743,70,1,1),//	暴君西亚戴斯靴
Array(1132174,70,1,1),//	暴君西亚戴斯腰带

Array(1102482,70,1,1),//	暴君赫尔梅斯披风      法师
Array(1082544,70,1,1),//	暴君赫尔梅斯手套
Array(1072744,70,1,1),//	暴君赫尔梅斯靴	 
Array(1132175,70,1,1),//	暴君赫尔梅斯腰带

Array(1102483,70,1,1),//	暴君凯伦披风          弓箭手
Array(1082545,70,1,1),//	暴君凯伦手套
Array(1072745,70,1,1),//	暴君凯伦靴
Array(1132176,70,1,1),//	暴君凯伦腰带

Array(1102484,70,1,1),//	暴君利卡昂披风        飞侠
Array(1082546,70,1,1),//	暴君利卡昂手套
Array(1072746,70,1,1),//	暴君利卡昂靴
Array(1132177,70,1,1),//	暴君利卡昂腰带	 
	 
Array(1102485,70,1,1),//	暴君阿尔泰披风	      海盗
Array(1082547,70,1,1),//	暴君阿尔泰手套
Array(1072747,70,1,1),//	暴君阿尔泰靴	 
Array(1132178,70,1,1),// 
Array(1003797 ,10,1,1), //天使
Array(1042254 ,10,1,1), //天使
Array(1062165 ,10,1,1), //天使

Array(1003798 ,10,1,1), //天使
Array(1042255 ,10,1,1), //天使
Array(1062166 ,10,1,1), //天使

Array(1003799 ,10,1,1), //天使
Array(1042256 ,10,1,1), //天使
Array(1062167 ,10,1,1), //天使

Array(1003800 ,10,1,1), //天使
Array(1042257 ,10,1,1), //天使
Array(1062168 ,10,1,1), //天使

Array(1003801 ,10,1,1), //天使
Array(1042258 ,10,1,1), //天使
Array(1062169 ,10,1,1), //天使

Array(1032206 ,20,1,1), //天使
Array(1032207 ,20,1,1), //天使
Array(1032208 ,20,1,1), //天使
Array(1032209 ,10,1,1), //天使
                        Array(1142490,20,1,1), //兑换币
                        Array(1142491,20,1,1), //自由布莱克缤帽
                        Array(1142492,20,1,1), //自由布莱克缤连身衣  
Array(1142493,20,1,1), //勋章
Array(1142494,20,1,1), //勋章
Array(1142497,10,1,1), //
Array(1142498,5,1,1), //
Array(1142499,1,1,1),  //
		        Array(1022182,30,1,1), //PB
                        Array(1003781,80,1,1), //自由布莱克缤帽
                        Array(1052589,80,1,1), //自由布莱克缤连身衣 
                        Array(4310027,10,1,1), //兑换币  
Array(2041136,50,1,1), //品克缤戒指敏捷攻击卷轴
Array(2041139,50,1,1), //品克缤戒指智力攻击卷轴
Array(2041142,50,1,1), //品克缤戒指运气攻击卷轴
Array(2041145,50,1,1), //品克缤戒指力量攻击卷轴
Array(2041233,50,1,1),  //品克缤项链智力攻击卷轴
Array(2041232,50,1,1),  //品克缤项链敏捷攻击卷轴
Array(2041235,50,1,1),  //品克缤项链力量攻击卷轴
Array(2041234,50,1,1),  //品克缤项链运气攻击卷轴
			Array(1122122,70,1,1), //真觉醒之心
			Array(1122123,70,1,1), //真觉醒之心
			Array(1122124,70,1,1), //真觉醒之心
			Array(1122125,70,1,1), //真觉醒之心
			Array(1122126,70,1,1), //真觉醒之心

			Array(1122143,120,1,1), //真觉醒之心
			Array(1122144,120,1,1), //真觉醒之心
			Array(1122145,120,1,1), //真觉醒之心
			Array(1122146,120,1,1), //真觉醒之心
			Array(1122147,120,1,1), //真觉醒之心
		    Array(1102871,30, 1, 1), //神．扎披风 - (无描述)
		    Array(1004637,30, 1, 1), //神．扎头盔 - (无描述)
		    Array(1132296,30, 1, 1), //神．扎腰带 - (无描述)
		    Array(1003782,40, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,40, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003785,40, 1, 1), //神．龍魔導士翅膀頭巾 - (无描述)
		    Array(1003784,40, 1, 1), //神．精靈王之頭冠 - (无描述)
			Array(1102476,170,1,1), //
			Array(1102477,170,1,1), //
			Array(1102478,170,1,1), //
			Array(1102479,170,1,1), //
			Array(1102480,170,1,1), //
			Array(1072737,170,1,1), //
			Array(1072738,170,1,1), //
			Array(1072739,170,1,1), //
			Array(1072740,170,1,1), //
			Array(1072741,170,1,1), //
			Array(1132169,170,1,1), //
			Array(1132170,170,1,1), //
			Array(1132171,170,1,1), //
			Array(1132172,170,1,1), //
			Array(1132173,170,1,1), //
                        Array(1012170,150,1,1), //80级鬼娃
                        Array(1012172,100,1,1), //120级鬼娃
                        Array(1012174,30,1,1), //180级鬼娃
			Array(2044403,170,1,1), //	
			Array(2040506,150,1,1),//全身敏捷必称
			Array(2040710,150,1,1),//跳跃必成
                        Array(2040807,150,1,1), //手套攻击必成卷
			Array(2043003,170,1,1),//单手剑
			Array(2044003,120,1,1),//双手剑
			Array(2044203,140,1,1),//双手剑
                        Array(2044303,140,1,1), //枪攻击必成卷
                        Array(2044403,170,1,1), //矛攻击必成卷
                        Array(2044908,170,1,1), //短枪攻击必成卷
			Array(2044503,130,1,1),//弓
			Array(2044603,150,1,1), //弩攻击必成卷
			Array(2044703,160,1,1),//拳
			Array(2043303,150,1,1), //短剑攻击必成卷
			Array(2044815,150,1,1), //指节攻击必成卷
			Array(2043803,170,1,1), //长杖攻击必成卷
				//---戒指
		    Array(1113020,300,1,1), //
			Array(1112763,100,1,1),//最高级贝勒德戒指
			Array(1112767,100,1,1),//最高级贝勒德戒指
			Array(1112775,100,1,1),//最高级贝勒德戒指
			Array(1112771,100,1,1),//最高级贝勒德戒指
			Array(1032223,100,1,1),//最高级贝勒德戒指
			Array(1132246,5,1,1),//最高级贝勒德腰带
			Array(1113075,150,1,1),//最高级贝勒德戒指
			Array(1112952,20,1,1),//希拉
			Array(1112951,50,1,1),//希拉
		   
			//-------武器------
/*
            Array(1452304 ,10, 1, 1),  //射日神弓
			Array(1452301 ,10, 1, 1),  //神翼骨弓
            Array(1432303 ,10, 1, 1),  //蓝竹枪
			Array(1402331 ,10, 1, 1),  //黄刀
			Array(1402330 ,10, 1, 1),  //黑刀
			Array(1402327 ,10, 1, 1),  //金光追魂刺
			Array(1402325 ,10, 1, 1),  //魔棍
			Array(1402309 ,10, 1, 1),  //血饮狂刀
			Array(1402303 ,10, 1, 1),  //倚天剑
			Array(1402302 ,10, 1, 1),  //玄冰剑
			Array(1402301 ,10, 1, 1),  //寒冰剑
			Array(1402310 ,10, 1, 1),  //万刺鬼狼牙
			Array(1402311 ,10, 1, 1),  //昊天剑
			Array(1402312 ,10, 1, 1),  //霜之哀伤
			Array(1402313 ,10, 1, 1),  //翼枯刀
			Array(1402314 ,10, 1, 1),  //屠龙刀
			Array(1402315 ,10, 1, 1),  //无心刺
			Array(1402316 ,10, 1, 1),  //鹰勾
			Array(1402317 ,10, 1, 1),  //无极剑
			Array(1402318 ,10, 1, 1),  //天罡破晓
			Array(1402319 ,10, 1, 1),  //青墨刀
			Array(1402320 ,10, 1, 1),  //紫金剑
	*/		
			
			
			Array(1102382,110, 1, 1), //极真
			Array(1102383,110, 1, 1), //极真
			Array(1332225,110,1,1),//法弗纳大马士革剑
			Array(1342082,110,1,1),//法弗纳急速之刃
			Array(1382208,110,1,1),//法弗纳魔冠之杖
			Array(1402196,110,1,1),//法弗纳忏悔之剑
			Array(1432167,110,1,1),//法弗纳贯雷枪		
			Array(1442223,110,1,1),//法弗纳半月宽刃斧
			Array(1452205,110,1,1),//法弗纳追风者
			Array(1462193,110,1,1),//法弗纳风翼弩
			Array(1472214,110,1,1),//法弗纳危险之手
			Array(1482168,110,1,1),//法弗纳巨狼之爪
			Array(1492179,110,1,1),//法弗纳左轮枪
			Array(1412135,110,1,1),//法弗纳战斗切肉斧
		
			Array(1003798,120,1,1),//法弗纳衣服
			Array(1042255,120,1,1),//法弗纳
			Array(1062166,120,1,1),//法弗纳
			Array(1003797,120,1,1),//法弗纳
			Array(1042254,120,1,1),//法弗纳	
			Array(1062165,120,1,1),//法弗纳
			Array(1062167,120,1,1),//法弗纳
			Array(1042256,120,1,1),//法弗纳
			Array(1003799,120,1,1),//法弗纳
			Array(1042258,120,1,1),//法弗纳
			Array(1062169,120,1,1),//法弗纳
			
			
			Array(1402214,80, 1, 1), //红色剑
			Array(1422156,80, 1, 1), //红色锤
			//Array(1342087,50, 1, 1), //红色飞侠
			Array(1432182,80, 1, 1), //红色枪
			Array(1382226,80, 1, 1), //红色长杖  
			Array(1452220,80, 1, 1), //红色弓                           
			Array(1462208,80, 1, 1), //红色之弩
			Array(1332242,80, 1, 1), //红色切割者
			Array(1472230,80, 1, 1), //红色拳套 
			Array(1482183,80, 1, 1),//红色拳甲	
			Array(1492194,80, 1, 1),//红色短枪
			Array(1102382,150,1,1), //极真·比耶莫特披风
                        Array(1102383,50,1,1), //极真·夏其尔披风
                Array(1302138,5,1,1), //柳德之剑
           //     Array(1302137,5,1,1), //柳德之剑
                Array(1302136,5,1,1), //柳德之剑
                Array(1302140,5,1,1), //柳德之剑
                Array(1302173,5,1,1), //柳德之剑
               // Array(1092048,5,1,1), //小天锁
                Array(1402300,5,1,1), //柳德之剑
                Array(1302139,5,1,1), //柳德之剑
                Array(1302156,5,1,1), //柳德之剑
                Array(1302158,5,1,1), //柳德之剑9
                Array(1402301,5,1,1), //小天锁
                Array(1402302,5,1,1), //小天锁
                Array(1402311,5,1,1), //柳德之剑
              //  Array(1402329,5,1,1), //柳德之剑
                Array(1402330,5,1,1), //柳德之剑
                Array(1402331,5,1,1), //柳德之剑
                Array(1432154,5,1,1), //柳德之剑
                Array(1432153,5,1,1), //柳德之剑
				Array(1382173,5,1,1),//死神之刃
				Array(1452304 ,5, 1, 1),  //射日神弓
				Array(1462219 ,5, 1, 1),//弩
				Array(1472241 ,5, 1, 1),//拳套
				Array(1332254 ,5, 1, 1),//短刀
				Array(1482196 ,5, 1, 1),//指节
				Array(1492205 ,5, 1, 1),//短枪
			//Array(1452301 ,10, 1, 1),  //神翼骨弓
               // Array(1432037,5,1,1), //枫叶
               // Array(1432060,5,1,1), //柳德之剑
				
                Array(1442100,50,1,1), //东东鱼
                Array(1442112,50,1,1), //矛
                Array(1452302,5,1,1), //矛
	                Array(1432045,150,1,1),//
	                Array(1372008,150,1,1),//
	                Array(1302022,150,1,1),//
	                Array(1322102,150,1,1),//
	                Array(1322027,150,1,1),//
	                Array(1322003,150,1,1),//
	                Array(1102163,150,1,1),//
	                Array(1102248,150,1,1),//
	                Array(1402037,80,1,1),//龙背
                        	
                        Array(1112444,100,1,1), //6周年黄金枫叶戒指
                        Array(1112915,100,1,1), //蓝调戒指 
                        Array(1112720,100,1,1), //天使冒险岛终结者戒指+心	
			
			Array(1402251,110,1,1),//AS
			Array(1412177,110,1,1),//
			Array(1422184,110,1,1),//
			Array(1432214,110,1,1),//
			Array(1442268,110,1,1),//		
			Array(1452252,110,1,1),//
			Array(1462239,110,1,1),//
			Array(1472261,110,1,1),//
			Array(1482216,110,1,1),//
			Array(1492231,110,1,1),//
			Array(1472261,110,1,1),//
			Array(1382259,110,1,1)//
	/*
			
        这里很重要  这里是Array的结束段落 记住最后一排的 Array函数后面是没有逗号的  这个逗号我截图在你QQ上去 
			*/

);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == 1) {
		status++;
	} else {
		if (status == 0) {
			cm.sendOk("再见。加把油。");
			cm.dispose();
		}
		status--;
	}
	if (status == 0) { //这里就是脚本开始的地方
		var str1 = "\r\n";


		if (cm.haveItem(4000463, 2)) { //判断充值币是否为10个 如果有 就进行下面一段
			cm.sendYesNo("消耗6个#v4000463#抽取以下物品!\r\n#k当前拥有:#c4000463# 个。 以下是全部物品:" + str1);
		} else {
			cm.sendOk("你国庆币不够啊。。");
			cm.dispose();
		}
	} else if (status == 1) {
		var chance = Math.floor(Math.random() * 350 + Math.random() * 5);
		var finalitem = Array();
		for (var i = 0; i < itemList.length; i++) {
			if (itemList[i][1] >= chance) {
				finalitem.push(itemList[i]);
			}
		}
		if (finalitem.length != 0) {
			var item;
			var random = new java.util.Random();
			// 中奖的物品列表
			// var luck_items = Array();
			// 抽奖的次数
			var luckCount = 3;
			// 幸运号码
			var luckNumber = 0;
			// 记录物品信息
			var itemId = 0,
				quantity = 0,
				notice = 0;
			//记录成功 , 失败次数
			var success = 0,
				failed = 0;
			// 中奖的最后信息展示
			var luck_msg = "";
			for (var i = 0; i < luckCount; i++) {
				luckNumber = random.nextInt(finalitem.length);
				var luck_item = finalitem[luckNumber];
				itemId = luck_item[0];
				quantity = luck_item[2];
				notice = luck_item[3];
				item = cm.gainGachaponItem(itemId, quantity, "史莱克抽奖中心", notice);
				if (item != -1) {
					cm.gainItem(4000463, -2);
					// luck_items.push(Array(item, quantity));
					luck_msg += "你获得了 #b#t" + item + "##k " + quantity + "个。\r\n"
					success++;
				} else {
					failed++;
				}
			}
			if(failed > 0){
				luck_msg += "抽奖成功 : " + success +" 次 , 失败 : " + failed + "次。(失败不扣除道具)\r\n";
				luck_msg += "我掐指一算，你背包满了";
			}
			cm.sendOk(luck_msg);
			// var finalchance = random.nextInt(finalitem.length);
			// var itemId = finalitem[finalchance][0];
			// var quantity = finalitem[finalchance][2];
			// var notice = finalitem[finalchance][3];
			// item = cm.gainGachaponItem(itemId, quantity, "希望岛抽奖中心", notice);
			// if (item != -1) {
			// 	cm.gainItem(4000487, -5);

			// 	cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
			// } else {
			// 	cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
			// }
			cm.safeDispose();
		} else {
			cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n");
			// cm.gainNX(-1000);//没有中奖扣除的充值币函数
			//cm.gainItem(4001322, 1);
			cm.safeDispose();
		}
	}
}