status = -1;
//刚刚找你 你不在 所以我就给你写这套脚本出来了 我给你解说下 
var itemList = Array(//首先我们要接触到的 就是 Array函数系列的运用
			Array(1082145,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1082146,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1082147,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1082148,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1082149,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1082150,80,1,1),//工地手套（各种颜色全部+进去）
			Array(1332114,300,1,1),//黄金枫叶短刀
			Array(1492073,300,1,1),//黄金枫叶短枪
			Array(1312056,300,1,1),//黄金枫叶斧子
			Array(1422057,300,1,1),//黄金枫叶巨锤
			Array(1482073,300,1,1),//黄金枫叶指节
			Array(1402085,300,1,1),//黄金枫叶双手剑
			Array(1372071,300,1,1),//黄金枫叶短杖
			Array(1432075,300,1,1),//黄金枫叶抢
			Array(1462085,300,1,1),//黄金枫叶弩
			Array(1452100,300,1,1),//黄金枫叶弓
			Array(1472111,300,1,1),//黄金枫叶拳套
			Array(1382093,300,1,1),//黄金枫叶长杖
			Array(1002939,20,1,1),//安全帽
			Array(1102163,20,1,1),//贵族披风
			Array(1102206,20,1,1),//黑色野兽披风
			Array(1102207,300,1,1),//金魂披风
			Array(1102040,300,1,1),//浪人披风（黄）
			Array(1102041,300,1,1),//浪人披风（粉）
			Array(1102042,300,1,1),//浪人披风（紫）
			Array(1122015,300,1,1),//枫叶围巾
			Array(1072664 ,50, 1, 1),//外星人之靴
		Array(1072672 ,50, 1, 1),//风暴鞋子
		Array(1072799  ,50, 1, 1),//妖精争执靴
		//脸  
		Array(1012371     ,80, 1, 1),//掌上脸饰
		Array(1012319     ,80, 1, 1),//8周年点点红
		Array(1012158     ,80, 1, 1),//草莓幕斯
		Array(1012132    ,80, 1, 1),//鸟嘴面饰5G5M
		Array(1012284    ,80, 1, 1),//白色专属符号
		Array(1012285   ,80, 1, 1),//黑色专属符号
		Array(1012259   ,80, 1, 1),//高级封锁灰色徽章 - (无描述)3不能升级不可交易
		Array(1012252   ,80, 1, 1),//闪亮红色特殊徽章 - (无描述)5G不能升级		可交易
		Array(1012411   ,80, 1, 1),//白色专属匠人徽章 - (无描述)5G可升级+1  5G可交易
		Array(1012474   ,50, 1, 1),//10周年大赏枫叶脸饰 - (无描述)10G不可交易   可升级3次 
		Array(1012171   ,50, 1, 1),//恐怖鬼娃20G
		
		//眼镜
		Array(1022231  ,80, 1, 1),//绚蓝水印脸饰  
		Array(1022182  ,80, 1, 1),//混沌品克缤瞳印   
		Array(1022197  ,80, 1, 1),//进化太阳镜   
		Array(1022117  ,80, 1, 1),//玛瑙龙眼镜3G   不可砸
		Array(1022185  ,80, 1, 1),//瑞贝卡的古典眼镜 - (无描述)3G可交易7次
		Array(1022224  ,80, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,80, 1, 1),//独眼巨人之眼Lv.2
		Array(1022226  ,80, 1, 1),//独眼巨人之眼Lv.3
		
		//套服
		
		Array(1052758      ,80, 1, 1),//11周年衣服
		Array(1052569      ,80, 1, 1),//革命战斗服
		Array(1052460      ,80, 1, 1),//外星人
		Array(1052467      ,80, 1, 1),//高级
		
		Array(1112597      ,10, 1, 1),//希纳斯的钻石戒指
		Array(1113074      ,50, 1, 1),//高级
		Array(1113075      ,50, 1, 1),//最高级贝勒戒指
		Array(1112597     ,80, 1, 1),//希纳斯的钻石戒指
		Array(1113040      ,50, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113017      ,50, 1, 1),//妖精争执戒指
		Array(1112951      ,10, 1, 1),//麦格纳斯的愤怒
		Array(1112952      ,10, 1, 1),//希拉的愤怒
		
		Array(1112794      ,50, 1, 1),//终极戒指
		Array(1112745     ,50, 1, 1),//幻影守护戒指
		Array(1112804     ,50, 1, 1),//结婚戒指
		Array(1112738     ,50, 1, 1),//外星人之戒指
                Array(1122197   ,80, 1, 1),//外星人吊坠
                Array(1082432   ,80, 1, 1),//外星人手套

		//耳环
		Array(1032171    ,400, 1, 1),//葡 萄耳环 - (无描述)
		Array(1032241     ,400, 1, 1),//魅惑耳环
		Array(1032108    ,400, 1, 1),//无双耳环 - (无描述)2G		6次
		Array(1032216    ,80, 1, 1),//真红耳环 - (无描述)3G		6次
		Array(1032200    ,80, 1, 1),//巨匠耳环 - (无描述)
		Array(1032232    ,200, 1, 1),//海光耳环 - (无描述)
		//腰带
		
		Array(1132161    ,50, 1, 1),//风暴腰带 - (无描述)	可交易
		Array(1132105    ,50, 1, 1),//维克特班·雷昂腰带 - (无描述)
		Array(1132106    ,50, 1, 1),//赫克斯班·雷昂腰带 - (无描述)
		Array(1132228    ,20, 1, 1),//10周年黑色腰带 - (无描述)
		//可抽可合
		
		Array(1032174     ,50, 1, 1),//瑞贝卡的酸甜耳环 - (无描述)
		Array(1022168     ,50, 1, 1),// 黑羽眼镜 - (无描述)  -攻击1	可升级3  不可交易
		Array(1012348     ,50, 1, 1),//2013圣诞鹿的鼻子 - (无描述)
		Array(1132013     ,50, 1, 1),//1132013 - 不灭的法老腰带 - (无描述)
		
		
		//帽子
			Array(1003843   ,10, 1, 1),//点券帽子牛
		    Array(1002939,50, 1, 1), //安全帽 1003561 
		    Array(1003621,5, 1, 1), //PB  
		    Array(1003722,50, 1, 1), //进阶贝伦头盔  
		    Array(1003765,50, 1, 1), //真．紫烏鴉 - (无描述)  
		    Array(1003766,50, 1, 1), //真．戴碧斯魂 - (无描述) 
		    Array(1003782,10, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,10, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003768,50, 1, 1), //真．龍魔導士翅膀頭巾  
		    Array(1003785,20, 1, 1), //神．龍魔導士翅膀頭巾 - (无描
		    Array(1003767,50, 1, 1), //真．精靈王之頭冠 - (无描述)  
		    Array(1003784,10, 1, 1), //神．精靈王之頭冠 - (无描述)
		    Array(1003787,50, 1, 1), //妖精大眼青蛙帽子 - (无描述)
		    Array(1003863,50, 1, 1), //10周年黑色 - (无描述)
		    Array(1003973 ,50, 1, 1), //蛛丝  - (无描述)
		    Array(1004040 ,50, 1, 1), //小熊猫耳朵  - (无描述)
		    Array(1004041 ,50, 1, 1), //松鼠耳朵  - (无描述)
		    Array(1004042 ,50, 1, 1), //兔耳朵  - (无描述)
		    Array(1004043 ,50, 1, 1), //狗狗耳朵  - (无描述)
		    Array(1004044 ,50, 1, 1), //熊熊耳朵  - (无描述)
			
			
			
			Array(1122029,50, 1, 1), //苏醒的冒险之心         
			Array(1122030,50, 1, 1), //苏醒的冒险之心         
			Array(1122031,50, 1, 1), //苏醒的冒险之心         
			Array(1122032,50, 1, 1), //苏醒的冒险之心         
			Array(1122033,50, 1, 1), //苏醒的冒险之心         
			Array(1122034,10, 1, 1), //觉醒的冒险之心         
			Array(1122035,10, 1, 1), //觉醒的冒险之心
			Array(1122036,10, 1, 1), //觉醒的冒险之心
			Array(1122037,10, 1, 1), //觉醒的冒险之心
			Array(1122038,10, 1, 1), //觉醒的冒险之心 
			
		Array(1032208      ,80, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1032209     ,80, 1, 1),//神话耳环复原第4阶段 - (无描述)
		Array(1032219      ,70, 1, 1),//遗忘之神话耳环 - (无描述)
			
			
		   
			//-------武器------
/*
            Array(1452304 ,10, 1, 1),  //射日神弓
			Array(1452301 ,10, 1, 1),  //神翼骨弓
            Array(1432303 ,10, 1, 1),  //蓝竹枪
			Array(1402331 ,10, 1, 1),  //黄刀
			Array(1402330 ,10, 1, 1),  //黑刀
			Array(1402327 ,10, 1, 1),  //金光追魂刺
			Array(1402325 ,10, 1, 1),  //魔棍
			Array(1402309 ,10, 1, 1),  //血饮狂刀
			Array(1402303 ,10, 1, 1),  //倚天剑
			Array(1402302 ,10, 1, 1),  //玄冰剑
			Array(1402301 ,10, 1, 1),  //寒冰剑
			Array(1402310 ,10, 1, 1),  //万刺鬼狼牙
			Array(1402311 ,10, 1, 1),  //昊天剑
			Array(1402312 ,10, 1, 1),  //霜之哀伤
			Array(1402313 ,10, 1, 1),  //翼枯刀
			Array(1402314 ,10, 1, 1),  //屠龙刀
			Array(1402315 ,10, 1, 1),  //无心刺
			Array(1402316 ,10, 1, 1),  //鹰勾
			Array(1402317 ,10, 1, 1),  //无极剑
			Array(1402318 ,10, 1, 1),  //天罡破晓
			Array(1402319 ,10, 1, 1),  //青墨刀
			Array(1402320 ,10, 1, 1),  //紫金剑
	*/		
			
			
			Array(1102382,80, 1, 1), //极真
			Array(1102383,80, 1, 1), //极真
			Array(1332225,10,1,1),//法弗纳大马士革剑
			Array(1342082,10,1,1),//法弗纳急速之刃
			Array(1382208,10,1,1),//法弗纳魔冠之杖
			Array(1402196,10,1,1),//法弗纳忏悔之剑
			Array(1432167,10,1,1),//法弗纳贯雷枪		
			Array(1442223,10,1,1),//法弗纳半月宽刃斧
			Array(1452205,10,1,1),//法弗纳追风者
			Array(1462193,10,1,1),//法弗纳风翼弩
			Array(1472214,10,1,1),//法弗纳危险之手
			Array(1482168,10,1,1),//法弗纳巨狼之爪
			Array(1492179,10,1,1),//法弗纳左轮枪
			Array(1412135,10,1,1),//法弗纳战斗切肉斧
		
			Array(1003798,20,1,1),//法弗纳衣服
			Array(1042255,20,1,1),//法弗纳
			Array(1062166,20,1,1),//法弗纳
			Array(1003797,20,1,1),//法弗纳
			Array(1042254,20,1,1),//法弗纳	
			Array(1062165,20,1,1),//法弗纳
			Array(1062167,20,1,1),//法弗纳
			Array(1042256,20,1,1),//法弗纳
			Array(1003799,20,1,1),//法弗纳
			Array(1042258,20,1,1),//法弗纳
			Array(1062169,20,1,1),//法弗纳
			
			Array(1432182,50, 1, 1), //红色枪
			Array(1382226,50, 1, 1), //红色长杖  
			Array(1452220,50, 1, 1), //红色弓                           
			Array(1462208,50, 1, 1), //红色之弩
			Array(1332242,50, 1, 1), //红色切割者
			Array(1472230,50, 1, 1), //红色拳套 
			Array(1482183,50, 1, 1),//红色拳甲	
			
			Array(1402251,10,1,1),//AS
			Array(1412177,10,1,1),//
			Array(1422184,10,1,1),//
			Array(1432214,10,1,1),//
			Array(1442268,10,1,1),//		
			Array(1452252,10,1,1),//
			Array(1462239,10,1,1),//
			Array(1472261,10,1,1),//
			Array(1482216,10,1,1),//
			Array(1492231,10,1,1),//
			Array(1472261,10,1,1),//
			Array(1382259,10,1,1)//
			

			
			
			
			
			
			/*
			
        这里很重要  这里是Array的结束段落 记住最后一排的 Array函数后面是没有逗号的  这个逗号我截图在你QQ上去 
			*/

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见。加把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {//这里就是脚本开始的地方
			if (cm.getPlayer().getNX() >= 2500) {//判断充值币是否为10个 如果有 就进行下面一段
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗#b2500#k点券抽取以下物品!\r\n 以下是全部物品:" + str1);
			} else {//如果没有10个充值币就进行下面一段
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗#b2500#k点券抽取以下物品!\r\n\r\n抽奖所有奖品如下:" + str1);
				cm.dispose();
			}//第一次判断结束的标志
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "木木抽奖中心", notice);
            if (item != -1) {
				cm.gainNX(-2500);
				//cm.setmoneyb(-20);//中奖之后扣除充值币的函数
				if (itemId==1442029){
					cm.gainItem(1442029,-1); //优秀玩家勋章
				    cm.gainItem(1442029,0,0,0,0,0,0,175,0,0,0,0,0,0,0); //优秀玩家勋章
				}
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            //cm.gainNX(-2500);//没有中奖扣除的充值币函数
           // cm.gainItem(5390002, 1);
            cm.safeDispose();
        }
    }
}
