status = -1;
//刚刚找你 你不在 所以我就给你写这套脚本出来了 我给你解说下 
var itemList = Array( //首先我们要接触到的 就是 Array函数系列的运用
	/*Array(1032027,800, 1, 1), //黑水晶耳环
	如上面一排格式大概就是这样   Array(物品ID,概率,数量,播报),//物品名字
	大概格式就是这样然后我给你解说下 概率和播报这两个
	概率这个值是怎么算高或者怎么算低呢？？ 就是全部所有的物品的暴率都加起来然后用这个数除以总暴率就是 这件物品的暴率了
	播报很简单 0就是抽中奖品后不发公告内容 1就是中奖之后要发一条喇叭说 谁谁谁中奖了*/
//Array(2040012,500,1,0),//头盔智力卷轴 诅咒~30%
		//	Array(2040013,500,1,0),//头盔智力卷轴 诅咒70%
		//	Array(2040014,500,1,0),//头盔命中率诅咒卷轴70%
		//	Array(2040015,500,1,0),//头盔命中率诅咒卷轴30%
			Array(2040016,500,1,0),//头盔命中率卷轴10%
		//	Array(2040017,500,1,0),//头盔命中率卷轴60%
		//	Array(2040024,500,1,0),//头盔智力卷轴 100%
		//	Array(2040025,500,1,0),//头盔智力卷轴 60%
			Array(2040026,500,1,0),//头盔智力卷轴 10%
		//	Array(2040027,500,1,0),//头盔敏捷卷轴 100%
		
		//	Array(2040028,500,1,0),//头盔敏捷卷轴 70%
		
		//	Array(2040029,500,1,0),//头盔敏捷卷轴 60%
		//	Array(2040030,500,1,0),//头盔敏捷卷轴 30%
			Array(2040031,500,1,0),//头盔敏捷卷轴 10%
			Array(2040105,500,1,0),//脸部装饰回避率卷轴10%
		//	Array(2040106,500,1,0),//脸部装饰回避率卷轴 60%
		//	Array(2040108,500,1,0),//脸部装饰回避率卷轴 30%
		//	Array(2040109,500,1,0),//脸部装饰回避率卷轴 70%
			Array(2040200,500,1,0),//眼部装饰命中率卷轴10%
	//		Array(2040201,500,1,0),//眼部装饰命中率卷轴 60%
	//		Array(2040203,500,1,0),//眼部装饰命中率卷轴 30%
		//	Array(2040204,500,1,0),//眼部装饰命中率卷轴 70%
			Array(2040205,500,1,0),//眼部装饰智力卷轴10%
		//	Array(2040206,500,1,0),//眼部装饰智力卷轴 60%
		//	Array(2040208,500,1,0),//眼部装饰智力卷轴 30%
		//	Array(2040209,500,1,0),//眼部装饰智力卷轴 70%
		//	Array(2040300,500,1,0),//耳环智力卷轴 100%
		//	Array(2040301,500,1,0),//耳环智力卷轴 60% 
			Array(2040302,500,1,0),//耳环智力卷轴 10% 
		//	Array(2040304,500,1,0),//耳环智力卷轴 70%
		//	Array(2040305,500,1,0),//耳环智力卷轴 30%
		//	Array(2040306,500,1,0),//耳环敏捷卷轴 70%
		//	Array(2040307,500,1,0),//耳环敏捷卷轴 30%
		//	Array(2040316,500,1,0),//耳环敏捷卷轴 100%
		//	Array(2040317,500,1,0),//耳环敏捷卷轴 60%
			Array(2040318,500,1,0),//耳环敏捷卷轴 10%
		//	Array(2040319,500,1,0),//耳环装饰运气卷轴 100%
		//	Array(2040320,500,1,0),//耳环装饰运气卷轴 70%
		//	Array(2040321,500,1,0),//耳环装饰运气卷轴 60%
		//	Array(2040322,500,1,0),//耳环装饰运气卷轴 30%
			Array(2040323,500,1,0),//耳环装饰运气卷轴 10%
		//	Array(2040406,500,1,0),//上衣力量卷轴 70%
		//	Array(2040407,500,1,0),//上衣力量卷轴 30%
			//Array(2040410,500,1,0),//上衣运气诅咒卷轴 70%
		//	Array(2040411,500,1,0),//上衣运气诅咒卷轴 30%
			Array(2040412,500,1,0),//上衣运气 10%
		//	Array(2040413,500,1,0),//上衣运气 60%
		//	Array(2040414,500,1,0),//上衣运气诅咒卷轴 100%
		//	Array(2040500,500,1,0),//全身铠甲敏捷卷轴 100%
		//	Array(2040501,500,1,0),//全身铠甲敏捷卷轴 60%
			Array(2040502,500,1,0),//全身铠甲敏捷卷轴 10%
		//	Array(2040508,500,1,0),//全身铠甲敏捷卷轴 70%
		//	Array(2040509,500,1,0),//全身铠甲敏捷卷轴30%
		//	Array(2040512,500,1,0),//全身铠甲智力卷轴 100%
		//	Array(2040513,500,1,0),//全身铠甲智力卷轴 60%
			Array(2040514,500,1,0),//全身铠甲智力卷轴 10%
		//	Array(2040515,500,1,0),//全身铠甲运气卷轴 100%
		//	Array(2040516,500,1,0),//全身铠甲运气卷轴 60%
			Array(2040517,500,1,0),//全身铠甲运气卷轴 10%
		//	Array(2040518,500,1,0),//全身盔甲智力卷轴 70%
		//	Array(2040519,500,1,0),//全身盔甲智力卷轴 30%
		//	Array(2040520,500,1,0),//全身盔甲幸运卷轴 70%
		//	Array(2040521,500,1,0),//全身盔甲幸运卷轴 30%
		//	Array(2040530,500,1,0),//全身盔甲力量 100%
		//	Array(2040531,500,1,0),//全身盔甲力量 70%
		//	Array(2040532,500,1,0),//全身盔甲力量 60%
		//	Array(2040533,500,1,0),//全身盔甲力量 30%
			Array(2040534,500,1,0),//全身盔甲力量 10%
		//	Array(2040610,500,1,0),//裤裙敏捷卷轴 70%
		//	Array(2040611,500,1,0),//裤裙敏捷卷轴 30%
			Array(2040612,500,1,0),//裤裙敏捷卷轴 10%
		//	Array(2040613,500,1,0),//裤裙敏捷卷轴 60%
	//		Array(2040614,500,1,0),//裤裙敏捷卷轴 100%
	//		Array(2040700,500,1,0),//鞋子敏捷度卷轴100%
		//	Array(2040701,500,1,0),//鞋子敏捷度卷轴60%
			Array(2040702,500,1,0),//鞋子敏捷度卷轴 10%
		//	Array(2040714,500,1,0),//鞋子跳跃诅咒卷轴 70%
		//	Array(2040715,500,1,0),//鞋子跳跃诅咒卷轴 30%
		//	Array(2040800,500,1,0),//手套敏捷卷轴 100%
		//	Array(2040801,500,1,0),//手套敏捷卷轴 60%
			Array(2040802,500,1,0),//手套敏捷卷轴 10%
		//	Array(2040803,500,1,0),//手套攻击卷轴 100%
		//	Array(2040804,500,1,0),//手套攻击卷轴 60%
			Array(2040805,500,1,0),//手套攻击卷轴 10%
		//	Array(2040810,500,1,0),//手套攻击卷轴 70%
		//	Array(2040811,500,1,0),//手套攻击卷轴 30%
		//	Array(2040814,500,1,0),//手套魔力诅咒卷轴70%
		//	Array(2040815,500,1,0),//手套魔力诅咒卷轴30%
			Array(2040816,500,1,0),//手套魔力卷轴10%
		//	Array(2040817,500,1,0),//手套魔力卷轴60%
	//		Array(2040818,500,1,0),//手套魔力卷轴100%
	//		Array(2040906,500,1,0),//盾牌运气卷轴70%
	//		Array(2040907,500,1,0),//盾牌运气卷轴 30%
		//	Array(2040914,500,1,0),//盾牌攻击卷轴60%
			Array(2040915,500,1,0),//盾牌攻击卷轴 10%
	//		Array(2040916,500,1,0),//盾牌攻击卷轴 70%
		//	Array(2040917,500,1,0),//盾牌攻击卷轴 30%
		//	Array(2040919,500,1,0),//盾牌魔力卷轴 60%
			Array(2040920,500,1,0),//盾牌魔力卷轴 10%
		//	Array(2040921,500,1,0),//盾牌魔力卷轴 70%
		//	Array(2040922,500,1,0),//盾牌魔力卷轴30%
			//Array(2040923,500,1,0),//盾牌运气卷轴 100%
			//Array(2040924,500,1,0),//盾牌运气卷轴 60%
			Array(2040925,500,1,0),//盾牌运气卷轴10%
		//	Array(2040929,500,1,0),//盾牌力量卷轴 100%
		//	Array(2040390,500,1,0),//盾牌力量卷轴 70%
			//Array(2040931,500,1,0),//盾牌力量卷轴 60%
			//Array(2040932,500,1,0),//盾牌力量卷轴 30%
			Array(2040933,500,1,0),//盾牌力量卷轴10%
			//Array(2041012,500,1,0),//披风力量卷轴 100%
			//Array(2041013,500,1,0),//披风力量卷轴60%
			Array(2041014,500,1,0),//披风力量卷轴 10%
			//Array(2041015,500,1,0),//披风智力卷轴 100%
			//Array(2041016,500,1,0),//披风智力卷轴 60%
			Array(2041017,500,1,0),//披风智力卷轴 10%
			//Array(2041018,500,1,0),//披风敏捷卷轴 100%
			//Array(2041019 ,500,1,0),//披风敏捷卷轴 60%
			Array(2041020,500,1,0),//披风敏捷卷轴 10%
			//Array(2041021,500,1,0),//披风运气卷轴 100%
			//Array(2041022,500,1,0),//披风运气卷轴 60%
			Array(2041023,500,1,0),//披风运气卷轴 10%
			//Array(2041034,500,1,0),//披风力量诅咒卷轴 70%
			//Array(2041035,500,1,0),//披风力量诅咒卷轴 30%
		//	Array(2041036,500,1,0),//披风智力诅咒卷轴 70%
			//Array(2041037,500,1,0),//披风智力诅咒卷轴 30%
			//Array(2041038,500,1,0),//披风敏捷诅咒卷轴70%
		//	Array(2041039,500,1,0),//披风敏捷诅咒卷轴 30%
			//Array(2041040,500,1,0),//披风运气诅咒卷轴 70%
		//	Array(2041041,500,1,0),//披风运气诅咒卷轴 30%
			Array(2041201,500,1,0),//项链运气卷轴 10%
		//	Array(2041202,500,1,0),//项链运气卷轴 60%
		//	Array(2041203,500,1,0),//项链运气卷轴 100%
			//Array(2041204,500,1,0),//项链运气卷轴 30%
			//Array(2041205,500,1,0),//项链运气卷轴 70%
			Array(2041206,500,1,0),//项链力量卷轴 10%
		//	Array(2041207,500,1,0),//项链力量卷轴60%
			//Array(2041208,500,1,0),//项链力量卷轴 100%
			//Array(2041209,500,1,0),//项链力量卷轴 30%
			//Array(2041210,500,1,0),//项链力量卷轴 70% 
			//Array(2041301,500,1,0),//腰带力量卷轴 60%
			//Array(2041304,500,1,0),//腰带智力卷轴60%
			//Array(2041307,500,1,0),//腰带敏捷卷轴60%
			//Array(2041310,500,1,0),//腰带运气卷轴60%
			//Array(2043001,500,1,0),//单手剑攻击卷轴 60%
			Array(2043002,500,1,0),//单手剑攻击卷轴 10%
			//Array(2042004,500,1,0),//单手剑攻击卷轴 70%
			//Array(2043005,500,1,0),//单手剑攻击卷轴 30%
			//Array(2043101,500,1,0),//单手斧攻击卷轴 60%
			Array(2043102,500,1,0),//单手斧攻击卷轴 10%
		//	Array(2043103,500,1,0),//单手斧攻击卷轴 70%
			//Array(2043104,500,1,0),//单手斧攻击卷轴30%
			//Array(2043201,500,1,0),//单手钝器攻击卷轴 60%
			Array(2043202,500,1,0),//单手钝器攻击卷轴 10%
			//Array(2043204,500,1,0),//单手钝器攻击卷轴 70%
			//Array(2043205,500,1,0),//单手钝器攻击卷轴 30%
			//Array(2043301,500,1,0),//短剑攻击卷轴 60%
			Array(2043302,500,1,0),//短剑攻击卷轴 10%
			//Array(2043304,500,1,0),//短剑攻击卷轴 70%
			//Array(2043305,500,1,0),//短剑攻击卷轴 30%
			//Array(2043701,500,1,0),//短杖魔力卷轴 60%
			Array(2043702,500,1,0),//短杖魔力卷轴 10%
			//Array(2043704,500,1,0),//短杖魔力卷轴 70%
			//Array(2043705,500,1,0),//短杖魔力卷轴 30%
		//	Array(2043801,500,1,0),//长杖魔力卷轴 60%
			Array(2043802,500,1,0),//长杖魔力卷轴 10%
		//	Array(2043804,500,1,0),//长杖魔力卷轴 70%
			//Array(2043805,500,1,0),//长杖魔力卷轴30%
			//Array(2044001,500,1,0),//双手剑攻击卷轴 60%
			Array(2044002,500,1,0),//双手剑攻击卷轴 10%
			//Array(2044004,500,1,0),//双手剑攻击卷轴 70%
			//Array(2044005,500,1,0),//双手剑攻击卷轴 30%
			//Array(2044101,500,1,0),//双手斧攻击卷轴 60%
			Array(2044102,500,1,0),//双手斧攻击卷轴 10%
			//Array(2044104,500,1,0),//双手斧攻击卷轴 70%
		//	Array(2044105,500,1,0),//双手斧攻击卷轴30%
			//Array(2044201,500,1,0),//双手钝器攻击卷轴 60%
			Array(2044202,500,1,0),//双手钝器攻击卷轴10%
			//Array(2044204,500,1,0),//双手钝器攻击卷轴 70%
			//Array(2044205,500,1,0),//双手钝器攻击卷轴 30%
			//Array(2044301,500,1,0),//枪攻击卷轴60%
			Array(2044302,500,1,0),//枪攻击卷轴 10%
			//Array(2044304,500,1,0),//枪攻击卷轴 70%
			//Array(2044305,500,1,0),//枪攻击卷轴 30%
			//Array(2044311,500,1,0),//枪命中率卷轴70%
			//Array(2044312,500,1,0),//枪命中率卷轴60%
			//Array(2044401,500,1,0),//矛攻击卷轴 60%
			Array(2044402,500,1,0),//矛攻击卷轴 10%
			//Array(2044404,500,1,0),//矛攻击卷轴 70%
			//Array(2044405,500,1,0),//矛攻击卷轴 30%
			//Array(2044411,500,1,0),//矛命中率卷轴 70%
			//Array(2044412,500,1,0),//矛命中率卷轴 60%
			//Array(2044413,500,1,0),//矛命中率卷轴30%
			//Array(2044501,500,1,0),//弓攻击卷轴 60%
			Array(2044502,500,1,0),//弓攻击卷轴 10%
			//Array(2044504,500,1,0),//弓攻击卷轴 70%
			//Array(2044505,500,1,0),//弓攻击卷轴 30%
			//Array(2044601,500,1,0),//弩攻击卷轴 60%
			Array(2044602,500,1,0),//弩攻击卷轴 10%
			//Array(2044604,500,1,0),//弩攻击卷轴 70%
			//Array(2044605,500,1,0),//弩攻击卷轴 30%
			//Array(2044701,500,1,0),//拳套攻击卷轴 60%
			Array(2044702,500,1,0),//拳套攻击卷轴10%
			//Array(2044704,500,1,0),//拳套攻击卷轴 70%
			//Array(2044705,500,1,0),//拳套攻击卷轴30%
			//Array(2044801,500,1,0),//拳甲攻击卷轴 60%
			Array(2044802,500,1,0),//拳甲攻击卷轴10%
			//Array(2044804,500,1,0),//拳甲攻击卷轴 70%
			//Array(2044805,500,1,0),//拳甲攻击卷轴 .30%
			//Array(2044807,500,1,0),//拳甲命中率卷轴 60%
			//Array(2044808,500,1,0),//拳甲命中率卷轴 70%
			//Array(2044901,500,1,0),//短枪攻击卷轴 60%
			Array(2044902,500,1,0)//短枪攻击卷轴 10%
			//Array(2044904,500,1,0),//短枪攻击卷轴 70%
			//Array(2044905,500,1,0)//短枪攻击卷轴 30%
	/*
			
        这里很重要  这里是Array的结束段落 记住最后一排的 Array函数后面是没有逗号的  这个逗号我截图在你QQ上去 
			*/

);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == 1) {
		status++;
	} else {
		if (status == 0) {
			cm.sendOk("再见。加把油。");
			cm.dispose();
		}
		status--;
	}
	if (status == 0) { //这里就是脚本开始的地方
		var str1 = "\r\n";


		if (cm.haveItem(4001126, 10)) { //判断充值币是否为10个 如果有 就进行下面一段
			cm.sendYesNo("消耗30个#v4001126#抽取10%卷轴3张!\r\n#k当前拥有:#c4001126# 个。 以下是全部物品:" + str1);
		} else {
			cm.sendOk("你枫叶不够啊。。");
			cm.dispose();
		}
	} else if (status == 1) {
		var chance = Math.floor(Math.random() * 500);
		var finalitem = Array();
		for (var i = 0; i < itemList.length; i++) {
			if (itemList[i][1] >= chance) {
				finalitem.push(itemList[i]);
			}
		}
		if (finalitem.length != 0) {
			var item;
			var random = new java.util.Random();
			// 中奖的物品列表
			// var luck_items = Array();
			// 抽奖的次数
			var luckCount = 3;
			// 幸运号码
			var luckNumber = 0;
			// 记录物品信息
			var itemId = 0,
				quantity = 0,
				notice = 0;
			//记录成功 , 失败次数
			var success = 0,
				failed = 0;
			// 中奖的最后信息展示
			var luck_msg = "";
			for (var i = 0; i < luckCount; i++) {
				luckNumber = random.nextInt(finalitem.length);
				var luck_item = finalitem[luckNumber];
				itemId = luck_item[0];
				quantity = luck_item[2];
				notice = luck_item[3];
				item = cm.gainGachaponItem(itemId, quantity, "卷轴抽奖", notice);
				if (item != -1) {
					cm.gainItem(4001126, -10);
					// luck_items.push(Array(item, quantity));
					luck_msg += "你获得了 #b#t" + item + "##k " + quantity + "个。\r\n"
					success++;
				} else {
					failed++;
				}
			}
			if(failed > 0){
				luck_msg += "抽奖成功 : " + success +" 次 , 失败 : " + failed + "次。(失败不扣除道具)\r\n";
				luck_msg += "我掐指一算，你背包满了";
			}
			cm.sendOk(luck_msg);
			// var finalchance = random.nextInt(finalitem.length);
			// var itemId = finalitem[finalchance][0];
			// var quantity = finalitem[finalchance][2];
			// var notice = finalitem[finalchance][3];
			// item = cm.gainGachaponItem(itemId, quantity, "希望岛抽奖中心", notice);
			// if (item != -1) {
			// 	cm.gainItem(4000487, -5);

			// 	cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
			// } else {
			// 	cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
			// }
			cm.safeDispose();
		} else {
			cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n");
			// cm.gainNX(-1000);//没有中奖扣除的充值币函数
			//cm.gainItem(4001322, 1);
			cm.safeDispose();
		}
	}
}