var status = 0;
var itemList =   
Array(
Array(1003797 ,10,1,1), //天使
Array(1042254 ,10,1,1), //天使
Array(1062165 ,10,1,1), //天使

Array(1003798 ,10,1,1), //天使
Array(1042255 ,10,1,1), //天使
Array(1062166 ,10,1,1), //天使

Array(1003799 ,10,1,1), //天使
Array(1042256 ,10,1,1), //天使
Array(1062167 ,10,1,1), //天使

Array(1003800 ,10,1,1), //天使
Array(1042257 ,10,1,1), //天使
Array(1062168 ,10,1,1), //天使

Array(1003801 ,10,1,1), //天使
Array(1042258 ,10,1,1), //天使
Array(1062169 ,10,1,1), //天使

Array(1032206 ,20,1,1), //天使
Array(1032207 ,20,1,1), //天使
Array(1032208 ,20,1,1), //天使
Array(1032209 ,10,1,1), //天使
                        Array(1142490,20,1,1), //兑换币
                        Array(1142491,20,1,1), //自由布莱克缤帽
                        Array(1142492,20,1,1), //自由布莱克缤连身衣  
Array(1142493,20,1,1), //勋章
Array(1142494,20,1,1), //勋章
Array(1142497,10,1,1), //
Array(1142498,5,1,1), //
Array(1142499,1,1,1),  //
		        Array(1022182,30,1,1), //PB
                        Array(1003781,80,1,1), //自由布莱克缤帽
                        Array(1052589,80,1,1), //自由布莱克缤连身衣 
                        Array(4310027,10,1,1), //兑换币  
Array(2041136,50,1,1), //品克缤戒指敏捷攻击卷轴
Array(2041139,50,1,1), //品克缤戒指智力攻击卷轴
Array(2041142,50,1,1), //品克缤戒指运气攻击卷轴
Array(2041145,50,1,1), //品克缤戒指力量攻击卷轴
Array(2041233,50,1,1),  //品克缤项链智力攻击卷轴
Array(2041232,50,1,1),  //品克缤项链敏捷攻击卷轴
Array(2041235,50,1,1),  //品克缤项链力量攻击卷轴
Array(2041234,50,1,1),  //品克缤项链运气攻击卷轴
			Array(1122122,70,1,1), //真觉醒之心
			Array(1122123,70,1,1), //真觉醒之心
			Array(1122124,70,1,1), //真觉醒之心
			Array(1122125,70,1,1), //真觉醒之心
			Array(1122126,70,1,1), //真觉醒之心

			Array(1122143,120,1,1), //真觉醒之心
			Array(1122144,120,1,1), //真觉醒之心
			Array(1122145,120,1,1), //真觉醒之心
			Array(1122146,120,1,1), //真觉醒之心
			Array(1122147,120,1,1), //真觉醒之心
		    Array(1102871,30, 1, 1), //神．扎披风 - (无描述)
		    Array(1004637,30, 1, 1), //神．扎头盔 - (无描述)
		    Array(1132296,30, 1, 1), //神．扎腰带 - (无描述)
		    Array(1003782,40, 1, 1), //神．紫烏鴉 - (无描述)
		    Array(1003783,40, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003785,40, 1, 1), //神．龍魔導士翅膀頭巾 - (无描述)
		    Array(1003784,40, 1, 1), //神．精靈王之頭冠 - (无描述)
			Array(1102476,170,1,1), //
			Array(1102477,170,1,1), //
			Array(1102478,170,1,1), //
			Array(1102479,170,1,1), //
			Array(1102480,170,1,1), //
			Array(1072737,170,1,1), //
			Array(1072738,170,1,1), //
			Array(1072739,170,1,1), //
			Array(1072740,170,1,1), //
			Array(1072741,170,1,1), //
			Array(1132169,170,1,1), //
			Array(1132170,170,1,1), //
			Array(1132171,170,1,1), //
			Array(1132172,170,1,1), //
			Array(1132173,170,1,1), //
                        Array(1012170,150,1,1), //80级鬼娃
                        Array(1012172,100,1,1), //120级鬼娃
                        Array(1012174,30,1,1), //180级鬼娃
			Array(2044403,170,1,1), //	
			Array(2040506,150,1,1),//全身敏捷必称
			Array(2040710,150,1,1),//跳跃必成
                        Array(2040807,150,1,1), //手套攻击必成卷
			Array(2043003,170,1,1),//单手剑
			Array(2044003,120,1,1),//双手剑
			Array(2044203,140,1,1),//双手剑
                        Array(2044303,140,1,1), //枪攻击必成卷
                        Array(2044403,170,1,1), //矛攻击必成卷
                        Array(2044908,170,1,1), //短枪攻击必成卷
			Array(2044503,130,1,1),//弓
			Array(2044603,150,1,1), //弩攻击必成卷
			Array(2044703,160,1,1),//拳
			Array(2043303,150,1,1), //短剑攻击必成卷
			Array(2044815,150,1,1), //指节攻击必成卷
			Array(2043803,170,1,1), //长杖攻击必成卷
				//---戒指
			Array(1112764,100,1,1),//最高级贝勒德戒指
			Array(1112768,100,1,1),//最高级贝勒德戒指
			Array(1112772,100,1,1),//最高级贝勒德戒指
			Array(1112776,100,1,1),//最高级贝勒德戒指
			Array(1032223,100,1,1),//最高级贝勒德戒指
			Array(1132246,5,1,1),//最高级贝勒德腰带
			Array(1113075,150,1,1),//最高级贝勒德戒指
			Array(1112952,20,1,1),//希拉
			Array(1112951,50,1,1)//希拉
   
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e欢迎来到冒险岛特色抽奖，如有垃圾请联系管理员删除\r\n#r每次抽取需要消耗8个#v4000463#\r\n#g\r\n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.haveItem(4000463, 8)) {
            cm.sendYesNo("欢迎来到冒险岛特色抽奖，如有垃圾请联系管理员删除\r\n#r每次抽取需要消耗8个#v4000463#  以下装备带上后无法交易 赶紧嗨起来吧  "+selStr);
        } else {
            cm.sendOk("欢迎来到冒险岛特色抽奖，如有垃圾请联系管理员删除\r\n#r每次抽取需要消耗8个#v4000463#\r\n\t以下抽奖装备属性都很高 带上后不支持剪刀交易\r\n\t"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "极品抽奖", notice);
            if (item != -1) {
                cm.gainItem(4000463, -8);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("老铁，你满背包了。");
            }
            cm.safeDispose();
        }
    }
}
