importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var jmsz = Array(
             
Array(1050004,5000,"未定义","永久"),//蓝色制服
Array(1050012,5000,"未定义","永久"),//灰骨头服
Array(1050013,5000,"未定义","永久"),//红骨头服
Array(1050014,5000,"未定义","永久"),//绿骨头服
Array(1050015,5000,"未定义","永久"),//蓝骨头服
Array(1050016,5000,"未定义","永久"),//朱红骨头服
Array(1050017,5000,"未定义","永久"),//黄紧身衣
Array(1050019,5000,"未定义","永久"),//圣诞服
Array(1050040,5000,"未定义","永久"),//红色泳裤
Array(1050041,5000,"未定义","永久"),//蓝色泳裤
Array(1050101,5000,"未定义","永久"),//空手道服
Array(1050116,5000,"未定义","永久"),//F1赛车服
Array(1050117,5000,"未定义","永久"),//蓝三角内裤
Array(1050118,5000,"未定义","永久"),//黑三角内裤
Array(1050119,5000,"未定义","永久"),//圣诞男孩子服
Array(1050128,5000,"未定义","永久"),//Go!Korea!
Array(1050135,5000,"未定义","永久"),//王子礼服
Array(1050136,5000,"未定义","永久"),//黑色毛大衣
Array(1050137,5000,"未定义","永久"),//白色毛大衣
Array(1050138,5000,"未定义","永久"),//套套帽校服
Array(1050139,5000,"未定义","永久"),//简易校服
Array(1050148,5000,"未定义","永久"),//贵族生校服
Array(1050150,5000,"未定义","永久"),//绚花节日和服
Array(1050151,5000,"未定义","永久"),//点点蕾丝边连衣裙
Array(1050152,5000,"未定义","永久"),//水兵服
Array(1050154,5000,"未定义","永久"),//死神长袍
Array(1050161,5000,"未定义","永久"),//邦妮男孩套服
Array(1050170,5000,"未定义","永久"),//龙神套服
Array(1050169,5000,"未定义","永久"),//冰雪盔甲
Array(1050177,5000,"未定义","永久"),//MapleBoy套服
Array(1050178,5000,"未定义","永久"),//拿破仑制服
Array(1050179,5000,"未定义","永久"),//圣诞节套服
Array(1050180,5000,"未定义","永久"),//学院优等生套服
Array(1050209,5000,"未定义","永久"),//黄色晚礼服
Array(1050210,5000,"未定义","永久"),//蓝色小背带服
Array(1050215,5000,"未定义","永久"),//Dr.冒险岛男孩
Array(1050220,5000,"未定义","永久"),//军团长外套
Array(1050227,5000,"未定义","永久"),//薄荷雪套服
Array(1050232,5000,"未定义","永久"),//甘菊下午茶
Array(1050234,5000,"未定义","永久"),//魔术师晚礼服
Array(1050248,5000,"未定义","永久"),//神圣夜光法师
Array(1050248,5000,"未定义","永久"),//喵喵派对装
Array(1050256,5000,"未定义","永久"),//阿尔卑斯少年
Array(1050284,5000,"未定义","永久"),//派对公子服
Array(1050285,5000,"未定义","永久"),//波比魔法斗篷
Array(1050291,5000,"未定义","永久"),//可爱棒球服
Array(1050293,5000,"未定义","永久"),//海滩帅锅装
Array(1050296,5000,"未定义","永久"),//超级明星套服
Array(1050299,5000,"未定义","永久"),//小娃娃普卡
Array(1050302,5000,"未定义","永久"),//执事之品格
Array(1050303,5000,"未定义","永久"),//蝴蝶结男生套装
Array(1050304,5000,"未定义","永久"),//巧克力男孩
Array(1050308,5000,"未定义","永久"),//狂野十字猎服
Array(1050310,5000,"未定义","永久"),//天生购物狂
Array(1050311,5000,"未定义","永久"),//月光隐月
Array(1050316,5000,"未定义","永久"),//宽松背带裤
Array(1050318,5000,"未定义","永久"),//纯白礼服
Array(1050319,5000,"未定义","永久"),//秋游套装
Array(1050322,5000,"未定义","永久"),//派对王子礼服
Array(1050335,5000,"未定义","永久"),//旋律少年
Array(1050336,5000,"未定义","永久"),//足球服
Array(1050337,5000,"未定义","永久"),//夏威夷情侣
Array(1050340,5000,"未定义","永久"),//莎啦啦冰雪服
Array(1050341,5000,"未定义","永久"),//森林露营服
Array(1050342,5000,"未定义","永久"),//蓝色巴尼兔
Array(1050343,5000,"未定义","永久"),//绅士迪伦
Array(1050359,5000,"未定义","永久"),//仙侣衣
Array(1050356,5000,"未定义","永久"),//暗夜高校服
Array(1050361,5000,"未定义","永久"),//爱情传递
Array(1050364,5000,"未定义","永久"),//小花仙
Array(1050365,5000,"未定义","永久"),//星光男孩
Array(1050370,5000,"未定义","永久"),//薄荷喵茶会
Array(1050371,5000,"未定义","永久"),//人鱼传说
Array(1050372,5000,"未定义","永久"),//精灵鼠小弟
Array(1050375,5000,"未定义","永久"),//洋娃娃普卡
Array(1050377,5000,"未定义","永久"),//可爱棒球服
Array(1050382,5000,"未定义","永久"),//百万富翁外套
Array(1050384,5000,"未定义","永久"),//小兰兰全身服
Array(1050385,5000,"未定义","永久"),//时间的旋律
Array(1050387,5000,"未定义","永久"),//海军风校服
Array(1050388,5000,"未定义","永久"),//乌鲁斯绅士
Array(1050389,5000,"未定义","永久"),//农夫甜心派
Array(1050400,5000,"未定义","永久"),//玩具城士兵服
Array(1050418,5000,"未定义","永久"),//暖冬毛绒装
Array(1050419,5000,"未定义","永久"),//冬日暖男服
Array(1051049,5000,"未定义","永久"),//圣诞服
Array(1051048,5000,"未定义","永久"),//魔女裙
Array(1051118,5000,"未定义","永久"),//粉红可爱泳装
Array(1050119,5000,"未定义","永久"),//蓝色可爱泳装
Array(1051131,5000,"未定义","永久"),//圣诞女孩子服
Array(1051147,5000,"未定义","永久"),//帅娃娃
Array(1051154,5000,"未定义","永久"),//女神晚礼服
Array(1051155,5000,"未定义","永久"),//公主礼服
Array(1051160,5000,"未定义","永久"),//裹裹短裙
Array(1051162,5000,"未定义","永久"),//水手校服
Array(1051163,5000,"未定义","永久"),//鬼娃娃晚装
Array(1051183,5000,"未定义","永久"),//周末约会装
Array(1051185,5000,"未定义","永久"),//女仆套装
Array(1051188,5000,"未定义","永久"),//蓝色碎花裙
Array(1051189,5000,"未定义","永久"),//怦然心动装
Array(1051190,5000,"未定义","永久"),//死神长袍
Array(1051192,5000,"未定义","永久"),//海洋裹裹短裙
Array(1051200,5000,"未定义","永久"),//邦妮女孩套服
Array(1051208,5000,"未定义","永久"),//草莓少女套服
Array(1051209,5000,"未定义","永久"),//龙神套服
Array(1051211,5000,"未定义","永久"),//伊丽莎白礼服
Array(1051218,5000,"未定义","永久"),//MapleGirl套服
Array(1051219,5000,"未定义","永久"),//彩虹mini连衣裙
Array(1051221,5000,"未定义","永久"),//圣诞节套服
Array(1051231,5000,"未定义","永久"),//阿尔卑斯山少女装
Array(1051233,5000,"未定义","永久"),//车模装
Array(1051235,5000,"未定义","永久"),//橙色小鸡裙子
Array(1051252,5000,"未定义","永久"),//粉红色天使制服
Array(1051253,5000,"未定义","永久"),//红帽迷你裙
Array(1051254,5000,"未定义","永久"),//萝莉学生装
Array(1051255,5000,"未定义","永久"),//黄色晚礼服-女款
Array(1051256,5000,"未定义","永久"),//蓝色小背带裙
Array(1051261,5000,"未定义","永久"),//童话幻想
Array(1051262,5000,"未定义","永久"),//Dr.冒险岛女孩
Array(1051278,5000,"未定义","永久"),//樱桃雪套服
Array(1051284,5000,"未定义","永久"),//魔术师晚礼裙
Array(1051285,5000,"未定义","永久"),//魅力公主
Array(1051292,5000,"未定义","永久"),//开场女星
Array(1051294,5000,"未定义","永久"),//抒情裙装
Array(1051295,5000,"未定义","永久"),//魔法裙装
Array(1051301,5000,"未定义","永久"),//神圣夜光法师
Array(1051303,5000,"未定义","永久"),//抹胸礼服
Array(1051304,5000,"未定义","永久"),//喵喵派对裙
Array(1051345,5000,"未定义","永久"),//可爱猫咪服装
Array(1051349,5000,"未定义","永久"),//女妖
Array(1051350,5000,"未定义","永久"),//派对名媛裙
Array(1051351,5000,"未定义","永久"),//GM璐力的制服
Array(1051352,5000,"未定义","永久"),//波比魔法斗篷
Array(1051357,5000,"未定义","永久"),//可爱棒球服
Array(1051359,5000,"未定义","永久"),//海滩美眉装
Array(1051362,5000,"未定义","永久"),//超级明星连衣裙
Array(1051366,5000,"未定义","永久"),//小娃娃皮卡
Array(1051367,5000,"未定义","永久"),//蓝色雪糕MM装
Array(1051368,5000,"未定义","永久"),//粉格纹假日装
Array(1051369,5000,"未定义","永久"),//女仆之骄傲
Array(1051370,5000,"未定义","永久"),//浪漫旗袍
Array(1051372,5000,"未定义","永久"),//巧克力女孩
Array(1051373,5000,"未定义","永久"),//血红詹娜
Array(1051374,5000,"未定义","永久"),//欧黛特芭蕾裙
Array(1051375,5000,"未定义","永久"),//欧迪尔芭蕾裙
Array(1051376,5000,"未定义","永久"),//万圣节机器人裙
Array(1051387,5000,"未定义","永久"),//春游连衣裙
Array(1051389,5000,"未定义","永久"),//纯白婚纱
Array(1051390,5000,"未定义","永久"),//秋游套装
Array(1051391,5000,"未定义","永久"),//艾尔莎连衣裙
Array(1051392,5000,"未定义","永久"),//派对公主裙
Array(1051406,5000,"未定义","永久"),//夏威夷情侣
Array(1051407,5000,"未定义","永久"),//冒险岛学校学生泳衣
Array(1051408,5000,"未定义","永久"),//蝴蝶之恋套服
Array(1051409,5000,"未定义","永久"),//莎啦啦冰雪女孩套服
Array(1051411,5000,"未定义","永久"),//Lady罗莎莉亚
Array(1051414,5000,"未定义","永久"),//粉色巴尼兔背带裙
Array(1051415,5000,"未定义","永久"),//拉拉队服
Array(1051422,5000,"未定义","永久"),//草莓蛋糕裙
Array(1051429,5000,"未定义","永久"),//仙侣衣(女)
Array(1051430,5000,"未定义","永久"),//闪耀之星纪念套服
Array(1051431,5000,"未定义","永久"),//爱情传递
Array(1051434,5000,"未定义","永久"),//小花仙
Array(1051436,5000,"未定义","永久"),//女皇的礼服
Array(1051437,5000,"未定义","永久"),//粉红罗曼史
Array(1051439,5000,"未定义","永久"),//薄荷喵茶会
Array(1051440,5000,"未定义","永久"),//人鱼传说
Array(1051441,5000,"未定义","永久"),//精灵兔小妹
Array(1051442,5000,"未定义","永久"),//莫莫女仆连衣裙
Array(1051452,5000,"未定义","永久"),//橘色小短裙
Array(1051453,5000,"未定义","永久"),//小熊连衣裙
Array(1051454,5000,"未定义","永久"),//小粉粉全身服
Array(1051455,5000,"未定义","永久"),//时间的旋律
Array(1051456,5000,"未定义","永久"),//爱情鸟连衣裙
Array(1051457,5000,"未定义","永久"),//海军风校服
Array(1051459,5000,"未定义","永久"),//农夫甜心派
Array(1051465,5000,"未定义","永久"),//自嗨演出服
Array(1051487,5000,"未定义","永久"),//暖冬毛绒装
Array(1052025,5000,"未定义","永久"),//五星背带裤
Array(1052067,5000,"未定义","永久"),//木乃伊服
Array(1052073,5000,"未定义","永久"),//白兔装
Array(1052078,5000,"未定义","永久"),//泡泡袍
Array(1052085,5000,"未定义","永久"),//肚兜(红色)
Array(1052086,5000,"未定义","永久"),//肚兜(蓝色)
Array(1052135,5000,"未定义","永久"),//半人马装
Array(1052142,5000,"未定义","永久"),//背带短裤套装
Array(1052168,5000,"未定义","永久"),//可爱小绵羊服
Array(1052172,5000,"未定义","永久"),//南瓜精灵套服
Array(1052178,5000,"未定义","永久"),//乖娃娃绒线装
Array(1052193,5000,"未定义","永久"),//蜜蜂服
Array(1052194,5000,"未定义","永久"),//摩登原始人
Array(1052198,5000,"未定义","永久"),//品克缤套服
Array(1052200,5000,"未定义","永久"),//罗丽粉色娃娃套服
Array(1052201,5000,"未定义","永久"),//闪亮水手外套
Array(1052213,5000,"未定义","永久"),//阿尔冯斯铠甲
Array(1052214,5000,"未定义","永久"),//枫叶赛车手服
Array(1052218,5000,"未定义","永久"),//小丑套服
Array(1052224,5000,"未定义","永久"),//草莓baby装
Array(1052225,5000,"未定义","永久"),//暗夜娃娃装
Array(1052231,5000,"未定义","永久"),//小王子礼服
Array(1052245,5000,"未定义","永久"),//小嫩叶套服
Array(1052246,5000,"未定义","永久"),//灰蒙蒙猫套服
Array(1052253,5000,"未定义","永久"),//情操背带裤套装
Array(1052275,5000,"未定义","永久"),//皇家彩虹夹克
Array(1052284,5000,"未定义","永久"),//夏日运动服
Array(1052295,5000,"未定义","永久"),//粉色女仆套装
Array(1052293,5000,"未定义","永久"),//战斗修女服
Array(1052296,5000,"未定义","永久"),//天蓝女仆套装
Array(1052298,5000,"未定义","永久"),//兔儿洛丽塔套装
Array(1052306,5000,"未定义","永久"),//雪姬和服
Array(1052410,5000,"未定义","永久"),//粉嫩鲜花裙
Array(1052438,5000,"未定义","永久"),//麻薯巧克力衣服
Array(1052448,5000,"未定义","永久"),//西红柿外套
Array(1052449,5000,"未定义","永久"),//时尚香肠套服
Array(1052455,5000,"未定义","永久"),//小蜜蜂外套
Array(1052458,5000,"未定义","永久"),//露西亚全身装
Array(1052459,5000,"未定义","永久"),//蓝色天使制服
Array(1052503,5000,"未定义","永久"),//凉爽夏日全身装
Array(1052536,5000,"未定义","永久"),//水手装
Array(1052550,5000,"未定义","永久"),//海豹白白服
Array(1052593,5000,"未定义","永久"),//粉红缎带冰淇淋服
Array(1052594,5000,"未定义","永久"),//小恐龙绿豆套服
Array(1052595,5000,"未定义","永久"),//小恐龙云豆套服
Array(1052624,5000,"未定义","永久"),//GM学霸的海盗服
Array(1052634,5000,"未定义","永久"),//简洁白衬衫
Array(1052643,5000,"未定义","永久"),//血腥珍妮
Array(1052656,5000,"未定义","永久"),//白天鹅芭蕾服
Array(1052657,5000,"未定义","永久"),//黑天鹅芭蕾服
Array(1052661,5000,"未定义","永久"),//小鸡玩偶服
Array(1052666,5000,"未定义","永久"),//巧可羊全身装
Array(1052667,5000,"未定义","永久"),//小绵羊朵朵玩偶服
Array(1052668,5000,"未定义","永久"),//时间旅行者礼服
Array(1052697,5000,"未定义","永久"),//雪之女神连衣裙
Array(1052724,5000,"未定义","永久"),//小马乖乖套服
Array(1052726,5000,"未定义","永久"),//僵尸新娘全身装
Array(1052727,5000,"未定义","永久"),//快乐连体衫
Array(1052731,5000,"未定义","永久"),//黑色可爱游泳衣
Array(1052749,5000,"未定义","永久"),//未来天使服
Array(1052754,5000,"未定义","永久"),//嘟嘟熊连体衣
Array(1052756,5000,"未定义","永久"),//狂野十字猎服
Array(1052757,5000,"未定义","永久"),//爱丽丝礼服
Array(1052761,5000,"未定义","永久"),//战斗的蝴蝶结连衣裙
Array(1052762,5000,"未定义","永久"),//香蕉背带套装
Array(1052771,5000,"未定义","永久"),//菖蒲和服
Array(1052772,5000,"未定义","永久"),//2014制服
Array(1052773,5000,"未定义","永久"),//暗夜精灵铠甲
Array(1052779,5000,"未定义","永久"),//山茶花华服
Array(1052781,5000,"未定义","永久"),//红色小马憨憨服
Array(1052782,5000,"未定义","永久"),//蓝色小马憨憨服
Array(1052841,5000,"未定义","永久"),//甜柿服
Array(1052842,5000,"未定义","永久"),//萌犬套装(裙)
Array(1052843,5000,"未定义","永久"),//萌犬套装(裤)
Array(1052844,5000,"未定义","永久"),//微笑玉米背带裤
Array(1052845,5000,"未定义","永久"),//宽松运动服
Array(1052846,5000,"未定义","永久"),//桃太郎的背带裤
Array(1052850,5000,"未定义","永久"),//毛绒鼠鼠服
Array(1052894,5000,"未定义","永久"),//暖棉棉套服
Array(1052873,5000,"未定义","永久"),//三笠的调查兵团服装
Array(1052874,5000,"未定义","永久"),//利威尔的调查兵团服装
Array(1052876,5000,"未定义","永久"),//艾伦的调查兵团服装
Array(1052910,5000,"未定义","永久"),//水晶喵喵全身服
Array(1052911,5000,"未定义","永久"),//水晶喵喵连衣裙
Array(1052923,5000,"未定义","永久"),//黑猫连帽衫
Array(1052925,5000,"未定义","永久"),//粉红飘飘连衣裙
Array(1052926,5000,"未定义","永久"),//贵族复古礼服
Array(1052940,5000,"未定义","永久"),//一米阳光套衫
Array(1052942,5000,"未定义","永久"),//蓝色熊猫玩偶服
Array(1052946,5000,"未定义","永久"),//海贼团套服
Array(1052948,5000,"未定义","永久"),//奥尔卡的睡袍
Array(1052950,5000,"未定义","永久"),//星光嘻哈服
Array(1052951,5000,"未定义","永久"),//波点连衣裙
Array(1052965,5000,"未定义","永久"),//黑色海魂连衣裙
Array(1052975,5000,"未定义","永久"),//学生吊带裤
Array(1052977,5000,"未定义","永久"),//月光光开衫
Array(1052997,5000,"未定义","永久"),//北极保暖套服
Array(1052998,5000,"未定义","永久"),//外星人连身服
Array(1052306,5000,"未定义","永久"),//暖绒兔长裙
Array(1052002,2888,"未定义","永久")//朱红纸箱
    );


var jmwq = Array(
    Array(1092108,5000,"未定义","永久"),//
    Array(1702386,5555,"未定义","永久"),//[MS特别]水晶光芒
    Array(1702387,5555,"未定义","永久"),//[MS特别]龙奴
    Array(1702388,5555,"未定义","永久"),//[MS特别]熊宝宝是个能手巧匠
    Array(1702393,5555,"未定义","永久"),//蛇年武器
    Array(1702395,5555,"未定义","永久"),//百万富翁手杖
    Array(1702397,5555,"未定义","永久"),//溢彩银河
   // Array(1702399,2333, 1,"1天"),//尼奥拯救者
    Array(1702400,5555,"未定义","永久"),//斯乌的兔子玩偶
    Array(1702402,5555,"未定义","永久"),//高尔夫球棒
    Array(1702403,5555,"未定义","永久"),//侦探的巨型放大镜
    Array(1702405,5555,"未定义","永久"),//星光之心魔棒
    Array(1702406,5555,"未定义","永久"),//坠星魔术空间
    Array(1702415,5555,"未定义","永久"),//睡梦绵羊枕头
    Array(1702422,5555,"未定义","永久"),//冒险明星麦克风
    Array(1702423,5555,"未定义","永久"),//鬼火
    Array(1702431,5555,"未定义","永久"),//GM璐利的注射器
    Array(1702432,5555,"未定义","永久"),//十八般兵器
    Array(1702433,5555,"未定义","永久"),//莎莉曼德
    Array(1702448,5555,"未定义","永久"),//妙趣悠悠球
    Array(1702449,5555,"未定义","永久"),//喜欢草莓
    Array(1702450,5555,"未定义","永久"),//熊宝宝是机灵鬼
    Array(1702455,5555,"未定义","永久"),//真红油漆桶
    Array(1702456,5555,"未定义","永久"),//精灵皮克
    Array(1702459,5555,"未定义","永久"),//棉花糖武器
    Array(1702463,5555,"未定义","永久"),//幻夜祭华
    Array(1702464,5555,"未定义","永久"),//闪耀的伙伴们
    Array(1702466,5555,"未定义","永久"),//薄荷巧克力蛋糕魔法棒
    Array(1702468,5555,"未定义","永久"),//松脆巧克力干酪棒
    Array(1702469,5555,"未定义","永久"),//阿拉克尼
    Array(1702617,5555,"未定义","永久"),//幻想莲花武器
    Array(1702626,5555,"未定义","永久"),//海洋风提包
    Array(1702624,5555,"未定义","永久"),//时间主宰者
    Array(1702630,5555,"未定义","永久"),//吊篮花灯
    Array(1702633,5555,"未定义","永久"),//玫瑰誓约
    Array(1702594,5555,"未定义","永久"),//奥尔卡瞌睡
    Array(1702595,5555,"未定义","永久"),//薄荷喵下午茶
    Array(1702597,5555,"未定义","永久"),//彩虹贝壳武器
    Array(1702608,5555,"未定义","永久"),//海军条纹雨伞
    Array(1702591,5555,"未定义","永久"),//飞翔浪漫
    Array(1702593,5555,"未定义","永久"),//清冷天空竹子
    Array(1702583,5555,"未定义","永久"),//喵咪薯片桶
    Array(1702581,5555,"未定义","永久"),//三色蛋糕串串
    Array(1702586,5555,"未定义","永久"),//做梦的蒲公英
    Array(1702590,5555,"未定义","永久"),//雪糕~
    Array(1702574,5555,"未定义","永久"),//迅猛兽
    Array(1702571,5555,"未定义","永久"),//天下第一铲
    Array(1702566,5555,"未定义","永久"),//羊羊魔术棒
    Array(1702565,5555,"未定义","永久"),//死亡之刃
    Array(1702559,5555,"未定义","永久"),//泰迪小伙伴(白)
    Array(1702560,5555,"未定义","永久"),//泰迪小伙伴(棕)
    Array(1702561,5555,"未定义","永久"),//叉子上的蛋糕
    Array(1702562,5555,"未定义","永久"),//圣诞雪人
    Array(1702553,5555,"未定义","永久"),//危险药瓶
    Array(1702549,5555,"未定义","永久"),//拉拉队手摇花
    Array(1702540,5555,"未定义","永久"),//在这里！手电筒
    Array(1702538,5555,"未定义","永久"),//露珠武器
    Array(1702278,5000,"未定义","永久"),//枫之武器
    Array(1702289,5000,"未定义","永久"),//皇家海军旗帜
    Array(1702287,5000,"未定义","永久"),//唤灵斗师长杖
    Array(1702309,5000,"未定义","永久"),//多味棒棒糖
    Array(1702155,5000,"未定义","永久"),//绚丽彩虹
    Array(1702509,5000,"未定义","永久"),//彩糖棒
    Array(1702303,5000,"未定义","永久"),//牛奶瓶
    Array(1702253,5000,"未定义","永久"),//邦尼雨伞
    Array(1702115,5000,"未定义","永久"),//玫瑰花
    Array(1702507,5000,"未定义","永久"),//波点娃娃小扇子
    Array(1702217,5000,"未定义","永久"),//黄鸭子游泳圈
    Array(1702237,5000,"未定义","永久"),//千年白狐
    Array(1702256,5000,"未定义","永久"),//风灵使者娃娃
    Array(1702257,5000,"未定义","永久"),//魂骑士娃娃
    Array(1702258,5000,"未定义","永久"),//炎术士娃娃
    Array(1702259,5000,"未定义","永久"),//奇袭者娃娃
    Array(1702260,5000,"未定义","永久"),//夜行者娃娃
    Array(1702261,5000,"未定义","永久"),//樱花棒
    Array(1702318,5000,"未定义","永久"),//暮光雷光剑
    Array(1702319,5000,"未定义","永久"),//苹果绿雷光剑
    Array(1702320,5000,"未定义","永久"),//蓝灰闪电雷光剑
    Array(1702321,5000,"未定义","永久"),//黑暗中子星雷光剑
    Array(1702322,5000,"未定义","永久"),//固态黑色雷光剑
    Array(1702186,5000,"未定义","永久"),//迪波
    Array(1702209,5000,"未定义","永久"),//驯鹿拐杖
    Array(1702204,5000,"未定义","永久"),//日本铁扇
    Array(1702203,5000,"未定义","永久"),//万圣节泰迪熊
    Array(1702157,5000,"未定义","永久"),//火烤棉花糖
    Array(1702161,5000,"未定义","永久"),//凶恶的狗狗
    Array(1702120,5000,"未定义","永久"),//比耶莫特的剑
    Array(1702118,5000,"未定义","永久"),//亚努斯的剑
    Array(1702119,5000,"未定义","永久"),//夏奇尔的剑
    Array(1702285,5000,"未定义","永久"),//蓝色蝴蝶结手提包
    Array(1702302,5000,"未定义","永久"),//杯具
    Array(1702208,5000,"未定义","永久"),//搞怪鳄鱼
    Array(1702305,5000,"未定义","永久"),//胡萝卜武器
    Array(1702310,5000,"未定义","永久"),//星光魔法棒
    Array(1702374,5000,"未定义","永久"),//剑豪之刃
    Array(1702306,5000,"未定义","永久"),//花风芭蕉扇
    Array(1702379,5000,"未定义","永久"),//阿拉伯魔术洋灯
    Array(1702378,5000,"未定义","永久"),//国庆闪亮之光
    Array(1702263,5000,"未定义","永久"),//小灰灰猫
    Array(1702308,5000,"未定义","永久"),//魔术师帽子
    Array(1702298,5000,"未定义","永久"),//暗影刀子
    Array(1702291,5000,"未定义","永久"),//玲珑扇
    Array(1702293,5000,"未定义","永久"),//秋天旅行者背包
    Array(1702299,5000,"未定义","永久"),//可爱巧克力棒
    Array(1702300,5000,"未定义","永久"),//电蚊拍
    Array(1702328,5000,"未定义","永久"),//粉红天使注射器
    Array(1702329,5000,"未定义","永久"),//喜欢草莓
    Array(1702233,5000,"未定义","永久"),//彩虹毛笔
    Array(1702187,5000,"未定义","永久"),//蓝色极光
    Array(1702188,5000,"未定义","永久"),//粉色极光
    Array(1702193,5000,"未定义","永久"),//湿抹布
    Array(1702252,5000,"未定义","永久"),//鹰的飞舞
    Array(1702276,5000,"未定义","永久"),//天际之弓
    Array(1702283,5000,"未定义","永久"),//天界圣战手镯
    Array(1702279,5000,"未定义","永久"),//天界圣战之剑
    Array(1702280,5000,"未定义","永久"),//天界圣战巨剑
    Array(1702281,5000,"未定义","永久"),//天界圣战法杖
    Array(1702282,5000,"未定义","永久"),//天界圣战藏弓
    Array(1702324,5000,"未定义","永久"),//冲击波
    Array(1702313,5000,"未定义","永久"),//橙色极光
    Array(1702314,5000,"未定义","永久"),//天堂极光
    Array(1702315,5000,"未定义","永久"),//斯泰拉极光
    Array(1702316,5000,"未定义","永久"),//动态极光
    Array(1702295,5000,"未定义","永久"),//扑克牌
    Array(1702274,5000,"未定义","永久"),//神龙手套
    Array(1702301,5000,"未定义","永久")//兔兔魔力棒
    );  


var jzmp = Array(
    Array(1112150,5333,"未定义","永久"),//天使降临名片戒指
    Array(1112176,5333,"未定义","永久"),//旋律音符名片戒指
    Array(1112184,5333,"未定义","永久"),//富豪泰格尔名片戒指
    Array(1112191,5333,"未定义","永久"),//蜜蜂名片戒指
    Array(1112192,5333,"未定义","永久"),//菠萝甜心名片戒指
    Array(1112197,5333,"未定义","永久"),//晚安小怪兽名片戒指1115010
	Array(1115010,5333,"未定义","永久"),//
    Array(1112198,5333,"未定义","永久"),//吃货小怪兽名片戒指
    Array(1112808,5333,"未定义","永久"),//钻石聊天戒指
    Array(1112210,5333,"未定义","永久"),//黄金聊天戒指
    Array(1112218,5333,"未定义","永久"),//小熊猫聊天戒指
    Array(1112103,5333,"未定义","永久"),//嫩黄名片戒指
    Array(1112252,5333,"未定义","永久"),//红玫瑰聊天戒指
    Array(1112141,5333,"未定义","永久"),//红玫瑰名片戒指
    Array(1112928,5333,"未定义","永久"),//粉色流星戒指90天
    Array(1112905,5333,"未定义","永久"),//超大心环绕戒指
    Array(1112906,5333,"未定义","永久"),//心心祝福戒指
    Array(1112916,5333,"未定义","永久"),//寂寞单身戒指
    Array(1112148,5333,"未定义","永久"),//胡子先生名片戒指
    Array(1112266,5333,"未定义","永久"),//胡子先生对话框戒指
    Array(1112154,5333,"未定义","永久"),//压岁钱防御战名片戒指
    Array(1112259,5333,"未定义","永久"),//压岁钱防御战聊天戒指
    Array(1112274,5333,"未定义","永久"),//鸥巴聊天戒指
    Array(1112162,5333,"未定义","永久"),//鸥巴名片戒指
    Array(1112276,5333,"未定义","永久"),//夏日甜心聊天戒指
    Array(1112164,5333,"未定义","永久"),//夏日甜心名片戒指
    Array(1112273,5333,"未定义","永久"),//黄小丫聊天戒指
    Array(1112161,5333,"未定义","永久"),//黄小丫名片戒指
    Array(1112271,5333,"未定义","永久"),//非洲之星聊天戒指1
    Array(1112159,5333,"未定义","永久"),//非洲之星名片戒指
    Array(1112252,5333,"未定义","永久"),//红玫瑰聊天戒指
    Array(1112141,5333,"未定义","永久"),//红玫瑰名片戒指
    Array(1112135,5333,"未定义","永久"),//水墨花名片戒指
    Array(1112238,5333,"未定义","永久"),//水墨花聊天戒指
    Array(1112143,5333,"未定义","永久"),//豪华珍珠名片戒指
    Array(1112254,5333,"未定义","永久"),//豪华珍珠聊天戒指
    Array(1112262,5333,"未定义","永久"),//天使降临聊天戒指
    Array(1112150,5333,"未定义","永久"),//天使降临名片戒指
    Array(1112143,5333,"未定义","永久"),//豪华珍珠名片戒指
    Array(1112254,5333,"未定义","永久"),//豪华珍珠聊天戒指
    Array(1112120,5333,"未定义","永久"),//可乐(White) 名片戒指
    Array(1112230,5333,"未定义","永久"),//可乐(White)聊天戒
    Array(1112253,5333,"未定义","永久"),//木乃伊聊天戒指
    Array(1112142,5333,"未定义","永久"),//木乃伊名片戒指
    Array(1112257,5333,"未定义","永久"),//浪漫花边聊天戒指
    Array(1112145,5333,"未定义","永久"),//浪漫花边名片戒指
    Array(1112258,5333,"未定义","永久"),//青苹果之恋聊天戒指
    Array(1112146,5333,"未定义","永久"),//青苹果之恋名片戒指
    Array(1112237,5333,"未定义","永久"),//小竹林聊天戒指
    Array(1112134,5333,"未定义","永久"),//小竹林名片戒指
    Array(1112171,5333,"未定义","永久"),//狗狗名片戒指(白)
    Array(1112283,5333,"未定义","永久"),//
    Array(1112172,5333,"未定义","永久"),//狗狗名片戒指（棕）
    Array(1112284,5333,"未定义","永久"),//
    Array(1112173,5333,"未定义","永久"),//奶白兔名片戒指
    Array(1112285,5333,"未定义","永久"),//
    Array(1112174,5333,"未定义","永久"),//足球1
    Array(1112286,5333,"未定义","永久"),//
    Array(1112176,5333,"未定义","永久"),//旋律音符名片戒指
    Array(1112288,5333,"未定义","永久"),//
    Array(1112178,5333,"未定义","永久"),//梦幻雪景名片戒指
    Array(1112290,5333,"未定义","永久"),//
    Array(1112179,5333,"未定义","永久"),//雪花圣诞名片戒指
    Array(1112291,5333,"未定义","永久"),//
    Array(1112181,5333,"未定义","永久"),//云朵羊咩咩名片戒指
    Array(1112294,5333,"未定义","永久"),//
    Array(1112145,5333,"未定义","永久"),//浪漫花边名片戒指
    Array(1112257,5333,"未定义","永久"),//
    Array(1112165,5333,"未定义","永久"),//绿光森林名片戒指
    Array(1112277,5333,"未定义","永久")//绿光森林聊天戒指
    );  

var tjId = Array(
    Array(3010163,2000,"未定义","10天",60000 * 60 * 24 * 10,1)//满月椅子
    );

var syxh = Array(
   // Array(5150040,950,"未定义",1),//皇家美发卡
   // Array(5150040,9500,"未定义",10),//皇家美发卡
	Array(1112404,5000,"500033","1")//极光戒指
    );  

var tscl = Array(
    Array(4000151,1000,100),//时间门神的轴标
    Array(4001109,1000,5)//强化玻璃瓶
    );  

var xswp = Array(
    //Array(1062054,2388,"未定义","永久"),//
    Array(1062054,2388,"未定义","永久"),//
    Array(1062222,2388,"未定义","永久"),//嫩黄小熊七分裤
	Array(1062223,2388,"未定义","永久"),//蓝色粉喵喵短裙
	Array(1062225,2388,"未定义","永久"),//爱心针织裤
	Array(1062226,2388,"未定义","永久"),//虎脚印短裤
	Array(1062227,2388,"未定义","永久"),//彩虹打底裤
	Array(1062231,2388,"未定义","永久"),//蓝色破洞牛仔裤
	Array(1062220,2388,"未定义","永久"),//白色翻边小短裤
	Array(1062218,2388,"未定义","永久"),//粉绿喵咪小裤衩
	Array(1062214,2388,"未定义","永久"),//泰迪短裤
	Array(1062213,2388,"未定义","永久"),//针织绒绒裤
	Array(1062211,2388,"未定义","永久"),//奶牛短裤
	Array(1062210,2388,"未定义","永久"),//兰兰休闲短裤
	Array(1062209,2388,"未定义","永久"),//小兔兔短裤(蓝色)
	Array(1062174,2388,"未定义","永久"),//蓬蓬星塑身裤
	Array(1062173,2388,"未定义","永久"),//明星短裤
	Array(1062172,2388,"未定义","永久"),//芭比格子塑身裤
	Array(1062112,2388,"未定义","永久"),//内裤
	Array(1062085,2388,"未定义","永久"),//修身小西裤
	Array(1061211,2388,"未定义","永久"),//绿色蓬纱短裙
	Array(1061212,2388,"未定义","永久"),//白色夏日短裙
	Array(1061207,2388,"未定义","永久"),//流星雨短裙
	Array(1061205,2388,"未定义","永久"),//明星百褶裙
    Array(1012253,1388,"未定义","永久"),//心跳唇彩
    Array(1012427,1388,"未定义","永久"),//微笑的表情
    Array(1012428,1388,"未定义","永久"),//疑问的表情
    Array(1012429,1388,"未定义","永久"),//惊讶的表情
    Array(1012430,1388,"未定义","永久"),//可爱的表情
    Array(1012431,1388,"未定义","永久"),//撇嘴的表情
    Array(1012432,1388,"未定义","永久"),//傲慢的表情
    Array(1032181,1388,"未定义","永久"),//杜鹃花耳环
    Array(1032145,1388,"未定义","永久"),//螃蟹耳环
    Array(1032094,1388,"未定义","永久"),//胡萝卜耳环
    Array(1032052,1388,"未定义","永久")//绿水灵耳钉
    //Array(5360014,1000,"1天权",60000 * 60 * 24 * 1,1)
    //Array(5211047,1000,"1天权",60000 * 60 * 24 * 1,1)
    );

var jmpf = Array(
    Array(1102142,2588,"未定义","永久"),
    Array(1102749,2588,"未定义","永久"),//五彩星星气球
    Array(1102754,2588,"未定义","永久"),//群鸟之星
    Array(1102755,2588,"未定义","永久"),//星光点点气球
    Array(1102756,2588,"未定义","永久"),//微笑玉米斗篷
    Array(1102757,2588,"未定义","永久"),//巴尼兔心形气球
    Array(1102808,2588,"未定义","永久"),//啵啵鼠气球
    Array(1102692,2588,"未定义","永久"),//小小寿司团
    Array(1102688,2588,"未定义","永久"),//双色砰砰炮
    Array(1102682,2588,"未定义","永久"),//未来天使注射器
    Array(1102684,2588,"未定义","永久"),//未来医生听诊器
    Array(1102676,2588,"未定义","永久"),//摇摆猫咪酱
    Array(1102220,2588,"未定义","永久"),//小绵羊披风
    Array(1102665,1888,"未定义","永久"),//狐狸围脖
    Array(1102605,1888,"未定义","永久"),//暗炎赎罪者
    Array(1102671,1888,"未定义","永久"),//肃清者的荆翼
    Array(1102564,1888,"未定义","永久"),//天衣无缝
    Array(1102267,1888,"未定义","永久"),//我的朋友九尾狐尾巴
    Array(1102217,1888,"未定义","永久"),//九尾披风
    Array(1102625,1888,"未定义","永久"),//红色蜗牛壳
    Array(1102188,1888,"未定义","永久"),//银色狐狸尾巴
    Array(1102187,1888,"未定义","永久"),//金色狐狸尾巴
    Array(1102648,1888,"未定义","永久"),//K君的猫尾巴
    Array(1102387,1888,"未定义","永久"),//海龙尾巴
    Array(1102388,1888,"未定义","永久"),//炎龙尾巴
    Array(1102292,1888,"未定义","永久"),//尾巴
    Array(1102296,1888,"未定义","永久"),//夜叉尾巴（黑色）
    Array(1102656,1888,"未定义","永久"),//动物尾巴6
    Array(1102622,1888,"未定义","永久"),//时间旅行者的怀表
    Array(1102692,1888,"未定义","永久"),//寿司团
    Array(1102574,1888,"未定义","永久"),//小鸡叽叽叽
    Array(1102380,1888,"未定义","永久"),//我的朋友青蛙酱
    Array(1102549,1888,"未定义","永久"),//管家的猫咪
    Array(1102705,1888,"未定义","永久"),//企鹅书包
    Array(1102683,1888,"未定义","永久"),//兔兔熊背包
    Array(1102684,1888,"未定义","永久"),//未来医生听诊器
    Array(1102682,1888,"未定义","永久"),//未来天使注射器
    Array(1102593,1888,"未定义","永久"),//浮漾的翅膀
    Array(1102668,1888,"未定义","永久"),//夜天使之翼
    Array(1102353,1888,"未定义","永久"),//自由的翅膀
    Array(1102554,1888,"未定义","永久"),//女妖之翼
    Array(1102391,1888,"未定义","永久"),//小蜜蜂翅膀
    Array(1102325,1888,"未定义","永久"),//紫天使羽翼
    Array(1102326,1888,"未定义","永久"),//蓝天使羽翼
    Array(1102389,1888,"未定义","永久"),//金色天使
    Array(1102390,1888,"未定义","永久"),//银色天使
    Array(1102273,1888,"未定义","永久"),//路西法之翼
    Array(1102349,1888,"未定义","永久"),//发光精灵翅膀
    Array(1102293,1888,"未定义","永久"),//羁绊之翼
    Array(1102152,1888,"未定义","永久"),//黑骷髅海盗旗
    Array(1102300,1888,"未定义","永久"),//派对舞会灯
    Array(1102288,1888,"未定义","永久"),//背背雪人
    Array(1102274,1888,"未定义","永久"),//刺柏刀
    Array(1102310,1888,"未定义","永久"),//精灵披风
    Array(1102461,1888,"未定义","永久"),//粉嫩披风
    Array(1102222,1888,"未定义","永久"),//死神披风
    Array(1102583,1888,"未定义","永久"),//宝贝龙波比
    Array(1102232,1888,"未定义","永久"),//小王子的星星
    Array(1102218,1888,"未定义","永久"),//仙女飘飘
    Array(1102356,1888,"未定义","永久"),//天使祖母绿
    Array(1102270,1888,"未定义","永久"),//风和日丽
    Array(1102261,1888,"未定义","永久"),//音符围脖
    Array(1102251,1888,"未定义","永久"),//世界杯手巾
    Array(1102373,1888,"未定义","永久"),//露西娅披风
    Array(1102301,1888,"未定义","永久"),//旅行者披风
    Array(1102255,1888,"未定义","永久"),//唤灵斗师披风
    Array(1102254,1888,"未定义","永久"),//豹弩游侠披风
    Array(1102242,1888,"未定义","永久"),//胡克的船长披风
    Array(1102249,1888,"未定义","永久"),//奥兹魔法披风
    Array(1102239,1888,"未定义","永久"),//暗影双刀披风
    Array(1102355,1888,"未定义","永久"),//怪盗幻影披风
    Array(1102673,1888,"未定义","永久"),//僵尸新娘披风
    Array(1102324,1888,"未定义","永久"),//传说双层气球
    Array(1102212,1888,"未定义","永久"),//丢失的小孩
    Array(1102233,1888,"未定义","永久"),//雪娃娃披风
    Array(1102230,1888,"未定义","永久"),//企企雪橇披风
    Array(1102245,1888,"未定义","永久"),//太阳披风
    Array(1102258,1888,"未定义","永久"),//玩具熊气球
    Array(1102215,1888,"未定义","永久"),//气球串
    Array(1102271,1888,"未定义","永久"),//可爱巧克力棒气球
    Array(1102488,1888,"未定义","永久"),//蛋糕杯气球
    Array(1102285,1888,"未定义","永久"),//晴天娃娃(粉色)
    Array(1102286,1888,"未定义","永久"),//晴天娃娃(天蓝色)
    Array(1102287,1888,"未定义","永久")//晴天娃娃(淡黄色)
    );


var jmmz = Array(
    Array(1004530,2666,"未定义","永久"),//蓝色熊猫玩偶帽子
    Array(1004532,2666,"未定义","永久"),//女皇关注
    Array(1004533,2666,"未定义","永久"),//兰儿在游戏！
    Array(1004525,2666,"未定义","永久"),//发卷
    Array(1004505,2666,"未定义","永久"),//粉红樱花丝带
    Array(1004488,2666,"未定义","永久"),//治愈之丝带
    Array(1004486,2666,"未定义","永久"),//春之主人
    Array(1004467,2666,"未定义","永久"),//特大爱心宽檐帽
    Array(1004468,2666,"未定义","永久"),//小小训练师帽
    Array(1004454,2666,"未定义","永久"),//狸猫帽子
    Array(1004414,2666,"未定义","永久"),//热腾腾包子帽
    Array(1004328,2666,"未定义","永久"),//粉色棒球帽
    Array(1004156,2666,"未定义","永久"),//来这星星的你
    Array(1004108,2666,"未定义","永久"),//幻夜蝶华礼帽
    Array(1003050,1888,"未定义","永久"),//兔帽子
    Array(1002720,1888,"未定义","永久"),//杂技团老板帽	
    Array(1003247,2666,"未定义","永久"),//杂技团老板帽
    Array(1003272,2666,"未定义","永久"),//格莱特帽
    Array(1003276,2666,"未定义","永久"),//蓝心透明帽子
    Array(1003271,2666,"未定义","永久"),//红心透明帽子
    Array(1003892,2666,"未定义","永久"),//树叶钻石
    Array(1003955,2666,"未定义","永久"),//浪漫玫瑰  
    Array(1003918,2666,"未定义","永久"),//翅膀帽
    Array(1004029,2666,"未定义","永久"),//小白熊便帽
    Array(1004026,2666,"未定义","永久"),//小黑猫便帽
    Array(1004028,2666,"未定义","永久"),//小花猫便帽
    Array(1004027,2666,"未定义","永久"),//白猫无边帽
    Array(1000052,2666,"未定义","永久"),//公主冠(男)
    Array(1004094,2666,"未定义","永久"),//白巧克力兔子发箍
    Array(1004193,2666,"未定义","永久"),//护目镜帽子
    Array(1002846,2666,"未定义","永久"),//蓝天贝雷帽
    Array(1002995,2666,"未定义","永久"),//皇家海军帽
    Array(1003748,2666,"未定义","永久"),//皇家天使帽
    Array(1004038,2666,"未定义","永久"),//小小企鹅帽
    Array(1004190,2666,"未定义","永久"),//微笑旋律耳机
    Array(1003084,2666,"未定义","永久"),//帝国皇冠
    Array(1002839,2666,"未定义","永久"),//南瓜棒球帽
    Array(1003861,2666,"未定义","永久"),//明星小皇冠
    Array(1003216,2666,"未定义","永久"),//贵族船长帽
    Array(1003398,2666,"未定义","永久"),//黑暗米哈尔
    Array(1003399,2666,"未定义","永久"),//黑暗奥兹
    Array(1003400,2666,"未定义","永久"),//黑暗伊莉娜
    Array(1003401,2666,"未定义","永久"),//黑暗伊卡尔特
    Array(1003402,2666,"未定义","永久"),//黑暗胡克
    Array(1003458,2666,"未定义","永久"),//茅山道士帽
    Array(1003846,2666,"未定义","永久"),//丹珍帽子
    Array(1003104,2666,"未定义","永久"),//巨型蛋糕帽
    Array(1003246,2666,"未定义","永久"),//可爱兔子帽
    Array(1004112,2666,"未定义","永久"),//刀马旦花帽
    Array(1003776,2666,"未定义","永久"),//海豹白白帽
    Array(1003392,2666,"未定义","永久"),//小蜜蜂帽子
    Array(1003802,2666,"未定义","永久"),//小恐龙绿豆帽子
    Array(1003803,2666,"未定义","永久"),//小恐龙云豆帽子
    Array(1003728,2666,"未定义","永久"),//蓝色精灵帽
    Array(1003727,2666,"未定义","永久"),//红色精灵帽
    Array(1003509,2666,"未定义","永久"),//时尚香肠帽
    Array(1003508,2666,"未定义","永久"),//西红柿帽子
    Array(1004189,2666,"未定义","永久"),//企鹅王帽子
    Array(1004124,2666,"未定义","永久"),//恋爱小草莓帽
    Array(1004125,2666,"未定义","永久"),//歌唱大菠萝帽
    Array(1003829,2666,"未定义","永久"),//兔耳管家礼帽
    Array(1003541,2666,"未定义","永久"),//逆转兔帽子
    Array(1004126,2666,"未定义","永久"),//彩塘熊耳帽
    Array(1004092,2666,"未定义","永久"),//小马乖乖帽
    Array(1003842,2666,"未定义","永久"),//女妖帽子
    Array(1003463,2666,"未定义","永久"),//精灵妈妈帽
    Array(1003921,2666,"未定义","永久"),//咕噜噜鸭舌帽
    Array(1003588,2666,"未定义","永久"),//玩具粉熊帽子
    Array(1003909,2666,"未定义","永久"),//活力苏打帽
    Array(1003596,2666,"未定义","永久"),//金属粉色棒球帽
    Array(1003597,2666,"未定义","永久"),//金属冠棒球帽
    Array(1003462,2666,"未定义","永久"),//Kitty猫猫帽
    Array(1003268,2666,"未定义","永久"),//按键狂人糖果帽
    Array(1003269,2666,"未定义","永久"),//按键狂人玩具帽
    Array(1003241,2666,"未定义","永久"),//摇滚歌手帽
    Array(1003533,2666,"未定义","永久"),//黑暗奥尔卡军官帽
    Array(1002524,2666,"未定义","永久"),//可乐帽
    Array(1003790,2666,"未定义","永久"),//高尔夫遮阳帽
    Array(1004137,2666,"未定义","永久"),//兔兔熊帽
    Array(1003919,2666,"未定义","永久"),//花花绒线帽
    Array(1003077,2666,"未定义","永久"),//花别针尼龙帽
    Array(1003215,2666,"未定义","永久"),//粉色雪花帽
    Array(1003387,2666,"未定义","永久"),//耳机毛线帽
    Array(1003210,2666,"未定义","永久"),//绒球遮耳帽
    Array(1002422,2666,"未定义","永久"),//点点星光帽
    Array(1003920,2666,"未定义","永久"),//夏威夷草帽
    Array(1003519,2666,"未定义","永久"),//霞光草帽
    Array(1003141,2666,"未定义","永久"),//稻草编织帽
    Array(1003531,2666,"未定义","永久"),//西式风情帽
    Array(1003539,2666,"未定义","永久"),//蓝色天使帽
    Array(1004136,2666,"未定义","永久"),//未来天使帽
    Array(1003793,2666,"未定义","永久"),//杜鹃花发簪
    Array(1003958,2666,"未定义","永久"),//香草糯米冰
    Array(1003957,2666,"未定义","永久"),//薄荷糯米冰
    Array(1004191,2666,"未定义","永久"),//粉红翅膀帽
    Array(1004203,2666,"未定义","永久"),//喵星人的秘密
    Array(1004014,2666,"未定义","永久"),//阿宅守护精灵
    Array(1003967,2666,"未定义","永久"),//巧可羊帽子
    Array(1004204,2666,"未定义","永久"),//小蓝马
    Array(1004205,2666,"未定义","永久"),//小红马
    Array(1003234,2666,"未定义","永久"),//粉色卓别林帽子
    Array(1003235,2666,"未定义","永久"),//珠宝蓝卓别林帽子
    Array(1002920,2666,"未定义","永久"),//粉红淑女帽
    Array(1001042,2666,"未定义","永久"),//紫环头纱
    Array(1004113,2666,"未定义","永久"),//僵尸新娘的面纱
    Array(1004123,2666,"未定义","永久"),//时尚小圆帽
    Array(1002885,2666,"未定义","永久"),//新型蝴蝶结
    Array(1003133,2666,"未定义","永久"),//雪姬蝴蝶结
    Array(1003233,2666,"未定义","永久"),//最爱兔子发夹
    Array(1003222,2666,"未定义","永久"),//冰蓝蝴蝶卡子
    Array(1003362,2666,"未定义","永久"),//玫瑰粉双蝴蝶结
    Array(1003862,2666,"未定义","永久"),//熊宝宝发带
    Array(1003132,2666,"未定义","永久"),//红色精致丝带
    Array(1004111,2666,"未定义","永久"),//粉色波点发箍
    Array(1004110,2666,"未定义","永久"),//蓝色波点发箍
    Array(1003071,2666,"未定义","永久"),//淘气女孩粉色发箍
    Array(1003072,2666,"未定义","永久"),//黑蕾丝蝴蝶发箍
    Array(1003459,2666,"未定义","永久"),//露西娅帽子
    Array(1003750,2666,"未定义","永久"),//绸带猫耳
    Array(1003760,2666,"未定义","永久"),//猫咪耳机
    Array(1003505,2666,"未定义","永久"),//炎龙角
    Array(1003278,2666,"未定义","永久"),//孔雀羽毛
    Array(1003503,2666,"未定义","永久"),//爱丽丝的茶杯
    Array(1003223,2666,"未定义","永久"),//寻找妈咪的小鸡
    Array(1003510,2666,"未定义","永久"),//爱丽丝兔子头饰
    Array(1003202,2666,"未定义","永久"),//黄金甲壳虫
    Array(1003367,2666,"未定义","永久"),//彩色花环
    Array(1003376,2666,"未定义","永久"),//天使的发夹
    Array(1003742,2666,"未定义","永久"),//黑暗小恶魔帽子
    Array(1003761,2666,"未定义","永久"),//圣洁天使帽
    Array(1003461,2666,"未定义","永久"),//秀秀
    Array(1003277,2666,"未定义","永久"),//草业妖精帽
    Array(1000051,2666,"未定义","永久"),//精灵精神发带
    Array(1003520,2666,"未定义","永久"),//可爱丝线发带
    Array(1003860,2666,"未定义","永久"),//赛利亚假发
    Array(1003807,2666,"未定义","永久"),//桃心太阳眼镜
    Array(1003264,2666,"未定义","永久"),//太阳镜
    Array(1003265,2666,"未定义","永久"),//水手太阳镜
    Array(1003594,2666,"未定义","永久"),//凉爽夏日潜水镜
    Array(1003043,2666,"未定义","永久"),//叮当鹿角
    Array(1003078,2666,"未定义","永久"),//灵异蝴蝶
    Array(1003581,2666,"未定义","永久"),//蝴蝶伴舞头饰
    Array(1003586,2666,"未定义","永久"),//薄荷海军帽
    Array(1003587,2666,"未定义","永久"),//粉红丝带海军帽
    Array(1003079,2666,"未定义","永久"),//小嫩叶帽
    Array(1003083,2666,"未定义","永久"),//小嫩苗
    Array(1002888,2666,"未定义","永久"),//丝带发箍（红色）
    Array(1002890,2666,"未定义","永久"),//丝带发箍（蓝色）
    Array(1003639,2666,"未定义","永久"),//荧光发箍-粉色
    Array(1003640,2666,"未定义","永久"),//荧光发箍-蓝色
    Array(1003641,2666,"未定义","永久"),//荧光发箍-绿色
    Array(1003642,2666,"未定义","永久"),//荧光发箍-金色
    Array(1003249,2666,"未定义","永久"),//8周年音符黄晶
    Array(1003250,2666,"未定义","永久"),//8周年音符红宝石
    Array(1003251,2666,"未定义","永久"),//8周年音符黄水晶
    Array(1003252,2666,"未定义","永久"),//8周年音符紫水晶
    Array(1003548,2666,"未定义","永久"),//魔术师黑色礼帽
    Array(1003549,2666,"未定义","永久"),//魔术师黑色缎带
    Array(1003607,2666,"未定义","永久"),//蓝宝石羽毛发饰
    Array(1003636,2666,"未定义","永久"),//水神帽
    Array(1003865,2666,"未定义","永久"),//星光飘带帽子
    Array(1003516,2666,"未定义","永久"),//爱丽丝兔子头饰
    Array(1003461,2666,"未定义","永久"),//玫瑰秀秀
    Array(1000053,2666,"未定义","永久"),//贵族晚宴帽(男)
    Array(1000050,2666,"未定义","永久"),//薄荷雪水晶(男)
    Array(1000045,2666,"未定义","永久"),//军团长假发-男
    Array(1000046,2666,"未定义","永久"),//精灵王假发-男
    Array(1000071,2666,"未定义","永久"),//蓝色蝴蝶结礼帽(男)
    Array(1002444,2666,"未定义","永久"),//蜀皇之冠
    Array(1002445,2666,"未定义","永久"),//魏皇之冠
    Array(1002446,2666,"未定义","永久"),//吴皇之冠
    Array(1003460,2666,"未定义","永久"),//奶油巧克力帽子
    Array(1003796,2666,"未定义","永久"),//甜蜜冰淇淋帽
    Array(1003542,2666,"未定义","永久"),//草莓杏仁饼发卡
    Array(1003543,2666,"未定义","永久"),//杏仁饼发卡
    Array(1003544,2666,"未定义","永久"),//草莓纸杯蛋糕发卡
    Array(1003545,2666,"未定义","永久"),//哈密瓜纸杯蛋糕发卡
    Array(1003546,2666,"未定义","永久"),//巧克力纸杯蛋糕发卡
    Array(1003547,2666,"未定义","永久"),//冰激淋纸杯蛋糕发卡
    Array(1003484,2666,"未定义","永久"),//逗逗龙帽-白色
    Array(1003482,2666,"未定义","永久"),//逗逗龙帽-绿色
    Array(1003483,2666,"未定义","永久"),//逗逗龙帽-粉色
    Array(1003487,2666,"未定义","永久"),//龙龙贪吃帽-白色
    Array(1003486,2666,"未定义","永久"),//龙龙贪吃帽-金色
    Array(1003485,2666,"未定义","永久"),//龙龙贪吃帽-绿色
    Array(1003492,2666,"未定义","永久"),//蓬松蛋卷寿司
    Array(1003493,2666,"未定义","永久"),//新鲜三文鱼
    Array(1003494,2666,"未定义","永久"),//Q弹章鱼寿司
    Array(1003495,2666,"未定义","永久"),//鲑鱼子寿司
    Array(1003496,2666,"未定义","永久"),//呀吼鲜虾寿司
    Array(1003595,2666,"未定义","永久")//卷发兔子
    );

var jmsp = Array(
    Array(1902034,5000,"未定义","打豆豆 1 "),//
	Array(1912027,5000,"未定义","打豆豆 1 "),//
	Array(1902035,5000,"未定义","蝙蝠怪 1 "),//
	Array(1912028,5000,"未定义","蝙蝠怪 1 "),//
	//Array(1902019,5000,"未定义","鳄鱼王 1 "),//
	//Array(1912012,5000,"未定义","鳄鱼王 1 "),//
	Array(1902059,5000,"未定义","兔子 1 "),//
	Array(1912052,5000,"未定义","兔子 1 "),//
	Array(1902061,5000,"未定义","车夫 1 "),//
	Array(1912054,5000,"未定义","车夫 1 "),//
	Array(1902031,5000,"未定义","战车 1 "),//
	Array(1912024,5000,"未定义","战车 1 "),//
    Array(1902021,5000,"未定义","钢铁变形侠 1 "),//
    Array(1912014,5000,"未定义","钢铁变形侠 2 "),//
    Array(1902045,5000,"未定义","老虎只是传说1 "),//
    Array(1912038,5000,"未定义","老虎只是传说2 "),// 
    Array(1902028,5000,"未定义","云坐骑 1 "),//天马
    Array(1912021,5000,"未定义","云鞍子 2 "),//天马
    Array(1902024,5000,"未定义","马坐骑 1 "),//天马
    Array(1912017,5000,"未定义","马鞍子 2 "),//天马
    Array(1902013,5000,"未定义","牛坐骑 1 "),//水牛
    Array(1912009,5000,"未定义","牛鞍子 2 ")//水牛
    //Array(1902042,5000,"未定义","龙坐骑 1 "),//3阶段
    //Array(1912035,5000,"未定义","龙鞍子 2 ")//3阶段
   // Array(1902032,5000,"未定义","马坐骑 1 "),//梦魇
   // Array(1912025,5000,"未定义","马鞍子 2 ")//梦魇
    );

var qtwp = Array(
    //   Array(5220010,200,"未定义",1),//炽热情景喇叭
    //  Array(5220010,2000,"未定义",10),//炽热情景喇叭 
    // Array(5220010,20000,"未定义",100),//炽热情景喇叭
    Array(5150038,3888,"未定义",1),//炽热情景喇叭
    Array(1012501,5000,"未定义",1),//炽热情景喇叭
    Array(1012131,5000,"未定义",1)//炽热情景喇叭
    //            Array(5390000,5500,"未定义",10),//炽热情景喇叭
    //	Array(5390001,5500,"未定义",10),//绚烂情景喇叭
    //		Array(5390002,5500,"未定义",10),//爱心情景喇叭
    //		Array(5390003,5500,"未定义",10),//新年庆祝喇叭1
    //		Array(5390004,5500,"未定义",10),//新年庆祝喇叭2
    //		Array(5390005,9500,"未定义",10),//小老虎情景喇叭
    );

//var gfs = Array(

	//Array(5000191,68888,"未定义","永久"),//派对公子服(男)
//		Array(1050302,6888,"未定义","永久"),//执事之品格(男)
//		Array(1000052,6888,"未定义","永久"),//公主冠(男)

//		Array(1004108,6888,"未定义","永久"),//幻夜蝶华礼帽
//		Array(1003247,6888,"未定义","永久"),//杂技团老板帽
//		Array(1003272,6888,"未定义","永久"),//格莱特帽
//		Array(1003276,6888,"未定义","永久"),//蓝心透明帽子
//		Array(1003271,6888,"未定义","永久"),//红心透明帽子
//		Array(1003918,6888,"未定义","永久"),//翅膀帽
//		Array(1004029,6888,"未定义","永久"),//小白熊便帽
//		Array(1004026,6888,"未定义","永久"),//小黑猫便帽
//		Array(1004028,6888,"未定义","永久"),//小花猫便帽
//		Array(1004027,6888,"未定义","永久"),//白猫无边帽 
//		Array(1003955,6888,"未定义","永久"),//浪漫玫瑰
//		Array(1004094,6888,"未定义","永久"),//白巧克力兔子发箍
//		Array(1004193,6888,"未定义","永久"),//护目镜帽子
//		Array(1003892,6888,"未定义","永久"),//树叶钻石
//		Array(1002846,6888,"未定义","永久"),//蓝天贝雷帽
//		Array(1002995,6888,"未定义","永久"),//皇家海军帽
//		Array(1003748,6888,"未定义","永久"),//皇家天使帽
//		Array(1702168,6888,"未定义","永久"),//闪亮圣诞树
//		Array(1702278,6888,"未定义","永久"),//枫之武器
//		Array(1702289,6888,"未定义","永久"),//皇家海军旗帜
//		Array(1702298,6888,"未定义","永久"),//暗影刀子
//		Array(1702287,6888,"未定义","永久"),//唤灵斗师长杖
//		Array(1702277,6888,"未定义","永久"),//密码签字笔
//		Array(1702309,6888,"未定义","永久"),//多味棒棒糖
//		Array(1702155,6888,"未定义","永久"),//绚丽彩虹
//		Array(1102605,6888,"未定义","永久"),//暗炎赎罪者
//		Array(1102671,6888,"未定义","永久"),//肃清者的荆翼
//		Array(1102564,6888,"未定义","永久"),//天衣无缝
//		Array(1102653,6888,"未定义","永久"),//兔尾巴
//		Array(1102267,6888,"未定义","永久")//我的朋友九尾狐尾巴
//                   );



var ns = Array(
    //		Array(1081007,3222,"未定义","永久"),//伊丽莎白手套
    Array(1051311,3222,"未定义","永久"),//黑暗力量连身衣(女)
    Array(1051199,3222,"未定义","永久"),//樱花服
    Array(1051173,3222,"未定义","永久"),//条纹淑女连衣裙
    Array(1051118,3222,"未定义","永久"),//粉红可爱游泳服
    Array(1051189,3222,"未定义","永久"),//怦然心动装
    Array(1051233,3222,"未定义","永久"),//车模装
    Array(1052410,3222,"未定义","永久"),//粉嫩花仙裙
    Array(1051350,3222,"未定义","永久"),//派对名媛裙
    Array(1051376,3222,"未定义","永久"),//万圣节机器人裙
    Array(1051375,3222,"未定义","永久"),//欧迪尔芭蕾裙
    Array(1051349,3222,"未定义","永久"),//女妖
    Array(1051387,3222,"未定义","永久"),//春游连衣裙
    Array(1051296,3222,"未定义","永久"),//玩世不恭裙装
    Array(1051295,3222,"未定义","永久"),//魔法裙装
    Array(1051294,3222,"未定义","永久"),//抒情裙装 
    Array(1051192,3222,"未定义","永久"),//海洋裹裹短裙  
    Array(1051160,3222,"未定义","永久"),//裹裹短裙
    Array(1052593,3222,"未定义","永久"),//粉红缎带冰淇淋服
    Array(1051303,3222,"未定义","永久"),//抹胸礼裙
    Array(1051261,3222,"未定义","永久"),//童话幻想
    Array(1052419,3222,"未定义","永久"),//粉娃娃群
    Array(1051180,3222,"未定义","永久"),//水兵服女
    Array(1051363,3222,"未定义","永久"),//开场天使
    Array(1051278,3222,"未定义","永久"),//樱桃雪套服
    Array(1051219,3222,"未定义","永久"),//彩虹mini连衣裙
    //		Array(1051211,3222,"未定义","永久"),//伊丽莎白礼服
    Array(1051221,3222,"未定义","永久"),//圣诞节套服-女
    Array(1051228,3222,"未定义","永久"),//粉红色雪花休闲装
    Array(1051229,3222,"未定义","永久"),//花少女韩服
    Array(1051231,3222,"未定义","永久"),//阿尔卑斯山少女装
    Array(1051232,3222,"未定义","永久"),//闪烁之星女孩礼服
    Array(1052656,3222,"未定义","永久"),//白天鹅芭蕾服
    Array(1051235,3222,"未定义","永久"),//橙色小鸡裙子
    Array(1051252,3222,"未定义","永久"),//粉红天使制服
    Array(1051253,3222,"未定义","永久"),//红帽迷你裙
    Array(1051254,3222,"未定义","永久"),//萝莉学生装
    Array(1052295,3222,"未定义","永久"),//粉红色女仆装
    Array(1052296,3222,"未定义","永久"),//天蓝色女仆装
    Array(1052298,3222,"未定义","永久"),//兔耳洛莉塔套服
    Array(1052225,3222,"未定义","永久"),//暗夜娃娃服
    Array(1052306,3222,"未定义","永久"),//雪姬和服
    Array(1041142,3222,"未定义","永久"),//巨星蛋糕吊带
    Array(1041127,3222,"未定义","永久"),//爱心背心
    Array(1041189,3222,"未定义","永久"),//女牛仔衬衫
    Array(1001076,3222,"未定义","永久"),//樱桃雪水晶
    Array(1001064,3222,"未定义","永久"),//闪耀Girl帽子
    Array(1001083,3222,"未定义","永久"),//爆莉萌天使发卡
    Array(1001044,3222,"未定义","永久"),//绿色婚纱头纱
    //		Array(1001061,3222,"未定义","永久"),//伊丽莎白假发(女)
    Array(1001068,3222,"未定义","永久"),//军团长假发-女
    Array(1001069,3222,"未定义","永久"),//精灵王假发-女
    Array(1001094,3222,"未定义","永久"),//蓝色蕾丝头巾
    Array(1001089,3222,"未定义","永久"),//兔子胡萝卜绒线帽
    Array(1001085,3222,"未定义","永久"),//粉蝴蝶发卡
    Array(1061148,3222,"未定义","永久"),//巨星粉色短裙
    Array(1061001,3222,"未定义","永久"),//蓝超短裙
    Array(1061007,3222,"未定义","永久"),//红超短裙 
    Array(1061126,3222,"未定义","永久"),//白色超短裙
    Array(1061067,3222,"未定义","永久")//热裤
    );

var qltz = Array(
    Array(1042340,2121,"未定义","永久"),//灰喵喵围脖小上衣
	Array(1041194,2121,"未定义","永久"),//粉色兔子T恤
	Array(1041196,2121,"未定义","永久"),//菠萝吊带衫
	Array(1042045,2121,"未定义","永久"),//蓝竖条T恤
	Array(1042052,2121,"未定义","永久"),//蓝贵族滑雪服
	Array(1042060,2121,"未定义","永久"),//黄色高领毛衣
	Array(1042073,2121,"未定义","永久"),//蓝紫色短袖夹克
	Array(1042132,2121,"未定义","永久"),//爱情海蓝T恤
	Array(1042162,2121,"未定义","永久"),//蓝条纹棉背心
	Array(1042166,2121,"未定义","永久"),//摩托夹克
	Array(1042202,2121,"未定义","永久"),//小企企卷边T恤
	Array(1042214,2121,"未定义","永久"),//粉条纹两件套
	Array(1042221,2121,"未定义","永久"),//白色篮球T恤
	
	Array(1042241,2121,"未定义","永久"),//飞翔紫罗兰
	Array(1042240,2121,"未定义","永久"),//霞光短袖T恤
	Array(1042314,2121,"未定义","永久"),//兔熊T恤
	Array(1042330,2121,"未定义","永久"),//露肩baby装
	Array(1042320,2121,"未定义","永久"),//海鸥印花T恤
	Array(1042338,2121,"未定义","永久"),//熊孩子套衫(黄)
    Array(1042355,2121,"未定义","永久"),//然并卵特效T恤
    Array(1042342,2121,"未定义","永久"),//虎脚印马甲
    Array(1042345,2121,"未定义","永久"),//喜羊羊上衣
    Array(1042346,2121,"未定义","永久"),//美羊羊花边裙
    Array(1042347,2121,"未定义","永久"),//小淘气背心
    Array(1042350,2121,"未定义","永久"),//海豚T恤
    Array(1042354,2121,"未定义","永久"),//Duang特效T恤
    Array(1048001,2121,"未定义","永久"),//兔兔情侣衫
    Array(1048002,2121,"未定义","永久"),//胡萝卜情侣衫
    Array(1042319,2121,"未定义","永久"),//俏皮T恤
    Array(1042332,2121,"未定义","永久"),//摇滚喵咪上衣
    Array(1042333,2121,"未定义","永久"),//粉喵喵喵脸上衣
    Array(1042311,2121,"未定义","永久"),//彩糖T恤
    Array(1042279,2121,"未定义","永久"),//训字T恤
    Array(1042280,2121,"未定义","永久"),//民字T恤
    Array(1042281,2121,"未定义","永久"),//正字T恤
    Array(1042282,2121,"未定义","永久"),//音字T恤
    Array(1042285,2121,"未定义","永久"),//拼色点点T恤
    Array(1042138,2121,"未定义","永久"),//银链街头背心
    Array(1042027,2121,"未定义","永久"),//蓝色篮球衫
    Array(1042028,2121,"未定义","永久"),//橙色篮球上衣
    Array(1042336,2121,"未定义","永久"),//微笑玉米衫
    Array(1042337,2121,"未定义","永久")//熊熊春游T
    );

var stxz = Array(
Array(1070024,5000,"未定义","永久"),//怪盗幻影靴子-男款
Array(1070025,5000,"未定义","永久"),//侍女鞋子
Array(1070026,5000,"未定义","永久"),//国庆重靴-男款
Array(1070027,5000,"未定义","永久"),//国庆轻履-男款
Array(1070028,5000,"未定义","永久"),//长青使道花鞋
Array(1070031,5000,"未定义","永久"),//阿尔卑斯少年鞋
Array(1070057,5000,"未定义","永久"),//岩炎拖鞋
Array(1070059,5000,"未定义","永久"),//秋游小黄鞋
Array(1070060,5000,"未定义","永久"),//克里斯多夫鞋子
Array(1070061,5000,"未定义","永久"),//派对王子的玻璃鞋
Array(1070063,5000,"未定义","永久"),//蓝色巴尼兔小皮鞋
Array(1070064,5000,"未定义","永久"),//疯狂医生鞋
Array(1070065,5000,"未定义","永久"),//蓝色马卡龙鞋
Array(1070066,5000,"未定义","永久"),//圣诞鞋
Array(1070067,5000,"未定义","永久"),//仙履鞋
Array(1070068,5000,"未定义","永久"),//王的皮鞋
Array(1070069,5000,"未定义","永久"),//飞翔天空
Array(1070071,5000,"未定义","永久"),//时间先生的鞋子
Array(1070072,5000,"未定义","永久"),//农场主鞋
Array(1070074,5000,"未定义","永久"),//玩具士兵皮靴
Array(1071000,5000,"未定义","永久"),//蓝袜子鞋
Array(1071001,5000,"未定义","永久"),//红袜子鞋
Array(1071002,5000,"未定义","永久"),//绣花鞋
Array(1071003,5000,"未定义","永久"),//圣诞鞋
Array(1071007,5000,"未定义","永久"),//兔兔鞋
Array(1071008,5000,"未定义","永久"),//日式和服鞋
Array(1071009,5000,"未定义","永久"),//高脚登山靴(红)
Array(1071010,5000,"未定义","永久"),//海神紫美夫人鞋子
Array(1071011,5000,"未定义","永久"),//白色高跟礼靴
Array(1071012,5000,"未定义","永久"),//貂蝉鞋子
Array(1071013,5000,"未定义","永久"),//白猫鞋子
Array(1071014,5000,"未定义","永久"),//黑猫鞋子
Array(1071015,5000,"未定义","永久"),//侍女鞋子
Array(1071016,5000,"未定义","永久"),//红长筒靴
Array(1071017,5000,"未定义","永久"),//豹皮鞋
Array(1071018,5000,"未定义","永久"),//虎皮靴
Array(1071019,5000,"未定义","永久"),//玉女鞋
Array(1071020,5000,"未定义","永久"),//公主高跟鞋
Array(1071021,5000,"未定义","永久"),//鬼娃娃鞋
Array(1071026,5000,"未定义","永久"),//巨星潮流靴
Array(1071028,5000,"未定义","永久"),//高脚登山靴
Array(1071030,5000,"未定义","永久"),//闪烁之星女生鞋
Array(1071031,5000,"未定义","永久"),//粉红天使鞋
Array(1071032,5000,"未定义","永久"),//红帽丝带鞋
Array(1071036,5000,"未定义","永久"),//怪盗幻影靴子-女款
Array(1071037,5000,"未定义","永久"),//希纳斯凉鞋
Array(1071042,5000,"未定义","永久"),//国庆重靴-女款
Array(1071043,5000,"未定义","永久"),//国庆轻履-女款
Array(1071044,5000,"未定义","永久"),//粉红淑女花鞋
Array(1071045,5000,"未定义","永久"),//系带高跟鞋
Array(1071048,5000,"未定义","永久"),//阿尔卑斯少女鞋
Array(1071074,5000,"未定义","永久"),//岩炎袜带
Array(1071076,5000,"未定义","永久"),//秋游小黄鞋
Array(1071077,5000,"未定义","永久"),//艾尔莎鞋
Array(1071078,5000,"未定义","永久"),//派对公主的水晶鞋
Array(1071079,5000,"未定义","永久"),//粉色巴尼兔小皮鞋
Array(1071080,5000,"未定义","永久"),//蝴蝶结天使鞋
Array(1071081,5000,"未定义","永久"),//粉色巴卡龙鞋
Array(1071082,5000,"未定义","永久"),//红长统靴
Array(1071083,5000,"未定义","永久"),//仙履鞋
Array(1071084,5000,"未定义","永久"),//女皇的蓝色高跟鞋
Array(1071085,5000,"未定义","永久"),//飞翔云彩
Array(1071086,5000,"未定义","永久"),//星光布鞋
Array(1071087,5000,"未定义","永久"),//莲花学院指定鞋子
Array(1071088,5000,"未定义","永久"),//时间女士的鞋子
Array(1071089,5000,"未定义","永久"),//农场主鞋
Array(1071091,5000,"未定义","永久"),//玩具士皮靴
Array(1072010,5000,"未定义","永久"),//西装皮鞋
Array(1072013,5000,"未定义","永久"),//红色运动鞋
Array(1072014,5000,"未定义","永久"),//大头皮鞋
Array(1072057,5000,"未定义","永久"),//蓝色运动鞋
Array(1072058,5000,"未定义","永久"),//黑色运动鞋
Array(1072088,5000,"未定义","永久"),//金色绒靴
Array(1072098,5000,"未定义","永久"),//蓝色棒球鞋
Array(1072099,5000,"未定义","永久"),//红色棒球鞋
Array(1072100,5000,"未定义","永久"),//黑色棒球鞋
Array(1072218,5000,"未定义","永久"),//翻毛绒靴(蓝)
Array(1072219,5000,"未定义","永久"),//翻毛绒靴(粉)
Array(1072230,5000,"未定义","永久"),//黑拳击鞋
Array(1072231,5000,"未定义","永久"),//蓝拳击鞋
Array(1072232,5000,"未定义","永久"),//红拳击鞋
Array(1072233,5000,"未定义","永久"),//虎爪
Array(1072234,5000,"未定义","永久"),//蓝水灵拖拖
Array(1072235,5000,"未定义","永久"),//绿水灵拖拖
Array(1072256,5000,"未定义","永久"),//熊仔拖
Array(1072257,5000,"未定义","永久"),//狗狗拖
Array(1072258,5000,"未定义","永久"),//白猫拖
Array(1072259,5000,"未定义","永久"),//小鸡拖
Array(1072260,5000,"未定义","永久"),//企鹅拖
Array(1072265,5000,"未定义","永久"),//蓝色足球鞋
Array(1072266,5000,"未定义","永久"),//黑色足球鞋
Array(1072267,5000,"未定义","永久"),//红色足球鞋
Array(1072278,5000,"未定义","永久"),//圣诞鹿拖鞋
Array(1072280,5000,"未定义","永久"),//黄金靴
Array(1072323,5000,"未定义","永久"),//星星凉拖
Array(1072324,5000,"未定义","永久"),//猪猪拖
Array(1072325,5000,"未定义","永久"),//红水灵拖鞋
Array(1072326,5000,"未定义","永久"),//黄水灵拖鞋
Array(1072329,5000,"未定义","永久"),//可爱学生鞋
Array(1072330,5000,"未定义","永久"),//黑色帆布鞋
Array(1072331,5000,"未定义","永久"),//比克罗休闲鞋
Array(1072332,5000,"未定义","永久"),//黑色乖乖女鞋
//Array(1075000,5000,"未定义","永久"),//绿色帆布鞋
Array(1072334,5000,"未定义","永久"),//红色帆布鞋
Array(1072335,5000,"未定义","永久"),//时尚雪地靴(灰)
Array(1072336,5000,"未定义","永久"),//足球钉鞋
Array(1072337,5000,"未定义","永久"),//喜洋洋拖鞋
Array(1072341,5000,"未定义","永久"),//橘黄色方纹帆布鞋
Array(1072347,5000,"未定义","永久"),//轻便跑鞋
Array(1072349,5000,"未定义","永久"),//果绿色方纹帆布鞋
Array(1072350,5000,"未定义","永久"),//变身用黑铁头鞋
Array(1072351,5000,"未定义","永久"),//变身用天使鞋
Array(1072352,5000,"未定义","永久"),//变色用红棉丝鞋
Array(1072353,5000,"未定义","永久"),//变身用白忍者凉鞋
Array(1072354,5000,"未定义","永久"),//变身用杨波
Array(1072367,5000,"未定义","永久"),//可爱小绵羊鞋鞋
Array(1072370,5000,"未定义","永久"),//佳佳小皮鞋
Array(1072371,5000,"未定义","永久"),//蓝风跑鞋
Array(1072373,5000,"未定义","永久"),//炫紫彩虹鞋
Array(1072374,5000,"未定义","永久"),//蕾丝边长靴
Array(1072377,5000,"未定义","永久"),//卑鄙的狼鞋子
Array(1072378,5000,"未定义","永久"),//cosplay长靴
Array(1072379,5000,"未定义","永久"),//青黄彩虹鞋
Array(1072381,5000,"未定义","永久"),//战神的皮靴
Array(1072382,5000,"未定义","永久"),//勇猛的士兵靴
Array(1072385,5000,"未定义","永久"),//纯白拖鞋
Array(1072386,5000,"未定义","永久"),//黑色木拖
Array(1072387,5000,"未定义","永久"),//红色木拖
Array(1072388,5000,"未定义","永久"),//女仆礼鞋
Array(1072392,5000,"未定义","永久"),//粉红礼鞋
Array(1072394,5000,"未定义","永久"),//糖果雨鞋
Array(1072395,5000,"未定义","永久"),//双色帆布鞋
Array(1072404,5000,"未定义","永久"),//炼金术士短靴
Array(1072406,5000,"未定义","永久"),//阿尔冯斯钢铁战靴
Array(1072407,5000,"未定义","永久"),//kitty拖
Array(1072408,5000,"未定义","永久"),//枫叶赛车手鞋
Array(1072417,5000,"未定义","永久"),//小丑鞋
Array(1072433,5000,"未定义","永久"),//中国娃娃绣花鞋
Array(1072437,5000,"未定义","永久"),//PB拖拖
Array(1072438,5000,"未定义","永久"),//小嫩叶鞋
Array(1072439,5000,"未定义","永久"),//采草莓礼鞋
Array(1072440,5000,"未定义","永久"),//灰蒙蒙猫肉垫
Array(1072441,5000,"未定义","永久"),//暗影双刀鞋子
Array(1072443,5000,"未定义","永久"),//龙神短靴
Array(1072444,5000,"未定义","永久"),//胡克的船长靴
Array(1072448,5000,"未定义","永久"),//皇家彩虹靴
Array(1072454,5000,"未定义","永久"),//奥兹的魔法靴
Array(1072457,5000,"未定义","永久"),//运动版休闲拖
Array(1072461,5000,"未定义","永久"),//唤灵斗师靴子
Array(1072462,5000,"未定义","永久"),//豹弩游侠靴子
Array(1072464,5000,"未定义","永久"),//战斗修女靴
Array(1072466,5000,"未定义","永久"),//学院优等生鞋子
Array(1072467,5000,"未定义","永久"),//飞行猫猫靴子
Array(1072468,5000,"未定义","永久"),//蝴蝶结娃娃鞋
Array(1072469,5000,"未定义","永久"),//粉色条纹鞋
Array(1072470,5000,"未定义","永久"),//天蓝条纹鞋
Array(1072478,5000,"未定义","永久"),//福尔摩斯鞋子
Array(1072482,5000,"未定义","永久"),//熊猫拖
Array(1072483,5000,"未定义","永久"),//白色登山鞋
Array(1072484,5000,"未定义","永久"),//黑猫拖鞋
Array(1072507,5000,"未定义","永久"),//银色脚链
Array(1072509,5000,"未定义","永久"),//红丝带鞋
Array(1072514,5000,"未定义","永久"),//天使翅膀帆布鞋
Array(1072515,5000,"未定义","永久"),//狮子宝宝拖
Array(1072516,5000,"未定义","永久"),//新手小鸡拖鞋
Array(1072517,5000,"未定义","永久"),//天使羽翼
Array(1072529,5000,"未定义","永久"),//粉红大象拖鞋
Array(1072531,5000,"未定义","永久"),//考拉拖鞋
Array(1072536,5000,"未定义","永久"),//谢丽尔靴子
Array(1072537,5000,"未定义","永久"),//克洛乌靴子
Array(1072609,5000,"未定义","永久"),//粉红皮靴
Array(1072613,5000,"未定义","永久"),//西部牛仔靴
Array(1072622,5000,"未定义","永久"),//奥尔卡黑色之翼靴
Array(1072627,5000,"未定义","永久"),//军团长的靴子
Array(1072628,5000,"未定义","永久"),//精灵王的靴子
Array(1072633,5000,"未定义","永久"),//红色运动板鞋
Array(1072637,5000,"未定义","永久"),//魔族高贵靴子
Array(1072646,5000,"未定义","永久"),//精灵精神靴
Array(1072647,5000,"未定义","永久"),//热血高校皮鞋
Array(1072648,5000,"未定义","永久"),//魔法学院皮鞋
Array(1072649,5000,"未定义","永久"),//武陵道场鞋
Array(1072650,5000,"未定义","永久"),//海龙靴
Array(1072651,5000,"未定义","永久"),//炎龙靴
Array(1072652,5000,"未定义","永久"),//银河战队靴子
Array(1072659,5000,"未定义","永久"),//战斗修女靴
Array(1072662,5000,"未定义","永久"),//露西亚运动鞋
Array(1072663,5000,"未定义","永久"),//蓝色天使鞋
Array(1072676,5000,"未定义","永久"),//阴阳师的鞋子
Array(1072680,5000,"未定义","永久"),//阿拉伯鞋子(男)
Array(1072681,5000,"未定义","永久"),//阿拉伯鞋子(女)
Array(1072708,5000,"未定义","永久"),//凉爽夏日脚蹼
Array(1072729,5000,"未定义","永久"),//银河牛仔靴
Array(1072742,5000,"未定义","永久"),//猫咪脚掌
Array(1072748,5000,"未定义","永久"),//异国风情庆典鞋
Array(1072749,5000,"未定义","永久"),//泡泡巧克力鞋子
Array(1072750,5000,"未定义","永久"),//剑豪的鞋子
Array(1072756,5000,"未定义","永久"),//超级小猫拖鞋
Array(1072760,5000,"未定义","永久"),//喵喵鞋
Array(1072770,5000,"未定义","永久"),//黑暗小恶魔鞋子
Array(1072771,5000,"未定义","永久"),//蛇年嘻哈鞋
Array(1072778,5000,"未定义","永久"),//黑暗力量靴
Array(1072779,5000,"未定义","永久"),//圣洁天使拖
Array(1072780,5000,"未定义","永久"),//蓝绸带猫咪鞋
Array(1072781,5000,"未定义","永久"),//猫咪鞋子
Array(1072782,5000,"未定义","永久"),//尖兵尼奥鞋子
Array(1072783,5000,"未定义","永久"),//斯乌黑色之翼鞋
Array(1072800,5000,"未定义","永久"),//高尔夫球鞋
Array(1072803,5000,"未定义","永久"),//小恐龙云豆爪爪
Array(1072808,5000,"未定义","永久"),//软软绵羊拖鞋
Array(1072809,5000,"未定义","永久"),//废都高校皮鞋
Array(1072810,5000,"未定义","永久"),//魔法密林魔法学校鞋
Array(1072811,5000,"未定义","永久"),//武陵道馆运动鞋
Array(1072816,5000,"未定义","永久"),//女妖鞋子
Array(1072817,5000,"未定义","永久"),//Blavy天使鞋
Array(1072820,5000,"未定义","永久"),//明星熊仔鞋
Array(1072821,5000,"未定义","永久"),//金铃派对鞋
Array(1072823,5000,"未定义","永久"),//高尔夫运动鞋
Array(1072830,5000,"未定义","永久"),//GM队长的露西娅运动鞋
Array(1072831,5000,"未定义","永久"),//波比短靴
Array(1072836,5000,"未定义","永久"),//垒球鞋
Array(1072841,5000,"未定义","永久"),//真.生命鞋子
Array(1072842,5000,"未定义","永久"),//真.破灭鞋子
Array(1072843,5000,"未定义","永久"),//泡泡拖
Array(1072848,5000,"未定义","永久"),//血腥吊带袜
Array(1072851,5000,"未定义","永久"),//葡萄拖
Array(1072852,5000,"未定义","永久"),//超级明星鞋
Array(1072856,5000,"未定义","永久"),//灵魂熊保暖靴
Array(1072860,5000,"未定义","永久"),//明星闪耀
Array(1072862,5000,"未定义","永久"),//闪购拖鞋
Array(1072863,5000,"未定义","永久"),//勃肯拖鞋
Array(1072866,5000,"未定义","永久"),//巧可羊鞋子
Array(1072867,5000,"未定义","永久"),//小绵羊朵朵玩偶鞋
Array(1072868,5000,"未定义","永久"),//制服皮鞋
Array(1072869,5000,"未定义","永久"),//时间旅行者的高跟鞋
Array(1072871,5000,"未定义","永久"),//万圣节机器人皮鞋
Array(1072876,5000,"未定义","永久"),//卡卡奥熊掌鞋
Array(1072877,5000,"未定义","永久"),//黑暗小恶魔鞋
Array(1072878,5000,"未定义","永久"),//万圣节幻影鞋子
Array(1072888,5000,"未定义","永久"),//烈焰战靴
Array(1072889,5000,"未定义","永久"),//蛇纹运动鞋
Array(1072890,5000,"未定义","永久"),//K君的猫咪垫
Array(1072895,5000,"未定义","永久"),//绿猫猫短靴
Array(1072896,5000,"未定义","永久"),//红猫猫短靴
Array(1072897,5000,"未定义","永久"),//蓝色鹿皮鞋
Array(1072900,5000,"未定义","永久"),//雪之女神短靴
Array(1072901,5000,"未定义","永久"),//五彩珠鞋
Array(1072908,5000,"未定义","永久"),//邦尼翼靴
Array(1072909,5000,"未定义","永久"),//紫色炫彩情侣鞋
Array(1072910,5000,"未定义","永久"),//可可熊鞋
Array(1072911,5000,"未定义","永久"),//萧清者靴
Array(1072916,5000,"未定义","永久"),//林之灵鞋子
Array(1072917,5000,"未定义","永久"),//小马马乖乖鞋
Array(1072918,5000,"未定义","永久"),//粉红蝴蝶鞋
Array(1072919,5000,"未定义","永久"),//蓝色蝴蝶鞋
Array(1072920,5000,"未定义","永久"),//僵尸新娘高跟鞋
Array(1072921,5000,"未定义","永久"),//幻夜碟华的皱褶皮鞋
Array(1072922,5000,"未定义","永久"),//大厨鞋
Array(1072923,5000,"未定义","永久"),//波点娃娃鞋
Array(1072924,5000,"未定义","永久"),//未来天使靴
Array(1072925,5000,"未定义","永久"),//未来医生靴子
Array(1072930,5000,"未定义","永久"),//柴郡猫短靴
Array(1072931,5000,"未定义","永久"),//爱丽丝鞋子
Array(1072934,5000,"未定义","永久"),//彩虹运动鞋
Array(1072941,5000,"未定义","永久"),//机械兔靴
Array(1072942,5000,"未定义","永久"),//海鸥拖拖鞋
Array(1072943,5000,"未定义","永久"),//哼唱旋律的舞鞋
Array(1072944,5000,"未定义","永久"),//暗夜精灵战靴
Array(1072945,5000,"未定义","永久"),//隐武士战靴
Array(1072949,5000,"未定义","永久"),//红色小马运动鞋
Array(1072950,5000,"未定义","永久"),//蓝色小马运动鞋
Array(1072951,5000,"未定义","永久"),//呼啦呼啦串珠手链
Array(1072978,5000,"未定义","永久"),//闪耀唐鞋
Array(1072998,5000,"未定义","永久"),//兔熊拖鞋
Array(1072999,5000,"未定义","永久"),//蝴蝶结红皮鞋
Array(1073009,5000,"未定义","永久"),//农场小皮靴
Array(1073011,5000,"未定义","永久"),//拉拉队长鞋
Array(1073012,5000,"未定义","永久"),//羊绒雪地靴
Array(1073013,5000,"未定义","永久"),//嫩黄小熊鞋
Array(1073014,5000,"未定义","永久"),//粉红小熊鞋
Array(1073022,5000,"未定义","永久"),//蓝色喵喵球鞋
Array(1073023,5000,"未定义","永久"),//灰色喵喵球鞋
Array(1073024,5000,"未定义","永久"),//红色圣诞小皮鞋
Array(1073027,5000,"未定义","永久"),//立体机动装置
Array(1073036,5000,"未定义","永久"),//蓝鸟鞋
Array(1073037,5000,"未定义","永久"),//小兔兔短靴
Array(1073039,5000,"未定义","永久"),//可爱小绵羊鞋子
Array(1073040,5000,"未定义","永久"),//啵啵鼠鞋
Array(1073041,5000,"未定义","永久"),//黑色马丁靴
Array(1073046,5000,"未定义","永久"),//喜洋洋拖
Array(1073047,5000,"未定义","永久"),//美羊羊拖
Array(1073056,5000,"未定义","永久"),//小花仙拖鞋
Array(1073058,5000,"未定义","永久"),//小淘气鞋子
Array(1073059,5000,"未定义","永久"),//黑猫鞋子
Array(1073060,5000,"未定义","永久"),//贵族花纹鞋
Array(1073061,5000,"未定义","永久"),//分红花纹鞋子
Array(1073062,5000,"未定义","永久"),//小白兔高跟鞋
Array(1073074,5000,"未定义","永久"),//海贼团皮鞋
Array(1073075,5000,"未定义","永久"),//薄荷猫拖鞋
Array(1073076,5000,"未定义","永久"),//星光布鞋
Array(1073078,5000,"未定义","永久"),//枫叶翅膀鞋子
Array(1073079,5000,"未定义","永久"),//果冻鞋
Array(1073080,5000,"未定义","永久"),//海贼团皮鞋
Array(1073084,5000,"未定义","永久"),//超能力者皮鞋
Array(1073088,5000,"未定义","永久"),//蓝鸟拖拖
Array(1073090,5000,"未定义","永久"),//白色乌鲁斯拖鞋
Array(1073091,5000,"未定义","永久"),//棕色乌鲁斯拖鞋
Array(1073092,5000,"未定义","永久"),//黑色乌鲁斯拖鞋
Array(1073098,5000,"未定义","永久"),//北极雪橇靴
Array(1073105,5000,"未定义","永久"),//我的球鞋
Array(1073109,5000,"未定义","永久"),//风神的鞋子
Array(1073129,5000,"未定义","永久")//暖绒绒鞋子
    );

var pets = Array(
     Array(5000077,9999,"未定义","90天"),//波斯猫
     Array(5000256,9999,"未定义","90天"),//南瓜杰克
	 Array(5000261,9999,"未定义","90天"),//潮流兔子
	 Array(5000264,9999,"未定义","90天"),//跳跳袋鼠
	 Array(5000274,9999,"未定义","90天"),//豆豆蛇
	 Array(5000285,9999,"未定义","90天"),//鱼尾狮
	 Array(5000290,9999,"未定义","90天"),//天使提尔
	 Array(5000052,9999,"未定义","90天"),//机器人(金色)
	 Array(5000094,9999,"未定义","90天"),//稀有粉雪人
	 Array(5000096,9999,"未定义","90天"),//稀有白色小象
	 Array(5000221,9999,"未定义","90天"),//小海豹
	 Array(5000288,9999,"未定义","90天"),//半半
	 Array(5000289,9999,"未定义","90天"),//皮埃尔
	 Array(5000013,9999,"未定义","90天"),//大象
	 Array(5000017,9999,"未定义","90天"),//机器人
	 Array(5000022,9999,"未定义","90天"),//火鸡
	 Array(5000072,9999,"未定义","90天"),//臭鼬
	 Array(5000081,9999,"未定义","90天"),//飞行小鲸鱼
	 Array(5000205,9999,"未定义","90天"),//猩猩崩克
	 Array(5000217,9999,"未定义","90天"),//黑暗灵魂
	 Array(5000227,9999,"未定义","90天"),//小鲨鱼
	 Array(5000324,9999,"未定义","90天"),//火柴人宠物
	 Array(5000214,9999,"未定义","90天"),//雷黄小恶魔
	 Array(5000251,9999,"未定义","90天"),//蓝小熊
	 Array(5000268,9999,"未定义","90天")//甜心蝴蝶
);
	
	
var status = -1;
var xx = -1;
var jiage = -1;

function start() {
    action(1, 0, 0);
}


function action(mode, type, selection) {
    //cm.getPlayer().dropMessage("mode ： "+ mode + " status : "+  status + " sel: " + selection);
    if (mode == -1) {
        cm.sendOk("#b好的,下次再见.");
        cm.dispose();
    } else {
        if (mode == 0) {
            cm.sendOk("#b好的,下次再见.");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        } else {
            status--;
        }var MC = cm.getServerName();
         var 箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
		 var ca = java.util.Calendar.getInstance();

        //---------------------------------------------------------------------------------

        if (status == 0) {
			
            var 
			add = "  #i5000324##i5000324##i5000324##i5000324##i5000324##i5000324##i5000324##i5000324##i5000324##i5000324#\r\n#l";
			add += "            - #r "+MC+"时装贩卖#k - \n\r\n";
            
		   
		    
            add += "               #e#L0##b"+箭头+" 欢迎光临\r\n#l";
			add += "             #L999##b"+箭头+" 退出商城#l\r\n\r\n\r\n\r\n";
			
			add += "           #n#k【点券余额：#r"+cm.getPlayer().getCSPoints(1)+"#n#k】";
            cm.sendSimple (add);  
        ///////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 1) {
            if (selection == 0) {
                var add = " - #e欢迎来到#r"+MC+"#k,时装贩卖区#n - .\r\n\r\n";
               
                add += " - 当前余额:#r" + cm.getChar().getCSPoints(1) + "#k\r\n\r\n#b";
                add += "#L0#"+箭头+"返回界面 -   \r\n\r\n";
				add += "#L1#"+箭头+"套服衣裤";
                add += "#L2#"+箭头+"名片戒指";
                //		add += "#L3#本周推荐";
                add += "#L4#"+箭头+"皇家极光";
                add += "#L5#"+箭头+"耳环裤子\r\n\r\n";
                add += "#L6#"+箭头+"精品武器";
                add += "#L7#"+箭头+"精美披风";
                add += "#L8#"+箭头+"精品帽子\r\n\r\n";
                //add += "#L9#"+箭头+"炫酷坐骑\r\n\r\n";
                //	add += "#L10#皇家发型";
                add += "#L13#"+箭头+"精品上衣";
                add += "#L12#"+箭头+"精品女装";
                add += "#L14#"+箭头+"精品鞋子";
				add += "#L15#"+箭头+"宠物圈子\r\n\r\n";
                cm.sendSimple (add,2);   
            }  else if (selection == 999) {
              cm.dispose();
            cm.openNpc(9900007,300);}	
        //////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 2) {
			if (selection == 0) {
			
			 cm.dispose();
            cm.openNpc(9900007,300);
			
			
          } else  if (selection == 1) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jmsz.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jmsz[i][0] + "##z" + jmsz[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jmsz[i][1] + " #d    使用期限:#r " + jmsz[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   

                xx = 1

            } else if (selection == 2) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jzmp.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jzmp[i][0] + "##z" + jzmp[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jzmp[i][1] + " #d    使用期限:#r " + jzmp[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 2
            } else if (selection == 3) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
             
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";
                for (var i = 0; i < tjId.length; i++) {
                    add += "\r\n#L" + i + "##v" + tjId[i][0] + "##z" + tjId[i][0] + "##l#d\r\n\r\n		";   
                    add += "需要点卷:#r " + tjId[i][1] + " #d    使用期限:#r " + tjId[i][3] + "#k#b";
                }
                cm.sendSimple (add,2);   
                xx = 3;
            } else if (selection == 4) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";
                for (var i = 0; i < syxh.length; i++) {
                    add += "\r\n#L" + i + "##v" + syxh[i][0] + "##z" + syxh[i][0] + "##l#d\r\n\r\n		";   
                    add += "需要点卷:#r " + syxh[i][1] + " #d    购买数量:#r " + syxh[i][3] + "#k#b";
                }
                cm.sendSimple (add,2);   
                xx = 4;
            } else if (selection == 5) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";
                for (var i = 0; i < xswp.length; i++) {	
                    add += "\r\n#L" + i + "##v" + xswp[i][0] + "##z" + xswp[i][0] + "##l#d\r\n\r\n		";   
                    add += "需要点卷:#r " + xswp[i][1] + " #d    购买数量:#r " + xswp[i][2] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 5
            } else  if (selection == 6) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jmwq.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jmwq[i][0] + "##z" + jmwq[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jmwq[i][1] + " #d    使用期限:#r " + jmwq[i][3] + "#k#b";
                }
                cm.sendSimple (add,2);   
                xx = 6
            } else  if (selection == 7) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
              
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jmpf.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jmpf[i][0] + "##z" + jmpf[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jmpf[i][1] + " #d    使用期限:#r " + jmpf[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 7
            } else  if (selection == 8) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jmmz.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jmmz[i][0] + "##z" + jmmz[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jmmz[i][1] + " #d    使用期限:#r " + jmmz[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 8
            } else  if (selection == 9) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
              
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < jmsp.length; i++) {	
                    add += "\r\n#L" + i + "##v" + jmsp[i][0] + "##z" + jmsp[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + jmsp[i][1] + " #d    使用期限:#r " + jmsp[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 9
            } else  if (selection == 10) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
              
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";
                for (var i = 0; i < qtwp.length; i++) {
                    add += "\r\n#L" + i + "##v" + qtwp[i][0] + "##z" + qtwp[i][0] + "##l#d\r\n\r\n		";   
                    add += "需要点卷:#r " + qtwp[i][1] + " #d    购买数量:#r " + qtwp[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 10
            } else  if (selection == 11) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < gfs.length; i++) {	
                    add += "\r\n#L" + i + "##v" + gfs[i][0] + "##z" + gfs[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + gfs[i][1] + " #d    使用期限:#r " + gfs[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 11;
            } else  if (selection == 12) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
              
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < ns.length; i++) {	
                    add += "\r\n#L" + i + "##v" + ns[i][0] + "##z" + ns[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + ns[i][1] + " #d    使用期限:#r " + ns[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 12;
            } else  if (selection == 13) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < qltz.length; i++) {	
                    add += "\r\n#L" + i + "##v" + qltz[i][0] + "##z" + qltz[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + qltz[i][1] + " #d    使用期限:#r " + qltz[i][3] + "#k#b";
                }		
                cm.sendSimple (add,2);   
                xx = 13;
            } else  if (selection == 14) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
              
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < stxz.length; i++) {	
                    add += "\r\n#L" + i + "##v" + stxz[i][0] + "##z" + stxz[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + stxz[i][1] + " #d    使用期限:#r " + stxz[i][3] + "#k#b";
                }		
                cm.sendSimple (add);   
                xx = 14;
            } else  if (selection == 15) {
                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n#r请注意宠物不一定全有技能,别还需要打技能\r\n请考虑之后妥善购买\r\n\r\n";
               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";
                for (var i = 0; i < pets.length; i++) {	
                    add += "\r\n#L" + i + "##v" + pets[i][0] + "##z" + pets[i][0] + "##l#d\r\n\r\n		";
                    add += "需要点卷:#r " + pets[i][1] + " #d    使用期限:#r " + pets[i][3] + "#k#b";
                }		
                cm.sendSimple (add);   
                xx = 15;
            }

        ////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 3) {

            if (xx == 1) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsz[selection][0] + "# #z" + jmsz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsz[selection][1] + " #d    使用期限:#r " + jmsz[selection][3] + "\r\n                              ";

                add += "   #L1#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 2) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jzmp[selection][0] + "# #z" + jzmp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jzmp[selection][1] + " #d    使用期限:#r " + jzmp[selection][3] + "\r\n                              ";

                add += "   #L2#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 3) {	

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";
               

                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + tjId[selection][0] + "# #z" + tjId[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + tjId[selection][1] + " #d    使用期限:#r " + tjId[selection][3] + "\r\n                              ";

                add += "   #L3#立即购买#l";

                cm.sendSimple (add,2);  

                jiage = selection; 


            }

            if (xx == 4) {	

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               
                add += "   当前余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + syxh[selection][0] + "# #z" + syxh[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + syxh[selection][1] + " #d    购买数量:#r " + syxh[selection][3] + "\r\n                              ";

                add += "   #L4#立即购买#l";

                cm.sendSimple (add,2);  

                jiage = selection; 


            }

            if (xx == 5) {	

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

              

                add += "   物品:#v" + xswp[selection][0] + "# #z" + xswp[selection][0] + "##k\r\n\r\n";

                add += "   需要点卷:#r" + xswp[selection][1] + " #d        使用期限:#r " + xswp[selection][2] + "\r\n";

                add += "   #L5#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;


            }


            if (xx == 6) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

              

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmwq[selection][0] + "# #z" + jmwq[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmwq[selection][1] + " #d    使用期限:#r " + jmwq[selection][3] + "\r\n                              ";

                add += "   #L6#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 7) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmpf[selection][0] + "# #z" + jmpf[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmpf[selection][1] + " #d    使用期限:#r " + jmpf[selection][3] + "\r\n                              ";

                add += "   #L7#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }


            if (xx == 8) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmmz[selection][0] + "# #z" + jmmz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmmz[selection][1] + " #d    使用期限:#r " + jmmz[selection][3] + "\r\n                              ";

                add += "   #L8#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 9) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

                

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsp[selection][0] + "# #z" + jmsp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsp[selection][1] + " #d    使用期限:#r " + jmsp[selection][3] + "\r\n                              ";

                add += "   #L9#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 10) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qtwp[selection][0] + "# #z" + qtwp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qtwp[selection][1] + " #d    使用期限:#r " + qtwp[selection][3] + "\r\n                              ";

                add += "   #L10#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 11) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

              

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + gfs[selection][0] + "# #z" + gfs[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + gfs[selection][1] + " #d    使用期限:#r " + gfs[selection][3] + "\r\n                              ";

                add += "   #L11#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 12) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + ns[selection][0] + "# #z" + ns[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + ns[selection][1] + " #d    使用期限:#r " + ns[selection][3] + "\r\n                              ";

                add += "   #L12#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 13) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

                

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qltz[selection][0] + "# #z" + qltz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qltz[selection][1] + " #d    使用期限:#r " + qltz[selection][3] + "\r\n                              ";

                add += "   #L13#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }

            if (xx == 14) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + stxz[selection][0] + "# #z" + stxz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + stxz[selection][1] + " #d    使用期限:#r " + stxz[selection][3] + "\r\n                              ";

                add += "   #L14#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }
            if (xx == 15) {

                var add = "欢迎来到#r"+MC+"#k,时装贩卖区 - .\r\n\r\n";

               

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + pets[selection][0] + "# #z" + pets[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + pets[selection][1] + " #d    使用期限:#r " + pets[selection][3] + "\r\n                              ";

                add += "   #L15#立即购买#l";

                cm.sendSimple (add,2);

                jiage = selection;

            }
        ///////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 4) {


            if (selection == 1) {
                if (cm.getPlayer().getCSPoints(1) >= jmsz[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jmsz[jiage][1]);	
                        if (jmsz[jiage][2] != "未定义") {
                            cm.gainItem(jmsz[jiage][0], 1, jmsz[jiage][2]);
                        } else {
                            cm.gainItem(jmsz[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }


            } else if (selection == 2) {
                if (cm.getPlayer().getCSPoints(1) >= jzmp[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jzmp[jiage][1]);	
                        if (jzmp[jiage][2] != "未定义") {
                            cm.gainItem(jzmp[jiage][0], 1, jzmp[jiage][2]);
                        } else {
                            cm.gainItem(jzmp[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }


            } else if (selection == 3) {
                if (cm.getPlayer().getCSPoints(1) >= tjId[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else { 
                        cm.gainNX(-tjId[jiage][1]);	
                        var ii = MapleItemInformationProvider.getInstance();
                        var type = ii.getInventoryType(tjId[jiage][0]);
                        var toDrop = ii.randomizeStats(ii.getEquipById(tjId[jiage][0])).copy();
                        var temptime = (java.lang.System.currentTimeMillis() + tjId[jiage][4]); 
                        toDrop.setExpiration(temptime);
                        toDrop.setLocked(1);	
                        cm.getInventory(type).addItem(toDrop);
                        cm.getC().getSession().write(MaplePacketCreator.addInventorySlot(type, toDrop)); 
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您没有足够的抵用卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 4) {
                if (cm.getPlayer().getCSPoints(1) >= syxh[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-syxh[jiage][1]);		
                        if (syxh[jiage][2] != "未定义") {
                            cm.gainItem(syxh[jiage][0], syxh[jiage][3], syxh[jiage][2]);
                        } else {
                            cm.gainItem(syxh[jiage][0],syxh[jiage][3]);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您没有足够的抵用卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }


            } else if (selection == 5) {
                if (cm.getPlayer().getCSPoints(1) >= xswp[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-xswp[jiage][1]);
                        var ii = MapleItemInformationProvider.getInstance();
                        var type = ii.getInventoryType(xswp[jiage][0]);
                        var toDrop = ii.randomizeStats(ii.getEquipById(xswp[jiage][0])).copy();
                        var temptime = (java.lang.System.currentTimeMillis() + xswp[jiage][3]); 
						if (xswp[jiage][3] != "永久") {
							toDrop.setExpiration(temptime);
						}
                      //  toDrop.setLocked(1);	
                        cm.getPlayer().getInventory(type).addItem(toDrop);
                        cm.getC().getSession().write(MaplePacketCreator.addInventorySlot(type, toDrop)); 
					    cm.getC().getSession().write(MaplePacketCreator.getShowItemGain(xswp[jiage][0], 1, true));
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您没有足够的抵用卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 6) {
                if (cm.getPlayer().getCSPoints(1) >= jmwq[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jmwq[jiage][1]);	
                        if (jmwq[jiage][2] != "未定义") {
                            cm.gainItem(jmwq[jiage][0], 1, jmwq[jiage][2]);
                        } else {
                            cm.gainItem(jmwq[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }


            } else if (selection == 7) {
                if (cm.getPlayer().getCSPoints(1) >= jmpf[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jmpf[jiage][1]);	
                        if (jmpf[jiage][2] != "未定义") {
                            cm.gainItem(jmpf[jiage][0], 1, jmpf[jiage][2]);
                        } else {
                            cm.gainItem(jmpf[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }

            } else if (selection == 8) {
                if (cm.getPlayer().getCSPoints(1) >= jmmz[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jmmz[jiage][1]);	
                        if (jmmz[jiage][2] != "未定义") {
                            cm.gainItem(jmmz[jiage][0], 1, jmmz[jiage][2]);
                        } else {
                            cm.gainItem(jmmz[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }

            } else if (selection == 9) {
                if (cm.getPlayer().getCSPoints(1) >= jmsp[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-jmsp[jiage][1]);	
                        if (jmsp[jiage][2] != "未定义") {
                            cm.gainItem(jmsp[jiage][0], 1, jmsp[jiage][2]);
                        } else {
                            cm.gainItem(jmsp[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }


            } else if (selection == 10) {
                if (cm.getPlayer().getCSPoints(1) >= qtwp[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-qtwp[jiage][1]);	
                        if (syxh[jiage][2] != "未定义") {
                            cm.gainItem(syxh[jiage][0],syxh[jiage][3], syxh[jiage][2]);
                        } else {
                            cm.gainItem(syxh[jiage][0], syxh[jiage][3]);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您没有足够的抵用卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }



            } else if (selection == 11) {
                if (cm.getPlayer().getCSPoints(1) >= gfs[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-gfs[jiage][1]);	
                        if (gfs[jiage][2] != "未定义") {
                            cm.gainItem(gfs[jiage][0],1, gfs[jiage][2]);
                        } else {
                            cm.gainItem(gfs[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }


            } else if (selection == 12) {
                if (cm.getPlayer().getCSPoints(1) >= ns[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-ns[jiage][1]);
                        if (ns[jiage][2] != "未定义") {
                            cm.gainItem(ns[jiage][0],1, ns[jiage][2]);
                        } else {
                            cm.gainItem(ns[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }

            } else if (selection == 13) {
                if (cm.getPlayer().getCSPoints(1) >= qltz[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-qltz[jiage][1]);	
                        if (qltz[jiage][2] != "未定义") {
                            cm.gainItem(qltz[jiage][0],1, qltz[jiage][2]);
                        } else {
                            cm.gainItem(qltz[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }

            } else if (selection == 14) {
                if (cm.getPlayer().getCSPoints(1) >= stxz[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else {
                        cm.gainNX(-stxz[jiage][1]);		
                        if (stxz[jiage][2] != "未定义") {
                            cm.gainItem(stxz[jiage][0],1, stxz[jiage][2]);
                        } else {
                            cm.gainItem(stxz[jiage][0], 1);
                        }
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }
            } else if (selection == 15) {
                if (cm.getPlayer().getCSPoints(1) >= pets[jiage][1]) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#b请保证装备栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#b请保证消耗栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#b请保证设置栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#b请保证其他栏位至少有2个空格,否则无法购买.");
                        cm.dispose();
						
                    } else {
                        cm.gainNX(-pets[jiage][1]);		
						cm.gainPet(pets[jiage][0], "", 1, 0, 100, 90);
                        cm.sendOk("成功购买，已经放入你的背包。");
                        cm.dispose();
                    }
                } else {
                    cm.sendOk("#b您的点券不够啊？");
                    cm.dispose();
                }
            }
			
        }
    }

}
