\u5305\u5934\u6587\u4ef6\u6253\u5305\u5165\u9879\u76eeclass\u4e2d\u221a
\u4fee\u590d\u5750\u8239\u7684EFFECT\u7279\u6548\uff0c\u5c01\u5305\u5305\u5934\u5199\u9519\u4e86\u221a
\u4fee\u590dPLAYER_UPDATE\u9000\u51fa\u6e38\u620f\u65f6\u5019\u62a5\u9519\u95ee\u9898\uff0c\u5e76\u4e14\u68c0\u6d4b\u662f\u5426\u80fd\u4fdd\u5b58\u89d2\u8272\u6570\u636e \u53ea\u9488\u5bf9 PLAYER_UPDATE \u8fd9\u4e2a\u5c01\u5305 \u8bbe\u7f6e3\u5206\u949f\u4fdd\u5b58 \u4ee5\u514d\u9891\u7e41\u7684\u4fdd\u5b58\u6570\u636e\u221a
\u6dfb\u52a0\u804a\u5929\u7a97\u663e\u793a\u9ec4\u8272\u5b57\u4f53YELLOW_CHAT send \u5305\u5934 0x4E
\u6dfb\u52a0\u9009\u533a\u65f6\u5019\uff0c\u80cc\u666f\u51fa\u73b03\u4e2a\u6c14\u6ce1.\u4ee5\u7ed1\u5b9a\u7248\u6743\u4fe1\u606f\u221a
\u4fee\u590d\u7269\u54c1\u79fb\u52a8\uff0c\u9f20\u6807\u62d6\u52a8\u540c\u6837\u7684\u7269\u54c1\uff0c\u4f1a\u628a\u539f\u7269\u54c1\u8986\u76d6\u6389\u221a
\u4fee\u590d\u4e22\u6361\u590d\u5236BUG\uff0c\u8bbe\u5b9a\u4e22\u51fa\u9053\u5177\u65f6\u95f4\u95f4\u9694\u4f4e\u4e8e1\u79d2\u5f39\u7a97\u63d0\u793a\u963b\u6b62\u4e22\u51fa\u221a
\u4fee\u590d\u9053\u5177\u96c6\u5408,\u4e0d\u8db3\u4e00\u7ec4\u7684\u96c6\u5408\u6210\u4e00\u7ec4\u221a
\u4fee\u590d\u9053\u5177\u6392\u5e8f\uff0c\u4ee5\u79cd\u7c7b\u6392\u5e8f\u221a
\u6dfb\u52a0\u7279\u6b8a\u680f\u7981\u6b62\u4ee5\u79cd\u7c7b\u6392\u5e8f\u529f\u80fd\u221a
\u4fee\u590d\u6709\u4e9b\u88c5\u5907\u7684\u5c5e\u6027\u662f\u201c\u88c5\u5907\u540e\u65e0\u6cd5\u4ea4\u6613\u201d\uff0c\u8fd9\u79cd\u88c5\u5907\u7a7f\u4e0a\u5c31\u5047\u6b7b\uff0c\u6e38\u620f\u65e0\u54cd\u5e94,\u4f8b\u5982\u6c38\u6052\u5957\u88c5\u221a
\u4fee\u590d\u7a7f\u6234\u540e\u81ea\u52a8\u5237\u65b0\u88c5\u5907\u5c5e\u6027\uff0c\u4f8b\u5982\u88c5\u5907\u540e\u65e0\u6cd5\u4ea4\u6613\uff0c\u7a7f\u4e0a\u7acb\u9a6c\u53d8\u4e3a\u4e0d\u53ef\u4ea4\u6613\u221a
\u6dfb\u52a0\u4e00\u4e2a!\u6700\u5c0f\u5c5e\u6027\u7684GM\u547d\u4ee4\u221a
\u4fee\u6539\u6253\u5f00\u62cd\u5356\u9700\u8981\u7b49\u7ea7\u8fbe\u52308\u7ea7\u624d\u884c\u221a
\u589e\u52a0\u5feb\u901f\u5c01\u804c\u4e1a\u7fa4\u529f\u80fd\uff0c\u914d\u7f6e\u6587\u4ef6\u91cc\u9762\u5f00\u5173\u221a
\u6dfb\u52a0\u521b\u5efa\u89d2\u8272\u8d60\u9001\u65b0\u624b\u793c\u5305\u7bb1\u5b50\u201c\u795e\u79d8\u7bb1\u5b50\u201d\u5165\u80cc\u5305
\u4fee\u590d\u6218\u795e\u4e0d\u80fd\u521b\u5efa\u5973\u89d2\u8272\u95ee\u9898\u221a
\u4fee\u590d\u9a91\u58eb\u56e2\u521b\u5efa\u51fa\u751f\u540e\uff0c\u7ed9\u4efb\u52a1\uff0c\u5426\u5219\u63a5\u4e0d\u4e86\u221a
\u4fee\u590d\u795e\u79d8\u7bb1\u5b50\u529f\u80fd\u6253\u5f00NPC 9900004_6666.js\uff0c\u8bfb\u53d6\u65b0\u624b\u793c\u5305Js\u221a
\u4fee\u590d \u4f01\u9e45\u738b\u7cfb\u5217\u88c5\u5907\u7bb1\u5b50 \u4fee\u590d\u9ed1\u9f99\u7bb1\u5b50\uff0c\u4fee\u590d\u6cd5\u8001\u738b\u76d2\u5b501 2 \uff0c\u4fee\u590d\u5730\u94c1\u9057\u5931\u7269\u7bb1\u5b50\uff0c\u4fee\u590d\u5fc3\u8df3\u7bb1\u5b501 2 3 4\u221a
\u6dfb\u52a0\u89d2\u8272\u4e0a\u7ebf\u5168\u670d\u516c\u544a\uff0c\u7537\u7684\u63d0\u793a\u5e05\u54e5xxx\u8fdb\u5165\u6e38\u620f\uff0c\u5973\u7684\u63d0\u793a\u7f8e\u5973xxx\u8fdb\u5165\u6e38\u620f\u221a
\u6dfb\u52a0GM\u4e0a\u7ebf\u663e\u793a\u5f53\u524d\u5728\u7ebf\u4eba\u6570\u221a
\u6dfb\u52a0\u89d2\u8272\u4e0a\u7ebf\u5224\u65ad\u662f\u5426\u6709\u793c\u5305\u7bb1\u5b50\uff0c\u6709\u7684\u8bdd\u8f93\u51fa\u4e00\u53e5\u8bdd\u221a
\u6dfb\u52a0\u89d2\u8272\u4e0a\u7ebf\u5224\u65ad\u662f\u5426\u4f69\u6234\u7cbe\u7075\u540a\u88c5\u3002\u63d0\u793a\u6253\u730e\u65f6\u53ef\u4ee5\u989d\u5916\u83b7\u5f9730%\u7684\u9053\u5177\u4f69\u6234\u7ecf\u9a8c\u503c\u221a
\u4fee\u590d\u914d\u7f6e\u6587\u4ef6\u5185\u6700\u5927\u89d2\u8272\u6570\u66f4\u6539\u65e0\u6548\u95ee\u9898\u221a
\u4fee\u590d\u66f4\u6362\u9891\u9053\u3001\u8fdb\u51fa\u5546\u57ce\u6389\u7ebf\u95ee\u9898\u221a
\u4fee\u590d\u6d77\u76d7\u80fd\u91cf\u6280\u80fd\u6362\u9891\u9053\u4f1a\u6389\u7ebf\u95ee\u9898\u221a
\u4fee\u590d\u53ec\u5524\u517d\u79fb\u52a8\u62a5\u9519\u221a
\u4fee\u590d\u53ec\u5524\u517d\u4f24\u5bb3\u62a5\u9519\u221a
\u4fee\u6539!killall\u6740\u602a\u547d\u4ee4\u3002\u53ef\u6b63\u5e38\u6389\u843d\u7269\u54c1\u83b7\u5f97\u7ecf\u9a8c\u221a
\u4fee\u590d\u706b\u51e4\u7403\u6280\u80fd\u221a
\u4fee\u590d\u51b0\u51e4\u7403\u6280\u80fd\u221a
\u4fee\u590d\u706b\u6bd2\u7684\u81f4\u547d\u6bd2\u96fe\u6280\u80fd\u221a
\u4fee\u590d\u98de\u4fa0\u7684\u6b66\u5668\u7528\u6bd2\u6db2\u6280\u80fd\u3001\u221a
\u4fee\u590d\u5200\u98de\u7684\u6b66\u5668\u7528\u6bd2\u6db2\u6280\u80fd\u3001\u221a
\u4fee\u590d\u591c\u884c\u8005\u7684\u6b66\u5668\u7528\u6bd2\u6db2\u6280\u80fd\u221a
\u4fee\u590d\u6d77\u76d7\u75be\u9a70 buff\u65f6\u957f1\u5206\u949f\u221a
\u4fee\u590d\u6d77\u76d7\u7684\u75be\u9a70\u9876\u6389\u8d85\u7ea7\u53d8\u8eab\u221a
\u4fee\u590d\u6781\u901f\u9886\u57df\u6280\u80fd38\u6389\u7ebf\u221a
\u4fee\u590d\u6781\u901f\u9886\u57df\u6280\u80fd\u91ca\u653e\u65f6\u9876\u6389\u8d85\u7ea7\u53d8\u8eab\u221a
\u4fee\u590d\u5947\u88ad\u8005\u7684\u6781\u901f\u9886\u57df\u221a
\u4fee\u590d\u706b\u6bd2\u5408\u51fb\uff0c\u5e26\u5143\u7d20\u5c5e\u6027\uff0c\u602a\u7269\u4f1a\u53d8\u6210\u6d45\u7ea2\u8272\u221a
\u4fee\u590d\u51b0\u96f7\u5408\u51fb\uff0c\u5e26\u5143\u7d20\u5c5e\u6027\uff0c\u602a\u7269\u4f1a\u53d8\u6210\u6de1\u84dd\u8272\u221a
\u4fee\u590d\u5251\u5ba2\u7684\u4f24\u5bb3\u53cd\u51fb\u221a
\u4fee\u590d\u51c6\u9a91\u58eb\u7684\u4f24\u5bb3\u53cd\u51fb\u221a
\u4fee\u590d\u6218\u795e\u6297\u538b\u221a
\u4fee\u590d\u6d77\u9e25\u7a7a\u88ad\u4f1a\u5bfc\u81f4\u522b\u4eba38\u221a
\u4fee\u590d\u6218\u795e\u6218\u6597\u6b65\u4f10\u5c01\u5305\u62a5\u9519\u221a
\u4fee\u590d\u6218\u795e\u4e3b\u653b\u6280\u80fd\u53cc\u91cd\u4e09\u91cd\u91cd\u51fb\u5c01\u5305\u62a5\u9519\u221a
\u4fee\u590d\u796d\u7940\u7684\u795e\u5723\u7948\u7977\u6280\u80fd\uff0cBUFF\u6d88\u5931\u540e\uff0c\u7ecf\u9a8c\u6548\u679c\u5374\u8fd8\u5728\u7684\u95ee\u9898\u3002(\u8bbe\u7f6eBUFF\u65f6\u5e38\u4e3a120\u79d2\uff0cBUFF\u6d88\u5931\u540e\uff0c\u7ecf\u9a8c\u83b7\u5f97\u91cf\u8fd8\u539f)\u221a
\u4fee\u590d\u62f3\u624b\u7684\u80fd\u91cf\u83b7\u5f97\u6280\u80fd\uff0c\u80fd\u91cf\u6761\u6ee1\u540e\uff0c50\u79d2\u540e\u80fd\u91cf\u6761\u6d88\u5931\uff0c\u80fd\u91cf\u6761\u6d88\u5931\u540e\u53ef\u4ee5\u518d\u6b21\u83b7\u53d6\u80fd\u91cf\u221a
\u4fee\u590d\u9ed1\u9a91\u58eb\u7075\u9b42\u52a9\u529b\u7cfb\u5217\u6280\u80fd\uff0c\u89e3\u51b3\u53ec\u5524\u540e\u8fc7\u4e00\u4f1a\u5c31\u4f1a\u6389\u7ebf\u7684\u95ee\u9898\u3002\u221a
\u4fee\u590d\u6709\u65f6\u5019\u4f1a\u51fa\u73b0NPC\u8bf4\u8bdd\u5904\u7406\u62a5\u9519\u95ee\u9898\u221a
\u4fee\u590d\u96c7\u4f63\u5546\u4eba24\u5c0f\u65f6\u5185\u65e0\u6cd5\u8fdb\u884c\u64cd\u4f5c\u5bfc\u81f4\u65e0\u6cd5\u9886\u53d6\u7269\u54c1\u7684BUG\u221a
\u4fee\u590d\u670d\u52a1\u7aef\u62a5\u9519java.sql.SQLException: Illegal mix of collations (utf8_general_ci,IMPLICIT) and(gbk_chinese_ci,COERCIBLE) for operation '='\u221a
\u6dfb\u52a0\u8d26\u53f7\u767b\u5f55\u6b21\u6570\u8fbe\u52306\u6b21\u8fd8\u672a\u767b\u5f55\u6e38\u620f\uff0c\u670d\u52a1\u7aef\u65ad\u5f00\u8fde\u63a5\u221a
\u6c38\u4e45\u6027\u89e3\u51b3\u5361\u53f7\u95ee\u9898\uff0c\u4e0d\u4f1a\u518d\u51fa\u73b0\u767b\u9646\u4e0d\u4e0a\uff0c\u8fdb\u4e0d\u53bb\u6e38\u620f\u95ee\u9898\u221a
\u4fee\u590d\u53cc\u767b\u5f55BUG\u3002\u5f3a\u6548\u89e3\u51b3\u767b\u5f55\u65f6\u53cc\u767b\uff0c\u8fdb\u5165\u6e38\u620f\u540e\u53cc\u767b\uff0c\u8fdb\u5546\u573a\u53cc\u767b\u5f55\u6f0f\u6d1e\u221a
\u4fee\u590d\u6570\u636e\u5e93\u6bcf2\u5c0f\u65f6\u5d29\u6e83\u4e00\u6b21\u221a
\u89e3\u51b3\u6218\u795e\u6559\u7a0b\u6280\u80fd\u8bef\u5c01\u95ee\u9898\u221a
\u8bbe\u7f6e\u5192\u9669\u5bb6\uff0c\u6218\u795e\u51fa\u751f\u5730\u56fe\u4e3a\u521d\u59cb\u52a8\u753b\u5730\u56fe\u221a
\u4fee\u590d\u5192\u9669\u5bb6\u51fa\u751f\u52a8\u753b\u3001\u4e94\u5927\u6559\u5b98\u804c\u4e1a\u4f53\u9a8c\u5730\u56fe\u52a8\u753b\u3001\u6218\u795e\u524d\u7f6e\u4efb\u52a1\u52a8\u753b\u3001\u5357\u6e2fto\u660e\u73e0\u6e2f\u5750\u8239\u52a8\u753b(\u8fd8\u6709\u5f88\u591a\u522b\u7684\u52a8\u753b,\u8fdb\u5165\u52a8\u753b\u540e\u53ef\u6b63\u5e38\u8fd4\u56de\u5730\u56fe)\uff09\u221a
\u4fee\u590d\u6218\u795e\u65b0\u624b\u6559\u7a0b\u6280\u80fd\u7cfb\u5217\uff0c\u9f20\u6807\u4e00\u79fb\u52a8\u4e0a\u53bb\u6e38\u620f\u5c31\u4f1a\u51fa\u73b0\u5361\u6b7b\u7684\u95ee\u9898\u221a
\u4fee\u590d\u6b7b\u4ea1\u4e0d\u56de\u57ce\uff09\u221a
\u6dfb\u52a0\u5207\u6362\u5730\u56fe\u8017\u65f6\u65f6\u95f4\u68c0\u6d4b\u4e0e\u670d\u52a1\u7aef\u7684\u5ef6\u8fdf\u221a
\u4fee\u590d\u7fa4\u5ba0\u6362\u56fe\u65f6\uff0c\u6e38\u620f\u672a\u54cd\u5e94\u95ee\u9898\u221a
\u4fee\u590d\u7fa4\u5ba0\u6362\u56fe\u65f6\uff0c\u6709\u4e9b\u5730\u56fe\u770b\u4e0d\u89c1\u5ba0\u7269\u7684\u95ee\u9898\u221a
\u4fee\u590d\u7fa4\u5ba0\u53ec\u5524\u8bbe\u7f6e\u4e3b\u5ba0\u7269\u51fa\u9519\u95ee\u9898\u3002\u221a
\u4fee\u590d\u602a\u7269\u81ea\u5df1\u52a0BUFF\u72b6\u6001\uff0c\u4f8b\u5982\u653b\u51fb\u65e0\u6548\u5316\uff0c\u6548\u679c\u4e00\u76f4\u4e0d\u6d88\u5931\u7684\u95ee\u9898\u221a
\u4fee\u590d\u88ab\u8bc5\u5492\u65f6\uff0c\u7ecf\u9a8c\u503c\u83b7\u5f97\u91cf\u51cf\u5c11\u221a
\u4fee\u590dbosslog\u6bcf\u5929\u96f6\u70b9\u91cd\u7f6e\u6dfb\u52a0\u91cd\u7f6ebosslog\u8868\u7684\u4ee3\u7801\uff01\u221a
\u4fee\u590d\u73a9\u5bb6\u5229\u7528\u4e0d\u5728\u540c\u4e00\u5730\u56fe\u5374\u53ef\u4ee5\u4ea4\u6613\uff0c\u5237\u526f\u672c\u9053\u5177\u7684BUG,\u6dfb\u52a0\u7981\u6b62\u73a9\u5bb6\u4e0d\u5728\u540c\u4e00\u5730\u56fe\u65e0\u6cd5\u63a5\u53d7\u4ea4\u6613\uff01\u221a
\u6dfb\u52a0\u5c4f\u5e55\u4e2d\u95f4\u9ec4\u8272\u5b57\u4f53\u7684\u529f\u80fd
\u4fee\u590d\u9493\u9c7c\u7cfb\u7edf \u589e\u52a0\u9493\u9c7c\u914d\u7f6e\uff0c\u914d\u7f6e\u4fee\u6539\u9493\u9c7c\u7269\u54c1\u4e0d\u53d7\u670d\u52a1\u7aef\u9650\u5236\uff01\u9a6c\u4e0a\u4fee\u6539\u9a6c\u4e0a\u751f\u6548\uff01\u65e0\u9700\u91cd\u542f\uff01\u221a
\u6dfb\u52a0\u5b8c\u7f8e\u7834\u653b\u7cfb\u7edf \u914d\u7f6e\u589e\u52a0\u662f\u5426\u5f00\u542f\u7834\u653b\u7cfb\u7edf \u7834\u529f\u4f24\u5bb3\u4e0a\u9650\u8bbe\u7f6e  \u7834\u529f\u4f24\u5bb3\u5904\u7406 \u4eff\u5b98\u65b9\u7248\u672c\u7834\u529f\u5c31\u51991-3\u5c31\u5199\u4e86\u3002\u5982\u679c\u662f\u5fae\u53d8\u51995-10 \u8d85BT\u5199 10-20
\u6dfb\u52a0\u5927\u91cf\u7684\u65e5\u5fd7\u8bb0\u5f55\u7a0b\u5e8f\u3002\u221a
\u4fee\u590d\u4efb\u52a1\u7cfb\u7edf\u4efb\u52a1\u9053\u5177\u4e22\u5931\u65f6\uff0c\u53ef\u91cd\u65b0\u9886\u53d6\u4efb\u52a1\u9053\u5177\uff09\u221a
\u6210\u4efb\u52a1\u7684\u590d\u6d3b\u7279\u6548\uff0c\u53bb\u6389\u4e86\uff0c\u6539\u6210\u539f\u59cb\u83b7\u5f97\u7ecf\u9a8c\u7279\u6548\uff09\u221a
\u4fee\u590d\u73a9\u5bb6\u5229\u7528\u53ef\u91cd\u65b0\u9886\u53d6\u4efb\u52a1\u9053\u5177\u529f\u80fd\u8fdb\u884c\u5237BUG\u6f0f\u6d1e\uff0c\u5df2\u4fee\u590d\u3002\uff09\u221a
\u4fee\u590d\u5546\u57ce\u9001\u6212\u6307\u5e26\u5bf9\u65b9\u540d\u5b57\u221a
\u4fee\u590d\u5546\u57ce\u9001\u793c\u53ef\u4ee5\u83b7\u5f97\u4eba\u6c14\u503c+1\u221a
\u4fee\u590d\u5546\u57ce\u9001\u793c\u5bf9\u65b9\u80fd\u6536\u5230\u6d88\u606f\u63d0\u793aXXX\u8bf7\u8fdb\u5165\u5546\u57ce\u67e5\u770b\u221a
\u4fee\u590d\u5546\u57ce\u5bbf\u547d\u526a\u5200\u221a
\u4fee\u590d\u5546\u57ce\u5fc3\u810f\u5587\u53ed\u989c\u8272\u4e0d\u5bf9\u7684\u95ee\u9898\u221a
\u4fee\u590d\u5546\u57ce\u5c0f\u9ed1\u677f1\u5929\u30017\u5929\u221a
\u4fee\u590d\u5546\u57ce\u4e00\u6b21\u6027\u6362\u773c\u8272\u9053\u5177\u221a
\u4fee\u590d\u5546\u57ce\u9053\u5177\u80cc\u5305\u6269\u5145\u3001\u88c5\u5907\u3001\u6d88\u8017\u3001\u5176\u4ed6\u3001\u7279\u6b8a/\u4ed3\u5e93\u221a
\u4fee\u590d\u5546\u57ce\u9053\u5177\u680f\u65c1\u8fb9\u7684\u5feb\u901f\u6269\u5145\u80cc\u5305\uff0c\u5feb\u901f\u6269\u5145\u4ed3\u5e93\u7684\u529f\u80fd\uff0c600\u70b9\u5377\uff0c\u6bcf\u6b21\u6269\u51454\u4e2a\u683c\u221a
\u4fee\u590d\u5546\u57ce\u6d17\u80fd\u529b\u503c\u9053\u5177\uff0c\u53ef\u4ee5\u51cfHPMP\u4e86\u3002\u53ef\u4ee5\u6d17\u8840\u4e86\u221a
\u4fee\u590d\u5546\u57ce\u9053\u5177\u53d6\u540d\u9053\u5177\u221a
\u4fee\u590d\u5546\u57ce\u5c01\u5370\u4e4b\u9501\uff0c7\u5929\u7684\uff0c30\u5929\u7684\uff0c90\u5929\u7684\uff0c365\u5929\u7684\uff0c\u6c38\u4e45\u7684\u221a
\u4fee\u590d\u5546\u57ce\u8c46\u8c46\u76d2\u5145\u503c\u8c46\u8c46\u221a
\u6539\u53d8cc\u51fd\u6570\uff0c\u6362\u9891\u9053\u5237\u65b0\u6539\u6210\u72b6\u6001\u5237\u65b0\uff08\u5c31\u662f\u4ece\u65b0\u8f7d\u5165\u8fdb\u5730\u56fe\u5c01\u5305\uff0c\u5047\u9000\u771f\u8fdb\uff09\u221a
\u4fee\u590d\u5546\u57ce\u9b54\u6cd5\u6c99\u6f0f\u9053\u5177\uff0c\u53ef\u4ee5\u5ef6\u957f\u9053\u5177\u5230\u671f\u65f6\u95f4\u30027\u5929/20\u5929/30\u5929/50\u5929/99\u5929\u221a
\u961f\u4f0d\u91cd\u4fee\uff0c\u521b\u5efa\u961f\u4f0d\u3001\u89e3\u6563\u961f\u4f0d\u3001\u9a71\u9010\u6210\u5458\u3001\u66f4\u65b0\u961f\u4f0d\u3001\u6539\u53d8\u961f\u957f\u3001\u961f\u5458\u8840\u6761\u5168\u90e8OK\u221a
\u4fee\u590d\u6218\u795e\u7684\u5229\u7433\u53ec\u5524\u517d\u7684\u7cfb\u5217\u529f\u80fd\u3002\u4f8b\u5982\u5bf9\u8bdd\uff0c\u4f8b\u5982\u4e0a\u4e0b\u7ebf\u53ec\u5524\uff0c\u4f8b\u5982\u8fc7\u56fe\u4e0d\u4f1a\u91cd\u590d\u53ec\u5524\uff0c\u6307\u5b9a\u5730\u56fe\u624d\u51fa\u73b0\u5229\u7433\u221a
\u6dfb\u52a0079\u72ec\u7acb\u5546\u57ce\uff0c\u589e\u52a0\u72ec\u7acb\u5546\u57ce\u63a7\u5236\u53f0\uff0c\u5546\u57ce\u53ef\u4ee5\u4ece\u6570\u636e\u5e93\u66f4\u6539\u9053\u5177\u221a
\u4fee\u590d\u5192\u9669\u5bb6\uff0c\u9a91\u58eb\u56e2\uff0c\u6218\u795e\uff0c\u7687\u5bb6\u9a91\u5ba0 \u767d\u96ea\u4eba\u6280\u80fd\u221a
\u4fee\u590dwz\u4fee\u6539\u53ec\u5524\u517d\u4f24\u5bb3\u8fc7\u9ad8\u3002\u65ad\u5f00\u5176\u8fde\u63a5\u221a
\u4fee\u590d\u5ba0\u7269\u65e0\u9650\u9971\u6ee1\u5ea6\u3002\u9971\u6ee1\u5ea6\u59cb\u7ec8\u4e3a100\u7684\u95ee\u9898\u3002\u221a
\u4fee\u590d\u5750\u9a91\u65e0\u9650\u75b2\u52b3\u503c\u3002\u75b2\u52b3\u503c\u59cb\u7ec8\u4e3a0\u7684\u95ee\u9898\u3002\u221a
\u4fee\u590d\u5927\u91cf\u7684\u4f20\u9001\u70b9effect\u7279\u6548 \u89e3\u51b3\u590d\u6d3b\u672f\u63d0\u793a\u5728\u5f53\u524d\u5730\u56fe\u590d\u6d3b\u4e86 \u95ee\u9898\u221a
\u4fee\u590d\u5927\u91cfquest js\u4efb\u52a1\u221a
\u4fee\u590d\u5192\u9669\u5bb6\uff0c\u6218\u795e\uff0c\u9a91\u58eb\u56e2\uff0c\u524d\u7f6e\u5168\u90e8\u5b8c\u7f8e\u4fee\u590d\u221a
\u7981\u6b62\u670d\u52a1\u7aef\u591a\u5f00\uff0c\u6dfb\u52a0\u542f\u52a8\u5355\u4e00\u5b9e\u4f8b\u221a
\u6dfb\u52a0\u670d\u52a1\u7aef\u5f00\u542f\u9a8c\u8bc1\u673a\u5668\u7801\u221a
\u4fee\u590d\u5728\u7ebf\u7edf\u8ba1\u4ee3\u7801\uff0c\u539f\u7248\u662f\u53cd\u7f16\u8bd1\u7684\uff0c\u53ef\u80fd\u4e0d\u7a33\u5b9a\u3002\u221a
\u6dfb\u52a0\u88c5\u5907\u552f\u4e00ID\u8282\u70b9\uff0c\u5b9e\u73b0\u670d\u52a1\u7aef\u590d\u5236\u88c5\u5907\u68c0\u6d4b\u7cfb\u7edf\uff0c\u53d1\u73b0\u590d\u5236\u88c5\u5907\uff0c\u7acb\u5373\u5220\u9664\u5904\u7406\u3002\u221a
\u4fee\u590d\u6e90\u4ee3\u7801\u4e2d\u7684\u5168\u90e8\u8fc7\u65f6API\u221a
\u4fee\u590d \u9b54\u6cd5\u5e08 \u98de\u4fa0 \u6d77\u76d7 \u6218\u58eb \u5f13\u7bad\u624b 1~4\u8f6c\u5b98\u65b9\u8f6c\u804c\u4efb\u52a1\u6d41\u7a0b\u3002\u221a
\u6839\u636e\u5ba2\u6237\u7aef\u6280\u6539\u6570\u636e\u8fd0\u7b97\uff0c\u4fee\u6539\u6e90\u4ee3\u7801\u7b49\u7ea7\u4f24\u5bb3\u4e0a\u9650\u68c0\u6d4b\u6570\u503c\u3002\u221a
\u5305\u5934\u6587\u4ef6\u5220\u9664\uff0c\u5305\u5934\u76f4\u63a5\u6253\u5305\u5165java\u7c7b\u4e2d\u6536\u53d1\u3002\u221a
\u4fee\u590d\u5927\u91cf\u5305\u5934\uff0c\u5220\u9664\u90e8\u5206\u5305\u5934\u3002\u221a
\u5220\u9664\u6e90\u7801\u5927\u91cf\u7684recv\u5305079\u4e0d\u5b58\u5728\u7684\u6570\u636e\u3002\u221a
\u4fee\u590d\u6d4b\u8c0e\u4eea\u9053\u5177 \u5c31\u5dee\u4e00\u4e2a\u5305\uff0c\u53ef\u80fd\u4f1a38.\u3002\u3002\u3002\u6682\u65f6\u5173\u95ed\u4f7f\u7528
\u4fee\u590d\u602a\u7269\u5927\u91d1\u86cb\uff1aID 9600000 \u7ed3\u51b0\u72b6\u6001\u4e0b\uff0c\u53ef\u4ee5500\u4e07\u4f24\u5bb3\u79d2\u6740\u602a\u7269\u3002\u8bbe\u7f6e\u5176\u514d\u75ab\u4e2d\u6bd2\u548c\u7ed3\u51b0\u221a
\u4fee\u590d\u6218\u795e\u7206\u51fb\u5f3a\u5316\u6280\u80fd\u66b4\u51fb\u6982\u738760\u548c\u6280\u80fd\u63cf\u8ff0\u7684\u767e\u5206\u4e4b10\u4e0d\u7b26\u7684\u95ee\u9898\u3002\u5bfc\u81f4\u4ee5\u4e3a\u7206\u51fb\u5f3a\u5316\u65e0\u6548\uff0c\u5176\u5b9e\u662f\u56e0\u4e3a\u66b4\u51fb\u6982\u7387\u592a\u5927\u4e86\uff0c\u611f\u89c9\u4e0d\u51fa\u6765\u4e0d\u66b4\u51fb\u7684\u65f6\u5019\u7684\u4f24\u5bb3\u221a
\u4fee\u590d\u5750\u8239\u7cfb\u7edf\uff0c\u5305\u5934\u6709\u9519\u7684\uff0c\u5904\u7406\u4e5f\u6709\u9519\u7684js\u4e5f\u6709\u9519\u7684\uff0c\u73b0\u5728\u5b8c\u5584\u4e86\u221a
\u4fee\u590d\u9053\u5177\u540d\u79f0getName()\u83b7\u53d6\u7684\u6570\u636e=null\u7a7a\u503c\u95ee\u9898\uff0c\u4f8b\u5982\u5587\u53ed\u5237\u51fa\u6765\u5982\u679c\u83b7\u53d6\u540d\u79f0\uff0c\u90fd\u662fNull  - -!!! \u5df2\u4fee\u590d\u5b8c\u6bd5\u221a
\u4fee\u590d\u602a\u7269\u5609\u5e74\u534e\uff0c\u53ec\u5524\u6280\u80fd38\u95ee\u9898\u221a
\u4fee\u590d\u796d\u7940\u7684\u51c0\u5316\u6280\u80fd\uff0c\u53ef\u4ee5\u7ed9\u7ec4\u961f\u6210\u5458\u89e3\u9664\u5f02\u5e38\u72b6\u6001\u221a
\u4fee\u590d\u6218\u795e\u77db\u8fde\u51fb\u5f3a\u5316\u3001\u7206\u51fb\u5f3a\u5316\u221a
\u4fee\u590dBOSS\u514d\u75ab\u6bd2BUFF\u221a
\u4fee\u590d\u51b0\u96f7\u6d88\u8017MP\u5904\u7406\u221a
\u4fee\u590d\u72ec\u7acb\u5546\u57ce\u7684\u4e00\u4e9bBUG.\u221a
\u6dfb\u52a038\u65e5\u5fd7\u8bb0\u5f55\u221a
\u4fee\u590d\u6240\u6709\u6253BOSS\u6389\u7ebf\uff0c\u4fee\u590d\u624e\u6606\u82b1\u5c4f\u3001BOSS\u73b0\u5728\u7a33\u5b9a\u7684\u4e00B\u221a
\u4fee\u590d\u81ea\u7531\u6ce1\u70b9\u221a
\u53d6\u6d88\u5927\u64c2\u53f0\u6ce1\u70b9\u221a
\u6dfb\u52a0\u65b0PVP\u7cfb\u7edf\u221a
\u6dfb\u52a0\u65b0\u8d4c\u535a\u7cfb\u7edf\u221a
\u4fee\u590d\u4e00\u4e9b\u6307\u4ee4\u221a
\u4fee\u590d\u5237\u602a\u7ebf\u7a0b\uff0c\u589e\u52a0\u5b9a\u65f6\u56683000\u6beb\u79d2=\u53733\u79d2\u949f\u3002\u4e5f\u5c31\u662f\u8bf4\u8fdb\u5165\u5730\u56fe\u540e3\u79d2\u949f\u5c31\u4f1a\u663e\u793a\u5730\u56fe\u7684\u602a\u7269(\u76ee\u524d\u5e02\u9762\u4e0a\u7684\u90fd\u7f3a\u5c11\u5b9a\u65f6\u5668\uff0c\u6240\u4ee5\u5bfc\u81f4\u8fdb\u5730\u56fe\u9700\u8981\u7b49\u5f85\u5341\u51e0\u4e8c\u5341\u79d2\u624d\u4f1a\u51fa\u73b0\u602a\u7269)
\u6dfb\u52a0\u5224\u65ad\uff0c\u5f53\u5730\u56fe\u89d2\u8272\u4e3a0\u65f6\uff0c\u5f53\u524d\u5730\u56fe\u4e0d\u5237\u51fa\u602a\u7269\uff01\u6027\u80fd\u4e0d\u77e5\u9053\u8282\u7701\u591a\u5c11\u500d\u4e86\uff01\u221a
\u8bbe\u7f6e\u602a\u7269\u9996\u6b21\u5237\u65b0\u6570\u91cf \u589e\u52a0\u4e24\u500d\u221a
\u8bbe\u7f6e\u602a\u7269\u5237\u65b0\u6570\u91cf\u9012\u51cf\u9636\u68af\u3002\u602a\u521a\u5f00\u59cb\u5237\u65b0\u7684\u975e\u5e38\u591a\uff0c\u8d8a\u6253\u8d8a\u5c11\u3002\u6700\u540e\u53ea\u5269\u4e0b\u9ed8\u8ba4\u7684\u602a\u7269\u6570\u91cf\u3002\uff08\u5b98\u65b9\u5c31\u662f\u8fd9\u6837\uff09\u221a
\u6dfb\u52a0\u5f53\u5730\u56fe\u7269\u54c1\u6570\u91cf\u8fbe\u5230300\u65f6\uff0c\u81ea\u52a8\u6e05\u7406\u5730\u9762\u7269\u54c1\u4fe1\u606f\u221a
\u589e\u52a0\u5f00\u7aef\u9884\u8bfbNPC\u6570\u636e\u7684\u529f\u80fd\u221a
\u4fee\u6539\u5047\u6b7b\u673a\u5236\uff0c\u6dfb\u52a0\u65b0\u5f0f\u81ea\u52a8\u89e3\u5361\u3002\u221a
\u4fee\u590d\u6709\u4e9b\u65f6\u5019\u4f20\u9001\u5730\u56fe\u4f1a\u51fa\u73b038\u60c5\u51b5\u221a
\u6dfb\u52a0\u767b\u5f55\u65f6\u5019\u7684\u7ebf\u7a0b\u9501\uff0c\u9632\u6b62\u64cd\u4f5c\u8fc7\u5feb\uff0c\u5bfc\u81f4\u6e38\u620f\u80cc\u666f\u4e71\u5957\u221a
\u4fee\u590d\u9009\u62e9\u5973\u6027\u522b\u540e\uff0c\u521b\u5efa\u89d2\u8272\u65f6\u663e\u793a\u7684\u8fd8\u662f\u7537\u7684\u221a
\u4fee\u590d\u5927\u91cf\u526f\u672c\uff0c\u548cNPC,\u53cd\u5e94\u5806\uff0c\u4e8b\u4ef6\u62a5\u9519\u221a
\u4fee\u590d\u4e0a\u7ebf\u63d0\u793a\uff0c\u8fdb\u51fa\u5546\u57ce\u548c\u5207\u6362\u9891\u9053\u8001\u662f\u5237\u51fa\u516c\u544a\u70e6\u4eba\u3002\u5df2\u6539\u4e3a\u53ea\u6709\u7b2c\u4e00\u6b21\u767b\u9646\u624d\u4f1a\u5237\u51fa\u7684\u516c\u544a\u4fe1\u606f\u4e4b\u540e\u5207\u6362\u9891\u9053\u8fdb\u51fa\u5546\u57ce\u4e0d\u4f1a\u518d\u51fa\u73b0\u3002\u221a
\u4fee\u6539\u5916\u6302\u68c0\u6d4b\u7cfb\u7edf\uff0c\u4e0d\u5c01\u53f7\uff0c\u4e0d\u65ad\u7ebf\uff0c\u68c0\u6d4b\u5f02\u5e38\u81ea\u52a8\u9001\u73a9\u5bb6\u56de\u57ce\u221a
\u63a7\u5236\u53f0\u65e0\u6cd5\u53d1\u9053\u5177 -------\u5b8c\u6210 (\u670d\u52a1\u7aef\u8bbe\u7f6e\u9875\u9762\u6240\u6709\u529f\u80fd\u90fd\u53ef\u4ee5\u7528)\u221a
\u4fee\u590d\u6218\u795e\u8fde\u73af\u5438\u8840 -------\u5b8c\u6210\u221a
\u4fee\u590d\u5b581\uff0c2\u8f6c\u6280\u80fd\u70b9\u53ef\u4ee5\u70b93\u8f6c -------\u5b8c\u6210\u221a
\u4fee\u590d\u6b63\u5e38\u7b7e\u5230\u4eca\u5929\u7a81\u7136\u53d8\u62107\u5929\u7d2f\u8ba1\uff0c\u800c\u4e14\u4e0d\u65ad\u589e\u957f -------\u5b8c\u6210\u221a
\u4fee\u590d\u9f99\u4e4b\u732e\u796dHP\u5b58\u5728\u95ee\u9898 -------\u5b8c\u6210\u221a
\u4fee\u590d\u6218\u58eb\u7fa4\u4f53\u653b\u51fb\u4e0d\u6263\u8840 -------\u5b8c\u6210\u221a
\u4fee\u590d60%\u5377\u8f74\u7ed9\u4e88\u9ad8\u5c5e\u6027 -------\u5b8c\u6210\u221a
\u4fee\u590d\u65e0\u6cd5\u589e\u52a0\u6742\u8d27\u5546\u5e97\u552e\u5356\u7269\u54c1 -------\u5b8c\u6210\u221a
\u4fee\u590d\u6d77\u76d7\u80fd\u91cf\u8fd9\u4e2a\u6280\u80fd\u6709\u95ee\u9898\uff0c\u4e00\u7528\u961f\u53cb38\u6389\u7ebf -------\u5b8c\u6210\u221a
\u4fee\u590d\u51e0\u4e2a\u4f20\u9001\u70b9\u62c9\u961f\u4f0d\u6210\u5458\u7684BUG -------\u5b8c\u6210\u221a
\u4fee\u590d0\u98de\u9556\u5b50\u5f39\u65e0\u6cd5\u4e22\u5f03\u7684\u95ee\u9898\u221a -------\u5b8c\u6210\u221a
\u4fee\u590d\u56e0\u6ca1\u94b1\u5bfc\u81f4\u80cc\u53050\u91d1\u5e01\u7684\u65f6\u5019\uff0c\u5145\u503c\u98de\u9556\u5b50\u5f39\u7b49\u9053\u5177\uff0c\u4f1a\u5361\u6b7b\u7684\u95ee\u9898\u3002\u221a -------\u5b8c\u6210\u221a
\u4fee\u590d\u6c38\u6052\u7684\u8c1c\u4e4b\u86cb\uff0c\u91cd\u751f\u7684\u8c1c\u4e4b\u86cb\u221a -------\u5b8c\u6210\u221a
\u6dfb\u52a0 \u5168\u5c4f\u6361\u7269 \u5168\u5c4f\u5ba0\u5438 \u68c0\u6d4b\uff0c\u63d0\u793aGM\u6709\u73a9\u5bb6\u5728\u4f7f\u7528\u5168\u5c4f\u6361\u7269\u221a-------\u5b8c\u6210\u221a
\u4fee\u590d\u7cbe\u7075\u540a\u5760\u65f6\u95f4\uff0c \u6bcf\u5c0f\u65f6\u589e\u52a010% 3\u5c0f\u65f6\u540e\u53ef\u83b7\u5f97\u6700\u5927\u91cf 30%\u7684\u989d\u5916 \u9053\u5177\u4f69\u6234\u9644\u52a0\u7ecf\u9a8c\u503c\u221a-------\u5b8c\u6210\u221a
\u7ed9\u9053\u5177+\u65f6\u95f4\uff0c\u65f6\u95f4\u4e0d\u51c6\u786e\u221a -------\u5b8c\u6210\u221a
\u6218\u58eb\u5f3a\u529b\u653b\u51fb\u6d88\u8017\u7684MP\u6570\u91cf\uff0c\u4e0d\u7b26\u6280\u80fd\u63cf\u8ff0\u7684\u6570\u91cf\u3002(\u5df2\u6d4b\u8bd5\u3002\u3002\u5ba2\u6237\u7aef\u6280\u6539\u5bfc\u81f4\u7684\u95ee\u9898)(\u65e0\u6cd5\u4fee\u590d\uff0c\u8fd8\u539f\u6280\u6539\u5373\u53ef)\u221a -------\u5b8c\u6210\u221a
\u4fee\u590d\u68a6\u5e7b\u4e3b\u9898\u516c\u56ed\u66b4\u529b\u718a\u4f20\u9001\u95e8\u221a


\u9632\u53cc\u767b\u7ebf\u7a0b\uff0c\u5728\u89d2\u8272\u610f\u5916\u65ad\u7ebf\u65f6\uff0c\uff08\u975e\u65ad\u7ebf\u7c7bBUG\uff09\u65f6\uff0c\u518d\u6b21\u767b\u5f55\u65e0\u6cd5\u81ea\u52a8\u89e3\u5361\u7ebf\u7a0b\u4f1a\u5d29\u6e83
\u4fee\u590d\u5361\u98de\u9556BUG\uff0c\u5c31\u662f\u91d1\u94b1\u53ea\u52691.\u53cc\u8fde\u653b\u51fb\uff0c\u6d88\u8017\u7684\u662f\u5176\u4ed6\u6807\uff0c\u9762\u677f\u8fd8\u662f\u91d1\u94b1\u7684\u9762\u677f
\u672a\u4fee\u590d\u5185\u5bb9
\u9ad8\u7ea7\u77ac\u79fb\u4e4b\u77f3 \u8bb0\u5f55\u5730\u56fe\u6709\u70b9\u5c0f\u95ee\u9898 \u5220\u9664\u5730\u56fe\u540e\u8c8c\u4f3c\u4e0d\u5237\u65b0
\u6218\u795e\u6280\u80fd\u4efb\u52a1
\u804c\u4e1a\u5934\u4efb\u52a1\u811a\u672c
\u56de\u6863\u590d\u5236
\u96c7\u4f63\u590d\u5236
\u82392 \u9aa8\u9f99\u5730\u56fe\uff0c\u5bb9\u6613\u6389\u7ebf